{"pages":[{"title":"","text":"--- layout:false --- Q5tu8LoPc2","link":"/baidu_verify_Q5tu8LoPc2.html"}],"posts":[{"title":"那些年读过的文字","text":"content{:toc}一个陌生女人的来信 20180414 一个女人对男人最卑微的爱，莫过于此。 豆瓣页面 作者： [奥地利] 斯蒂芬·茨威格 我的儿子昨天死了——现在我在这个世界上只有你，只有你一个人，而你对我一无所知，你正在寻欢作乐，什么也不知道，或者正在跟人家嬉笑调情。我只有你，你从来也没有认识过我，而我却始终爱着你。 我要让你知道我整个的一生一直是属于你的，而你对我的一生却始终一无所知。 我不久之后就知道，你的这道目光好象是把对方拥抱起来，吸引到你身边，既脉脉含情，又荡人心魄，这是一个天生的诱惑者的眼光，你向每一个从你身边走过的女人都投以这样的目光，向每一个卖东西给你的女店员，向每一个给你开门的使女都投以这样的目光。这种眼光在你身上并不是有意识地表示多情和爱慕，而是你对女人怀有的柔情使你一看见她们，你的眼光便不知不觉地变得温柔起来。可是我这个十三岁的孩子对此一无所知：我的心里象着了火似的。我以为你的柔情蜜意只针对我，是给我一个人的。就在这一瞬间，我这个还没有成年的姑娘一下子就成长为一个女人，而这个女人从此永远属于你了。 在世界上没有什么东西可以比得上一个孩子暗中怀有的不为人所觉察的爱情，因为这种爱情不抱希望，低声下气，曲意逢迎，委身屈从，热情奔放，这和一个成年妇女的那种欲火炽烈、不知不觉中贪求无厌的爱情完全不同。 我的心始终为你而紧张，为你而颤动；可是你对此毫无感觉，就象你口袋里装了怀表，你对它绷紧的发条没有感觉一样。这根发条在暗中为你耐心地数着你的钟点，计算着你的时间，以它听不见的心跳陪着你东奔西走，而你在它那滴答不停的几百万秒当中，只有一次向它匆匆瞥了一眼。 离开了你，我不愿意高高兴兴、心满意足地生活，我沉湎于我那阴郁的小天地里，自己折磨自己，孤独寂寥地生活。他们给我买的花花绿绿的新衣服，我穿也不穿；我拒绝去听音乐会，拒绝去看戏，拒绝跟人家一起快快活活地出去远足郊游。我几乎足不逾户，很少上街：亲爱的你相信吗，我在这座小城市里住了两年之久，认识的街道还不到十条？我成天悲愁，一心只想悲愁；我看不见你，也就什么不想要，只想从中得到某种陶醉。再说，我只是热切地想要在心灵深处和你单独呆在一起，我不愿意使我分心。 我心里唯一的心愿就是，只想看你一眼，只想和你见一次面，只想远远地用我的目光搂抱你的脸！ 我话说的很少，因为在你身边，听你说话已经使我幸福到了极点。 现在我才知道，女人通常总要装出毫无准备的样子，假装惊吓万状，或者怒不可遏，即使她们实际上迫不及待地急于委身于人，一定要等到男人哀求再三，谎话连篇，发誓赌咒，作出种种诺言，这才转嗔为喜，半推半就。 那天晚上，我整夜呆在你的身边。你没有想到，在这之前，还从来没有一个男人亲近过我，还没有一个男人接触过或者看见过我的身体。可是你又怎么会想到这个呢，亲爱的，因为我对你一点也不抗拒，我忍住了因为害羞而产生的任何迟疑不决，只是为了别让你猜出我对你爱情的秘密，这个秘密准会叫你吓一跳的——因为你只喜欢轻松愉快、游戏人生、无牵无挂。你深怕干预别人的命运。你愿意滥用你的感情，用在大家身上，用在所有的人身上，可是不愿意作出任何牺牲。我现在对你说，我委身于你时，还是个处女，我求你，千万别误解我！我不是责怪你！你并没有勾引我，欺骗我，引诱我——是我自己挤到你的跟前，扑到你的怀里，一头栽进我的命运之中。我永远永远也不会的，我只会永远感谢你，因为这一夜对我来说真是无比的欢娱、极度的幸福。 我的儿子昨天死了——这也是你的儿子。亲爱的，这是那三夜销魂荡魄缱绻柔情的结晶，我向你发誓，人在死神的阴影笼罩之下是不会撒谎的。他是我俩的孩子，我向你发誓，因为自从我委身于你之后，一直到孩子离开我的身体，没有一个男子碰过我的身体。被你接触之后，我自己也觉得我的身体是神圣的，我怎么能把我的身体同时分赠给你和别的男人呢？ 我知道你在恋爱之中只喜欢轻松愉快，无忧无虑，欢娱游戏，突然一下子当上了父亲，突然一下子得对另一个人的命运负责，你一定觉得不是滋味。 我对此整整沉默了十一年，不久我就要默不作声直到地老天荒：总得有这么一次，让我嚷一嚷，让我说出来，我付出了多大的代价，才得到这个孩子，这个孩子是我的全部的幸福。 我只是从暗地里把花递给你，一年一次，唤醒你对那一刻的回忆——这样对我来说，于愿已足。 你说不定要问我，我怎么可能让孩子在富裕的环境里受到教育呢，怎么可能使他过一种上流社会的光明、快乐的生活呢。我最心爱的人儿，我是在黑暗中跟你说话；我没有羞耻感，我要把这件事告诉你，可是别害怕，亲爱的——我卖身了。 我不愿意栓住自己的手脚，我要随时为你保持自由。在我内心深处，在我的潜意识里，我往日的孩子的梦还没有破灭：说不定你还会再一次把我叫到你的身边，哪怕只是叫去一个小时也好。为了这可能有的一小时的相会，我拒绝了所有人的求婚，好一听到你的呼唤，就能应召而去。自从我从童年觉醒过了以后，我这整个的一生无非就是等待，等待着你的意志。 我相信只要你叫我，我就是已经躺在尸床上，也会突然涌来一股力量，使我站起身来，跟着你走。 也许说不定你在这以后会来叫我，而我将第一次对你不忠，我已经死了，再也不会听见你的呼唤：我没有给你留下一张照片，没有给你留下一个印记，就象你也什么都没给我留下一样；今后你将永远也认不出我，永远也认不出我。 我不想叫你在我最后的时刻来看我，我走了，你并不知道我的姓名，也不知道我的相貌。我死得很轻松，因为你在远处并不感到我死。要是我的死会使你痛苦，那我就咽不下最后一口气。 亲爱的，听我说，我求求你……这是我对你的第一个也是最后一个请求……为了让我高兴高兴，每年你过生日的时候，——过生日的那天，每个人总想到他自己——去买些玫瑰花，插在花瓶里。 他两手哆嗦，把信放下。然后他长时间地凝神沉思。他模模糊糊地回忆起一个邻家的小姑娘，一个少女，一个夜总会的女人，可是这些回忆，朦胧不清，混乱不堪，就象哗哗流淌的河水底下的一块石头，闪烁不定，变换莫测。阴影不时涌来，又倏忽散去，终于构不成一个图形。他感觉的一些感情上的蛛丝马迹，可是怎么也回想不起来。他仿佛觉得，所有这些形象他都梦见过，常常在深沉的梦里见到过，然而也只是梦见过而已。 他的目光忽然落到他面前书桌上的那只蓝花瓶上。瓶里是空的，这些年来第一次在他生日这一天花瓶是空的，没有插花。 上学记20180415 在微信公众号看到清华大学经管学院院长钱颖一给本科新生开的书单： 哈佛大学原校长博克的《回归大学之道》 戴蒙德的《枪炮、病菌与钢铁：人类社会的命运》 何兆武的《上学记》 打算抽时间读一下，便从《上学记》开始吧。 忏悔录-卢梭20180520 卢梭的这部忏悔录，硬着头皮看到第五章，还有很多没有看，实在是提不起兴趣，来来回回不过就是讲如何变态地多情，与年纪差很多的华伦夫人有着不正常的所谓爱情，实在看不下去了，就这样吧，不看了。 余华活着20180715 许三观卖血记20180720 兄弟20180721","link":"/2019/06/06/2017-07-07-reading/"},{"title":"那些年看过的电影","text":"content{:toc}最后的棒棒 2015 10 你无病呻吟的痛苦，远不如他们。不同的是，他们每天都在笑着面对。 豆瓣页面 在知乎上浏览某个问题的时候，看到有人推荐这个纪录片。《最后的棒棒》，名字就很吸引人，在这之前我并不知道这是重庆山城的特产职业——相当于扁担挑夫一样。去豆瓣搜了一下，9.7的高分。 这部纪录片的导演名叫何苦，是一名刚退伍的军人，为了拍这部纪录片，他拜一位老棒棒为师父，亲自当一名棒棒，与他们同吃同住，同劳动，同赚钱。影片的拍摄手法十分真实，让人不敢相信这是2014年发生的场景。影片从一开始便能抓住我的眼球，可能是离我所能见到的世界格格不入，这种距离感让我更加喜欢，几乎没有停歇地用了一下午和半个晚上看完了。 片中有好多个场景让我不得不强忍着眼泪。 比如为了十几块钱，老黄伸手去厕所帮主人掏东西，生病了不敢花钱买药看病，因为今年没有买医保，所以再怎么样也得坚持到明年交了医保之后再看病。老黄的女儿和女婿，也分居两地，打工换房贷。面对生病的老黄，也并没有嫌弃，女婿甚至专门请假大老远赶回家，连夜骑着摩托车赶了六七十公里的路去拿偏方。女儿抱怨自己最近一边照顾父亲一边上班太累，却被丈夫几句话又逗的哭笑不得。本来说好第一个月学徒期间，蛮牛赚的钱都归老黄，但善良的老黄却坚持要一人一半，不会算数的他只能按照古老的方式把钱一张一张平分成两份，最终蛮牛执拗不过，接受了老黄的五五分成。 赌博总是输光，为了借钱，给刚来的蛮牛主动买面包送礼物，借了钱又去赌的河南。最终他走上了干活赚钱的征途，也把借的钱还上了。 把100元假钞终于倒出手时内心备受煎熬，并没有觉得喜悦的老杭。他为了去拆迁房里拿回自己的东西而手上沾满鲜血，帮老黄拿回2200元钱时，一再拒绝老黄的酬谢。 二手房东大石，催河南交房租的时候一直不忍心开口，即便最终拖欠了九个月房租，也没有再要。 原来有些人，仅仅是活着，就已经那么不容易。反观我自己，前两周的拒稿又算什么呢，生活还是得继续，不论风雨或是晴天。希望生活会越来越美好，认真过好每一天即可。 遇见你之前 2016 7.5Me Before You 爱笑的女孩，都是天使。 豆瓣页面 相比把这部片子定义为爱情片，我更愿意认为这是一部关于陪伴与救赎的电影。 遇见你之前，Lou是一个刚刚失业、家里经济困难、需要她找份工作才能勉强维持的女孩，因为这些，她不能去攻读自己的大学专业，被禁锢在小小的世界里，她没有一技之长，所以找到了这份不需要太多技能的保姆工作——照顾车祸之后高位截瘫的Will。 遇见你之前，Will是一个标准的成功人士，有相爱的女朋友，世界各地游玩、冒险，生活多姿多彩。但一场车祸让他高位截瘫，女朋友也离他而去，和他最好的朋友在一起了。他已决定六个月后安乐死。 遇见你之后，Lou看到了之前不敢想象的自由、“奢侈”生活，他们一起去看赛马，一起去听莫扎特，一起去海滩度假。 遇见你之后，Will渐渐被这个爱笑的女孩打动了，他慢慢打开心扉，与他交谈，跟他去做不一样的事，甚至一起去参加前女友的婚礼，一起去单独在酒店过夜。 他们相爱了。 时光飞逝，六个月的时间很快过去了。就在大家看到Will情绪有所好转，以为他会改变主意、会坚强活下去的时候，Will依然不顾家人和Lou的劝说。他太痛苦了，他选择结束自己的生命，留下一笔钱给Lou，让她可以不受生活的束缚，去巴黎，去周游世界，去过自己想要的生活。 这是一场互相的救赎。 最好的疼爱，是手放开。 我们有裁决自己命运的权利，Will看似自私的安乐死，实际却是为了还自己和Lou一个自由。 泉涸，鱼相与处于陆，相呴以湿，相濡以沫，不如相忘于江湖。 与其誉尧而非桀也，不如两忘而化其道。 ——《庄子·大宗师》 全片虽然在讲述一件令人悲伤的故事，但从影片开始便洋溢着欢快的配乐和英式幽默，精美的配色、城堡、海滩，仅有偶尔几次蜻蜓点水、毫不渲染却又让人心痛不已的催泪情节。就如影片所要传达的主题一样： 即便命运不济，依然要笑着面对。 限时追捕 2003 8.02017-11-18，周六 Out of Time Matt Lee Whitlock: 饰演者 Denzel Washington （丹泽尔·华盛顿），警察局长，在与正牌妻子闹离婚，同时，出轨一个被家暴的人妻Ann。 Alex Diaz Whitlock: Matt的妻子，同为警察，职位比Matt高 Ann Merai Harrison: 被丈夫家暴，与Matt偷情的女人 Chris Harrison: Ann的丈夫，在殡仪馆工作 Chae: Matt的警察同事加好朋友，关键时候帮Matt打圆场，信任他 如果你可以忍受开局前30分钟慢悠悠的一个要和老婆离婚的男人Matt与一个被老公家暴的女人Ann之间的出轨花絮，那么后面紧凑的情节、配乐，以及好基友Chae的日常搞笑，就会让你觉得这绝对是一部值得看的电影。友情提醒，以下可能有轻微剧透，介意的话可直接看总结。 ——————————————————分界线———————————————————— 前30分钟，Matt和Ann这两个狗男女优雅地出轨，就像是找到了真爱。接着，Ann便开始装可怜，称自己不堪忍受丈夫家暴，甚至串通好了假医生，领着Matt去听检查报告，还坦然地对着假医生说: You can talk in front of him. It’s fine.（就当着他的面说吧，没事。） （其实就是说给你听的好吧。）嗯，不用猜也知道肯定是说Ann得了癌症了，Matt在一旁听的一脸地尴尬。然后就在他们走出办公室的时候，医生叫住了Matt，跟他说倒是有个法子能救，只是会很贵，而且，成功率只有17%。走到停车场，Ann不出意料地哭了，Matt心疼了，一直在旁边说： I am sorry. I am sorry. (对不起，对不起……) 回家之后就在他俩商量着怎么能从保险公司套到更多钱的时候，Ann的丈夫Chris回来了，然后Chris冲着Ann大发脾气，像是要动手的节奏。这些被躲在墙后面的Matt看在眼里，激起了内心的保护欲，假装警察巡视急促地敲开了门。 Ann带着Matt跑去保险公司把保险受益人改成Matt，Matt立马就感动了。过了几天Ann提出她想马上去国外（Switzerland）接受治疗、不想再受丈夫折磨时，Matt就把警局保险箱里的钱拿出来先给她，估计心里想着：反正保险受益人是我，几个月后Ann死了，再把保险公司的赔付放回警局上交好了。 然后，不出意外地，丈夫Chris伪造了发生在自家的火灾，还利用自己的职务之便（殡仪馆工作）弄了两具尸体放在房间了烧焦了。Matt在约定好的时间在接头的地方没有等到Ann，就知道自己大概其是被骗了，从这里开始，才有了一个警察该有的警觉，开始一边追踪，一边填坑。 当Matt费尽千辛万苦找回钱的时候，Chris岂能善罢甘休，于是又让Ann上演了一出苦肉计，又是道歉又是装可怜，说一切都是丈夫Chris威胁她这么做的。Matt说好吧，那我带着钱去找你吧。哎，男人都如此心软的吗？其实你错了，Matt不再那么傻了，他这次去是为了把Ann从Chris的魔爪里解救出来（获救后妻子Alex打开箱子，看到里面装的是开了定位的手机）。在Chris和Matt打斗的过程中，Chris子弹打光，于是跑向Ann说： Give me the gun. Give me the gun! (把枪给我，快把枪给我！) Ann一脸惊吓，失手把Chris一枪崩了，转过身来，拿枪指着Matt。Matt以为Ann神经紧张，要杀自己灭口？便赶紧安抚情绪，说没事，你那是自卫，没关系的，不会判刑，把枪放下。就在这时，一个逆转出现了，Ann的本来面目暴露出来了： What, you think Chris did this to my face? (我为什么要放下枪，你以为是Chris把我的脸打成这样的吗？) 然后镜头一转，给了一个Ann自己拿头撞向桌子伪装被打的特写。这个时候剧情就真相大白了，一直都是Ann一个人的阴谋，就连Chris也是一个傻傻的、被利用的受害者而已，根本不是被失手误杀。镜头转到Matt的好基友兼警察同事Chae那里，他看着手机定位，赶来增援的时候，车抛锚了！就在这么关键的时刻抛锚了！Ann拿着枪逼Matt交出钱，Matt退到门口，拿出了放在门口的钱箱，但Ann不想就此罢休，还要杀人灭口，一枪打中大腿，就在要开下一枪的时候，一声枪响，Ann应声倒地。那个坑队友终于赶到了！？并不是，而是同为警察的妻子赶到了！所以，全剧所要表达的就是： 关键时刻还是正房比小三靠谱!？ 总结：看完之后会发现，这不是一个警匪动作片，而是一个爱情动作喜剧片。全片要告诫所有男同胞们：对你们自己的老婆好一点，宽容点，婚后生活可能会无趣，但不要出轨，要不然，后果自负吧。就像男主角Matt Lee Whitlock在获救后对好基友Chae说的那句话，这可能是一个男人在经历这么多之后的肺腑之言了： Just never leave your wife. That’s what happened to me. （千万别出轨，要不然下场就像我一样。） 盲山 2007 9.0这时一部未能在中国国内上映的禁片。 美国田园下的罪恶 2007 9.0An American crime 施舍的权利不叫权利，强加的义务不叫义务。 豆瓣页面 三个颜色发生的当天，我相当克制地推荐了几部电影的知乎评论被贴上政2治0敏1感7的标签，对所有人不可见。 以前发生的所有公共事件，我只是默默关注，不会随意发言。这次还是先从这部纪实电影说起吧。 这是一个1965年发生在美国的真实案件。影片真实还原了一个善良可爱、受人欢迎、为了保护妹妹甘愿代她受罚的女孩Sylvia被寄宿家庭的女主人虐待致死的 Murder of Sylvia Likens 案件，全片真实而压抑。 一个柔弱无辜、手无缚鸡之力的小女孩，被一个带着四个孩子、艰难度日、心里极其变态扭曲的单亲妈妈打骂，她自己的孩子、社区的其他孩子也参与了这场惨无人性的拷打，他们用玻璃划伤她的下体，用烟头烫伤本已伤痕累累的躯体，甚至单纯地以折磨她为乐。直到最后，源自孩子的本能善良，开始忏悔自己的所作所为，害怕Sylvia死去，央求妈妈相救。最终，Sylvia还是死去了。 影片采用倒叙，以审判穿插回忆的方式还原了整个案件过程。让人触目惊心。在庭审最后，恶毒的妇人竟没有表现出丝毫的悔改之意，十分镇静地把责任推给自己的孩子，谎称是他们和Sylvia争吵打斗致死，自己吃了药昏迷在床毫不知情。所幸，终究还是得到了公正的审判，判有期徒刑20年，算是对Sylvia亡魂的安慰。 这是我看过同类型中、甚至是所有电影中最压抑的一部，没有之一。比起《熔炉》、《素媛》、《亲爱的》几部，这部对虐待拷打的过程描述的更加详细，但同时又十分克制。比如，毒妇将滚烫的烟头伸向Sylvia，只给了一个很短的镜头，和一声凄惨的尖叫，把痛苦留给观众去想象，没有刻意描写，却反而让人更加深刻，没有故意煽情，却让人更加心痛。 我详细看了1965年Sylvia虐待谋杀案，和这几天曝光的Hong Huang Lan简直如出一辙。影片中Sylvia的父母由于工作原因要经常出差在外不能照顾两个女儿，就以20美元一周的价格托付给带着四个孩子的单亲妈妈。就像如今You Er Yuan的存在一样，我们把孩子过早地丢给You Er Yuan，努力地工作，养家糊口，只有当悲剧发生时，才会一时感叹：没什么比陪伴孩子更重要。这次事件与罢免Yuan Zhang的职务而结束，这场运动，已经几乎接近尾声了，马上就会从公众的视线消失，很快便会被公众从心底里遗忘。吞噬孩子的幽灵，从这场50年前的案件，甚至几百、几千年前开始，就游荡在人间，像是一场场轮回。时代在变，科技在进步，我们正变得文明，也正变得奴性，发声无用，我们便不再发声，以为过好自己的小日子便是莫大的不易。这个娱乐至死的年代，严肃认真的事件无法在媒体上占据一席之地。这真是一个“低2端0人1口7”无处可逃的时代。安得广厦千万间，大庇天下寒士俱欢颜。生产力提高了千倍万倍的现在，“低2端0人1口7”依然逃不出天生的宿命。 我从来都没有现在如此充满希望，也从来没有现在如此充满绝望。 这是我们自己选择的时代，沉默的时代，喧嚣的时代。 希望一切会越来越好。 豪勇七蛟龙 2017 8.5The magnificent seven 那个时代，起码有侠客，伸张正义。 豆瓣页面 改编自黑泽明的《七武士》，故事设定在黄沙四起的西部。一伙强盗冲进了平静而美丽的村庄，在教堂里大开杀戒，向无辜而怯懦的村民示威，村庄随即沦陷。丈夫被杀的女人Emma用全部身家请来以Sam为首的七位勇士回到村庄，与强盗做斗争，最终为村民迎来和平。 全片弥漫着西部牛仔片的浪漫情怀，从Sam以及其他六勇士的相继亮相，到英雄聚齐，骑着骏马在夕阳下列队前进，绝妙的镜头和配乐使人热血沸腾。七勇士各有各的故事，却拥有相同的悲壮。他们或是为了给死去的家人报仇，或是为了惩治部落的叛徒，或是为了不再荒废时光。他们聚在一起，为村庄伸张正义。除了七勇士，女人Emma是村民中唯一敢站出来主动做斗争的人，当她坚定地拿着枪，在屋顶射向敌人的那刻开始，她就是无敌的，她放下了女人的软弱，与七勇士相比也毫不逊色，甚至在最后关头，果断地开枪射杀了匪首，救了Sam。 虽然剧情很老套，都是英雄伸张正义、牺牲，强盗被杀，大快人心，从一开始便能猜到结局的故事，但全片观看过程中没有一丝的沉闷，壮丽雄浑的西部景色、悲壮的交响乐与激烈精彩的打斗交融在一起，加上七勇士各自帅帅的绝招，尤其是转枪的动作，让人看得激动不已，是一部值得欣赏的西部牛仔枪战片，也是一部较为成功的翻拍片。 一个叫欧维的男人决定去死 2015 9.0A Man Called Ove 一个老人倔强背后的温柔。 豆瓣页面 一个幼年丧母、青年丧父、中年丧偶的老人，在59岁被供职43年的公司辞退了，而辞退他的，是两个刚入职的小毛孩。他决定去死，不是因为丢掉了工作，而是为了赴约——去陪已经逝去的妻子。 然而命运好像总是与他作对，他尝试过四次不同方式的自杀，但总以失败告终，就好像他并不擅长死亡（bad at dying）。每次自杀之后，往事便浮现在眼前，让我们对这个奇怪的老头有更多的了解。他的一生似乎都是倔强的、可爱的： 他并不聪明，不会追女孩子，但他可以为了再次相遇而连续好几周乘坐同一段火车； 他天真地以为把自己的房子翻新之后就不会被强拆； 他奋不顾身地冲进着火的房间，救出邻居； 为了让因为车祸残疾而不能去学校上班的妻子能够重回工作，他写信给各个相关部门，并在无人问津的情况下，冒雨建了残疾人通道； 他阻止每一个在行人通道上开过的汽车； …… 他是一个有血有肉的普通人，就像我们身边的老大爷，他不完美，甚至满身缺点，他对每个人都很冰冷，甚至恶语相向，经常骂看不惯的人“傻逼（idiots）”，但他有一颗温暖的心，他热心帮助邻居，刀子嘴背后有颗豆腐心。 这样的老人是应被人温柔以待的，所以他尝试自杀而次次失败。他坚硬的外表被同样热情可爱的邻居软化，逐渐敞开心扉，接受外来品牌（法国车和iPad），过上了短暂的幸福日子，这段日子，他的内心应该是前所未有的温暖和幸福。最终，不到半年的时间，他由于心脏问题，在一个平和的雪夜，躺在曾经的爱床上，安静地去世了，去到了与妻子第一次相遇的火车上，重逢了。 影片中有两个场景尤其让我感动：一个是Ove进门之后坐在门后，轻轻地触摸、亲吻着妻子以前穿过的衣服；另一个是Ove静静地躺在妻子的墓碑前，诉说往事。 这是一部温暖的喜剧片，用诙谐的节奏去讲述死亡，其实也是在讲述人生。一个一生都在经历不幸、亲人渐远、伤痕累累的普通老人，他的普通人生，却让人如此感动。 丘奇先生 2016 7.520180316 Fri. Mr. Church 豆瓣页面 陪伴是最长情的告白，无关爱情，却感人至深的故事。穿插着恰到好处的爵士乐，正是影片的发生地——LA的灵魂所在。 陪伴是相互的，Mr. Church所给的陪伴与慰藉，也在晚年得到了回报。 一部足以温暖人心的影片。 决战犹马镇 2007 7.53:10 To Yuma 豆瓣页面 一个因参加战事保家卫国而断腿的退伍士兵Dan，与一家人生活在自己的农场里，却饱受干旱的困扰和税收的折磨。为了挣$200而选择押送大盗Ben Wade去Yuma镇。一路上艰难坎坷，当所有人都为了保命要逃跑的时候，只有他坚持留下并决心押送Ben上火车。 Ben，侠骨柔肠，为了成全Dan，而跟他一道躲避枪杀，甚至在Dan死后，不惜杀死自己所有的同党，自己默默走向火车上的枷锁。 西部骑士风范，是Dan，也是Ben。 冲撞 2004 7.020180323 Fri. Crash 豆瓣页面 （豆瓣翻译成撞车是什么鬼） 种族的偏见与误解。多个线索并发，又巧妙地融合到一起。结局整体上还算温馨。这部电影获得第78届奥斯卡金像奖，让当年李安的《断背山》无缘奥斯卡。也难怪，这么政治正确的片子。 推销员 2016 6.520180324 Sat. The Saleman 豆瓣页面 伊朗电影。压抑与扭曲的人性，非正常的夫妻关系。丈夫的一意孤行，最终导致两个家庭的破灭。 黑鹰坠落 2002 8.520180330 Fri. Black Hawk Down 豆瓣页面 无比真实的战争片。美国大兵与索马里的的阵地战。战争里没有成败，没有赢家，无休止的互相伤害和厮杀。 黄金三镖客 1966 8.520180404 Wed. The good, The bad, and the ugly 豆瓣页面 先是在Apple Music上看到同名专辑的推送，点开了第一首，就喜欢上了这样的节奏感和旋律，西部风。然后去看豆瓣，发现评分出奇的高9.1，于是就在亚马逊上看了。3个小时，时间很长。1966年能排出这样的水准真的很棒，故事没得说。不过感觉偶尔节奏会有一点拖拉。 其实是有个镖客三部曲，分别是《荒野大镖客》、《黄昏双镖客》和《黄金三镖客》，最后一部公认是最好的一部，索性其他两部就暂时不看了。 一呼一吸 2016 9.020180406 Fri. Breathe 豆瓣页面 这是一部由真实故事改编的电影。男主Robin在结婚后不久就身患重病，只能依靠呼吸机生存，离开呼吸机两分钟就会死。妻子Diana选择接受这一切并将Robin从医院接出，要让他过正常人的生活而不要待在监狱一样的医院。这是一个真实的浪漫故事。 和几岁儿子的对话： 我们可以去非洲看大象吗？ 那很冒险 我可以推你去 那你要推很远很远 我不怕 于是一家三口开着改装后的车去旅行，后来甚至坐飞机去西班牙。不料呼吸机坏了，只能手动来维持呼吸。路过的人们都停了下来陪他们，一群人聚在小山坡上开party，等着机械师Teddy从英国飞来西班牙。 他们决定帮助更多病人走出医院，找到赞助造了更多同样的带呼吸机的轮椅，还跑去德国医学学术会议上呼吁在座的医生们让病人能真正地像个健康人一样生活： I don’t want to just survive I want to truly live To open the gates and set them free 最终，病情加重，Robin决定安乐死，把亲人朋友聚在一起，举行了个告别会（leaving party）。 当我们自己将要离开这世间，是否有同样的勇气笑着面对？ 当挚爱的亲人将要离开这世间，我们是否有勇气笑着面对？ My love, My life。 儿子Johnathon是这部电影的出品人，以此献给他伟大的父亲，伟大的母亲。 原来，一呼一吸都是如此宝贵的事情，并非理所应当。呼吸，呼吸，勇敢而精彩地活下去，可能就是本片想要给我们传达的全部。建议配合同类型的《遇见你之前》一起观看。 藩篱 2016 7.0Fences 家，是这辈子都难以走出的藩篱，摆脱不了。 豆瓣页面 同名话剧改编的电影。获得第89届奥斯卡最佳影片提名，女主获得第70届英国电影学院奖最佳女配角。看得有点压抑。 裁缝 2015 8.020180407 Sat. The Dressmaker 忍无可忍，所以以牙还牙，这是对付坏人应有的方式。 豆瓣页面 开篇即喜欢。慢放的俯拍画面，快节奏的音乐。 坐着长途汽车回到家乡小镇的女主（泰坦尼克号的女主角Kate Winslet饰演），放下手提箱，点一支烟，不紧不慢地说一句： I am back. You bastards. （老娘回来了，你们这些混蛋！） 还以为从这开始就要复仇了。然而并没有。她时尚的装扮在这荒僻的小镇显得格格不入，引得男人直眼，女人红眼。 她试图让假装失忆的母亲记起自己。她为小镇上的所有女人做漂亮的衣服，让她们变得时尚。然而，小镇上的人似乎并没有因此而念她的好。我一直在等待，在想到底葫芦里卖的是什么药，不是说要复仇的吗？ 看了很久才发现，原来这不是复仇，她是想通过这种方式让父老乡亲们重新接纳自己，弄清自己当时被轰赶出小镇的秘密。男友Teddy的死，让她一度沉闷，继而爆发，而这时母亲却变得异常强大，鼓励她，并密谋一场报复，对小镇上所有人的报复。 最终，母亲意外去世。她成功实施了报复，放火烧了整个小镇，坐着火车远去，留下小镇人一片惊慌地看着被毁掉的家园。简直大快人心！ 这部澳大利亚的电影画面十分考究，配乐也很吸引人。甚至还获得了第19届美国服装设计工会奖。绝对是值得看的一部片子。 乱世佳人（飘） 193920180407 Sat. Gone with the wind 豆瓣页面 将近4个小时。以后再看。 血色将至 2007 8.520180427 There Will Be Blood 豆瓣页面 这世上本就没有什么救世主，那些声称自己是上帝使者的人，不过都是招摇撞骗。通过自己双手去创造，去追求，才是通往幸福的唯一方式。然而，石油大亨拥有了天大的财富，却依然落得众叛亲离，不禁让人唏嘘。全片配色和配乐都营造出很压抑的气氛。这可能就是生活，无奈的足以把人逼疯，却无法左右。 特洛伊 2004 9.5Troy 豆瓣页面 史诗般的杰作，无须多言，看就对了。 We ask ourselves: will our actions echo across the centuries?will strangers hear our names long after we’re gone and wonder who we were, how bravely we fought, how fiercely we loved? The Thessalonian man you are fighting, he is the biggest man I’ve ever seen. That’s why no one will remember your name. You see you want to die for love, but you know nothing about love, and you know nothing about dying. War is young man dying, old man talking. The gods envy us. They envy us because we are mortal, because any moment might be our last. Everything is more beautiful because we are doomed. You will never be lovelier than you are now. 佛罗里达乐园 2017 5.020180511 The Florida Project 豆瓣页面 豆瓣评分8.0的所谓独立电影，导演被称作很擅长描绘美国底层人民生活的人。然而看了半个小时并无特别的感觉，弃了。一帮熊孩子对着别人的车吐唾沫，骂着脏话，并不可爱。","link":"/2019/06/06/2017-06-20-movie/"},{"title":"一部纪录片《最后的棒棒》","text":"content{:toc}看到这部纪录片的时候我非常震撼，这是一部无比真实地描述“低端人口”的影视作品，因此我觉得需要单独一篇文章来写。 你无病呻吟的痛苦，远不如他们。 不同的是，他们每天都在笑着面对。 豆瓣页面 在知乎上浏览某个问题的时候，看到有人推荐这个纪录片。《最后的棒棒》，名字就很吸引人，在这之前我并不知道这是重庆山城的特产职业——相当于扁担挑夫一样。去豆瓣搜了一下，9.7的高分，看完之后，我在豆瓣上为它打了10分。 这部纪录片的导演名叫何苦，是一名刚退伍的军人，为了拍这部纪录片，他拜一位老棒棒为师父，亲自当一名棒棒，与他们同吃同住，同劳动，同赚钱。他们住了十几年的危房，与繁华热闹的解放碑只有几公里。影片的拍摄手法十分真实，让人不敢相信这是2014年发生的场景。影片从一开始便能抓住我的眼球，可能是与我所能见到的世界格格不入，这种距离感让我更加喜欢，几乎没有停歇地用了一下午和半个晚上看完了。 片中有好多个场景让我不得不强忍着眼泪： 为了十几块钱，老黄伸手去厕所帮主人掏东西，用肥皂洗了好几遍手，主人说肥皂不要了，拿出去扔了。生病了不敢花钱买药看病，因为今年没有买医保，所以再怎么样也得坚持到明年交了医保之后再看病。老黄的女儿和女婿，分居两地，打工还房贷。面对生病的老黄，并没有嫌弃，女婿甚至专门请假大老远赶回家，连夜骑着摩托车赶了六七十公里的路去拿偏方。女儿抱怨自己最近一边照顾父亲一边上班太累，却被丈夫几句话又逗的哭笑不得。本来说好第一个月学徒期间，蛮牛赚的钱都归老黄，但善良的老黄却坚持要一人一半，不会算数的他只能按照古老的方式把钱一张一张平分成两份，最终蛮牛执拗不过，接受了老黄的五五分成。 赌博总是输光，为了借钱，给刚来的蛮牛主动买面包送礼物，借了钱又去赌的河南。最终他走上了干活赚钱的征途，也把借的钱还上了。 把100元假钞终于倒出手时内心备受煎熬，并没有觉得喜悦的老杭。他为了去拆迁房里拿回自己的东西而手上沾满鲜血，帮老黄拿回2200元钱时，一再拒绝老黄的酬谢。 二手房东大石，催河南交房租的时候一直不忍心开口，即便最终拖欠了九个月房租，也没有再要。 原来有些人，仅仅是活着，就已经那么不容易。他们虽然每天都在痛苦地忙碌，却不得不乐观地看待一切，生活中充满了真善美。这也是导演在全片中一直所要传达给我们的：人生实苦，请开心活着。 以后有时间重新再看的话，再抄录一些让我感动的旁白。 原片目前可在爱奇艺上观看： http://www.iqiyi.com/a_19rrham861.html 看到一则相关新闻，载于澎湃： “最后的棒棒”被骗千余元，骗子看纪录片三年后还钱写道歉信 更多背景和故事，点击官方介绍网站： 人民永远是文艺的源头苦水 访退伍军官何苦–华龙网","link":"/2019/06/06/2018-05-01-bangbang/"},{"title":"Markdown","text":"content{:toc} 编辑器推荐+Pandoc文件格式转换Markdown是一种轻量级的编辑语言，只需要简单的添加符号如#等就可以对文本格式进行编辑。 在我尝试了众多的win平台、macOS平台的Markdown编辑器之后，强烈推荐Typora，优点如下： 界面简洁美观！！！编辑器不漂亮怎么有心情一直用 所见即所得，不像很多编辑器那样左右分屏，左边代码、右边输出 Win 和 macOS平台都有（当然，个人觉得macOS版本更漂亮一些），搭配Dropbox方便同步编辑，我现在已经重度依赖了，办公室的Win和自己的MacBook之间轻松切换 导出功能强大，可以导出PDF、html，搭配免费轻巧的pandoc之后还可以导出 docx、OpenOffice、LaTex等多种格式，测试了一下docx版本没有出现格式混乱的情况，更重要的是不用回到pandoc的命令行形式的转换，在Typora界面就可以导出，对技术小白很友好","link":"/2019/06/06/2017-12-31-markdown/"},{"title":"那些年听过的音乐","text":"content{:toc}陈绮贞 20180401 Apple Music今天推送给我专辑Think Twice，歌手是Cheer Chen，没反应过来是谁，听过之后很喜欢，温柔的女声，轻轻吟唱，淡淡诉说悲伤，触动人心。然后就去查了这个歌手是谁，才发现其实就是陈绮贞。以前听过《旅行的意义》，可能是没什么感觉，没什么深刻的印象，重新搜索出来听，突然觉得很是悲伤。尤其是最后一句：你离开我，就是旅行的意义。于是找来整张专辑《华丽的冒险》（2005）来听： 旅行的意义 腐朽 Sentimental Kills 华丽的冒险 太多 花的姿态 Self 80%完美的日子 表面的和平 静静的生活 最初的起点 另附歌词《旅行的意义》： 你看过了许多美景 你看过了许多美女 你迷失在地图上每一道短暂的光阴 你品尝了夜的巴黎 你踏过下雪的北京 你熟记书本里每一句你最爱的真理 却说不出你爱我的原因 却说不出你欣赏我哪一种表情 却说不出在什么场合我曾让你动心 说不出离开的原因 你累积了许多飞行 你用心挑选纪念品 你收集了地图上每一次的风和日丽 你拥抱热情的岛屿 你埋葬记忆的土耳其 你留恋电影里美丽的不真实的场景 却说不出你爱我的原因 却说不出你欣赏我哪一种表情 你却说不出在什么场合我曾让你分心 说不出旅行的意义 你勉强说出你爱我的原因 却说不出你欣赏我哪一种表情 却说不出在什么场合我曾让你动心 说不出旅行的意义 勉强说出你为我寄出的每一封信 都是你离开的原因 你离开我 就是旅行的意义 其实我们都很奇怪，以前不喜欢的东西，某一天突然就喜欢的欲罢不能了。这两天一直在循环Think Twice和华丽的冒险两个专辑，喜欢淡淡的忧伤，却痛彻心扉。 RCA Best 100 [ ] RCA百张古典名盘之001：史上最受欢迎的巴洛克名曲 [x] RCA百张古典名盘之002：维瓦尔第“四季” [x] RCA百张古典名盘之003：巴赫“管弦乐组曲”(全四曲) [ ] RCA百张古典名盘之004：巴赫“勃兰登堡协奏曲” [ ] RCA百张古典名盘之005：巴赫“无伴奏大提琴组曲”(全六曲) [ ] RCA百张古典名盘之006：巴赫“钢琴创意曲与交响曲四首二重奏” [ ] RCA百张古典名盘之007：巴赫“哥德堡变奏曲意大利协奏曲” [ ] RCA百张古典名盘之008：莫扎特“第39、40、41‘朱庇特’交响曲” [ ] RCA百张古典名盘之009：莫扎特“两部弦乐小夜曲、三部序曲” [ ] RCA百张古典名盘之010：莫扎特“第20、21钢琴协奏曲” [ ] RCA百张古典名盘之011：莫扎特“第23、24钢琴协奏曲” [ ] RCA百张古典名盘之012：莫扎特“第4、5小提琴协奏曲交响协奏曲” [ ] RCA百张古典名盘之013：莫扎特“第1、2长笛协奏曲长笛竖琴协奏曲” [ ] RCA百张古典名盘之014：莫扎特“单簧管协奏曲与五重奏曲” [ ] RCA百张古典名盘之015：莫扎特“长笛四重奏曲全集” [ ] RCA百张古典名盘之016：莫扎特“著名钢琴奏鸣曲集” [ ] RCA百张古典名盘之017：贝多芬“田园命运交响曲” [x] RCA百张古典名盘之018：贝多芬“第九‘合唱’交响曲” [ ] RCA百张古典名盘之019：贝多芬“英雄”舒伯特“未完成” [ ] RCA百张古典名盘之020：贝多芬“第五钢琴协奏曲‘皇帝’第十八钢琴奏鸣曲” [ ] RCA百张古典名盘之021：贝多芬勃拉姆斯“D大调小提琴协奏曲” [ ] RCA百张古典名盘之022：贝多芬“小提琴奏鸣曲‘春天’‘克鲁采’” [ ] RCA百张古典名盘之023：贝多芬“钢琴奏鸣曲‘悲怆’‘月光’‘热情’‘告别’” [ ] RCA百张古典名盘之024：罗西尼威尔第“最著名歌剧序曲” [ ] RCA百张古典名盘之025：舒伯特“第九‘伟大’交响曲” [ ] RCA百张古典名盘之026：舒伯特“死与少女”贝多芬“拉祖莫夫斯基” [ ] RCA百张古典名盘之027：当代中提琴唯一代言人巴什梅特极品录音 [ ] RCA百张古典名盘之028：柏辽兹“幻想交响曲” [ ] RCA百张古典名盘之029：柴科夫斯基门德尔松“小提琴协奏曲” [ ] RCA百张古典名盘之030：肖邦“第1第2钢琴协奏曲”(全二部) [ ] RCA百张古典名盘之031：肖邦“夜曲”全集I(1-10) [ ] RCA百张古典名盘之032：肖邦“夜曲”全集II(11-19) [ ] RCA百张古典名盘之033：肖邦“圆舞曲十四首” [ ] RCA百张古典名盘之034：肖邦“波洛奈兹舞曲(波兰舞曲)”(全七首) [ ] RCA百张古典名盘之035：肖邦“叙事曲谐谑曲”(全集) [ ] RCA百张古典名盘之036：肖邦精选集 [ ] RCA百张古典名盘之037：肖邦“玛祖卡舞曲”全集I(1-25) [ ] RCA百张古典名盘之038：肖邦“玛祖卡舞曲”全集II(26-51) [ ] RCA百张古典名盘之039：肖邦“第2第3钢琴奏鸣曲幻想曲” [ ] RCA百张古典名盘之040：肖邦最佳曲目 [ ] RCA百张古典名盘之041：基辛卡内基肖邦作品音乐会 [ ] RCA百张古典名盘之042：肖邦舒曼格里格钢琴作品集 [ ] RCA百张古典名盘之043：狂欢节童年情景阿拉伯风格曲 [ ] RCA百张古典名盘之044：舒曼歌曲集 [ ] RCA百张古典名盘之045：瓦格纳“管弦乐名曲集” [ ] RCA百张古典名盘之046：李斯特肖邦勃拉姆斯钢琴作品精选 [ ] RCA百张古典名盘之047：普罗科菲耶夫弗朗克长笛奏鸣曲 [ ] RCA百张古典名盘之048：布鲁克纳“第四浪漫交响曲” [ ] RCA百张古典名盘之049：布鲁克纳“第七交响曲” [ ] RCA百张古典名盘之050：布鲁克纳“第九交响曲” [ ] RCA百张古典名盘之051：维也纳新年音乐会(1996) [ ] RCA百张古典名盘之052：勃拉姆斯交响曲全集之“第一第三交响曲” [ ] RCA百张古典名盘之053：勃拉姆斯交响曲全集之“第二第四交响曲” [ ] RCA百张古典名盘之054：勃拉姆斯“小提琴奏鸣曲”(全集) [ ] RCA百张古典名盘之055：勃拉姆斯“第一第二大提琴奏鸣曲” [ ] RCA百张古典名盘之056：勃拉姆斯“浪漫曲钢琴小品集” [ ] RCA百张古典名盘之057：布鲁赫维厄当“协奏曲华章” [ ] RCA百张古典名盘之058：比才“歌剧‘卡门’精彩选段” [ ] RCA百张古典名盘之059：柴科夫斯基“第五交响曲1812序曲” [ ] RCA百张古典名盘之060：柴科夫斯基“第六交响曲‘悲怆’” [ ] RCA百张古典名盘之061：柴科夫斯基“第一钢琴协奏曲”拉赫玛尼诺夫“第二钢琴协奏曲” [ ] RCA百张古典名盘之062：德沃夏克舒曼大提琴协奏曲 [ ] RCA百张古典名盘之063：最精彩的福雷 [ ] RCA百张古典名盘之064：马勒“第四交响曲” [ ] RCA百张古典名盘之065：德彪西“管弦乐名曲集” [ ] RCA百张古典名盘之066：理查施特劳斯“三部著名交响诗” [ ] RCA百张古典名盘之067：最精彩的西贝柳斯 [ ] RCA百张古典名盘之068：西贝柳斯普罗科菲耶夫格拉祖诺夫“小提琴协奏曲” [ ] RCA百张古典名盘之069：格拉纳多斯“钢琴名曲集” [ ] RCA百张古典名盘之070：拉赫玛尼诺夫“第三钢琴协奏曲第二钢琴奏鸣曲” [ ] RCA百张古典名盘之071：拉赫玛尼诺夫“钢琴前奏曲”(全集) [ ] RCA百张古典名盘之072：最脍炙人口的英国管弦乐作品 [ ] RCA百张古典名盘之073：拉威尔“管弦乐名曲集” [ ] RCA百张古典名盘之074：雷斯皮基“罗马三部曲” [ ] RCA百张古典名盘之075：最精彩的巴托克 [ ] RCA百张古典名盘之076：斯特拉文斯基“彼得鲁什卡、春之祭、烟火” [ ] RCA百张古典名盘之077：普罗科菲耶夫“彼得与狼”圣-桑“动物狂欢节” [ ] RCA百张古典名盘之078：格什文“一个美国人在巴黎、蓝色狂想曲” [ ] RCA百张古典名盘之079：吉他狂人山下和仁“吉他名曲集” [ ] RCA百张古典名盘之080：莱罗伊·安德森“最脍炙人口的亲子音乐” [ ] RCA百张古典名盘之081：梅西昂“图伦加利拉交响曲” [ ] RCA百张古典名盘之082：肖斯塔科维奇“第五交响曲爵士组曲” [ ] RCA百张古典名盘之083：日本现代派作曲家武满彻代表名作 [ ] RCA百张古典名盘之084：世界第一长笛詹姆斯·高尔威的天籁笛音 [ ] RCA百张古典名盘之085：小提琴帝王海菲茨展技作品集 [ ] RCA百张古典名盘之086：海菲茨绝技安可曲(返场曲)27首 [ ] RCA百张古典名盘之087：19首无比优美的大提琴浪漫曲 [ ] RCA百张古典名盘之088：永远的钢琴名曲集 [ ] RCA百张古典名盘之089：斯托尔兹曼经典录音发烧名盘 [ ] RCA百张古典名盘之090：世界第一竖笛米凯拉·派翠的竖笛天籁 [ ] RCA百张古典名盘之091：穆索尔斯基“展览会上的图画”斯特拉文斯基“火鸟” [ ] RCA百张古典名盘之092：布里姆与威廉姆斯世纪吉他二重奏 [ ] RCA百张古典名盘之093：14首脍炙人口的管弦乐名曲 [ ] RCA百张古典名盘之094：17首史上最著名的古典进行曲 [ ] RCA百张古典名盘之095：假面舞会小丑意大利随想曲西班牙随想曲 [ ] RCA百张古典名盘之096：最精彩的富田勋 [ ] RCA百张古典名盘之097：天使的歌声“15首无比优美的世界名曲” [ ] RCA百张古典名盘之098：史上最受欢迎的民谣合唱 [ ] RCA百张古典名盘之099：史上最著名的歌剧咏叹调 [ ] RCA百张古典名盘之100：玛丽安·安德森“无比优美纯净的歌声” 肖邦的世界 - 200周年纪念精选Chopin 200 ! - The Anniversary Collection 罗大佑蔡依林莫文蔚以前只是听过她的《广岛之恋》，没有太多感觉，最近给我推荐了一首《如果没有你》，翻开同名专辑，里面的歌都很喜欢。她唱的大多是苦情歌。没有青春年少的甜甜蜜蜜，多了现在的无奈。 如果没有你起风了20180405 原唱高桥优。买辣椒也用券（这名字是什么鬼）翻唱。填词不错。 这一路上走走停停 顺着少年漂流的痕迹 迈出车站的前一刻 竟有些犹豫 不禁笑这近乡情怯 仍无可避免 而长野的天 依旧那么暖 吹起了从前 从前初识这世间 万般流连 看着天边似在眼前 也甘愿赴汤蹈火去走它一遍 如今走过这世间 万般流连 翻过岁月不同侧脸 措不及防闯入你的笑颜 我曾难自拔于世界之大 也沉溺于其中梦话 不得真假 不做挣扎 不惧笑话 我曾将青春翻涌成她 也曾指尖弹出盛夏 心之所动 且就随缘去吧 逆着光行走 任风吹雨打 短短的路走走停停 也有了几分的距离 不知抚摸的是故事 还是段心情 也许期待的不过是 与时间为敌 再次看到你 微凉晨光里 笑的很甜蜜 从前初识这世间 万般流连 看着天边似在眼前 也甘愿赴汤蹈火去走它一遍 如今走过这世间 万般流连 翻过岁月不同侧脸 措不及防闯入你的笑颜 我曾难自拔于世界之大 也沉溺于其中梦话 不得真假 不做挣扎 不惧笑话 我曾将青春翻涌成她 也曾指尖弹出盛夏 心之所动 且就随缘去吧 晚风吹起你鬓间的白发 抚平回忆留下的疤 你的眼中 明暗交杂 一笑生花 暮色遮住你蹒跚的步伐 走进床头藏起的画 画中的你 低着头说话 我仍感叹于世界之大 也沉醉于儿时情话 不剩真假 不做挣扎 无谓笑话 我终将青春还给了她 连同指尖弹出的盛夏 心之所动 就随风去了 以爱之名 你还愿意吗 黄金三镖客1966年电影同名专辑。好听，纯音乐，西部风。 Emotion： 优美的歌词和旋律20180417 非常喜欢这首歌的旋律，歌词也很优美，尝试翻译之。主副搭配的女声有些忧郁，听歌的人也随着心痛，无法控制。 Emotion By Destiny’s Child, 2001 It’s over and done 一切都结束了 But the heartache lives on inside 但心痛还在继续 And who’s the one you’re clinging to 今晚你将依偎在谁的身旁 Instead of me tonight? 反正也不会是我 And where are you now, now that I need you? 你现在在哪，可知我很需要你 Tears on my pillow wherever you go 不管你走到哪里，我的枕头沾满泪水 Cry me a river that leads to your ocean 好想把自己哭成一条泪河，流向你的海洋 You never see me fall apart 你永远不会看到我如此崩溃 In the words of a broken heart 一颗破碎的心 It’s just emotion taken me over 任由情绪将我控制 Caught up in sorrow, lost in my soul 淹没在悲伤之中，迷失了我的灵魂 But if you don’t come back 但是亲爱的，如果你不回来 Come home to me, darling 不回到我的身边 Don’t you know there’s nobody left in this world 难道你不知道这世上没人 To hold me tight 会将我紧紧相拥 Don’t cha know there’s nobody left in this world kiss goodnightGoodnight, goodnight, goodnight 难道你不知道这世上没人会亲吻着我互道晚安 I’m there at your side 我就在你身边 I’m part of all the things you are 我就是你的一部分 And you’ve got a part of someone else 但是你却已经是别人的一部分 You’ve gotta go find your shining star 你已经去找寻属于你的那颗明星 And where are you now, now that I need you? 你现在在哪，可知我很需要你 Tears on my pillow wherever you go 不管你走到哪里，我的泪水浸湿枕头 Cry me a river that leads to your ocean 哭成一条泪河，流向你所在的海洋 You never see me fall apart 你不会看到我如此崩溃 In the words of a broken heart 一颗破碎的心 It’s just emotion taken me over 任由情绪将我控制 Caught up in sorrow, lost in my soul 淹没在悲伤之中，迷失了我的灵魂 But if you don’t come back 但是亲爱的，如果你不回来 Come home to me, darling 不回到我的身边 Don’t you know there’s nobody left in this world 难道你不知道这世上没人 To hold me tight 会将我紧紧相拥 Don’t cha know there’s nobody left in this world kiss goodnightGoodnight, goodnight, goodnight 难道你不知道这世上没人会亲吻着我互道晚安 And where are you now, now that I need you? 你现在在哪，可知我很需要你 Tears on my pillow wherever you go 不管你走到哪里，我的泪水浸湿枕头 Cry me a river that leads to your ocean 哭成一条泪河，流向你所在的海洋 You never see me fall apart 你不会看到我如此崩溃 In the words of a broken heart 一颗破碎的心 It’s just emotion taken me over 任由情绪将我控制 Caught up in sorrow, lost in my soul 淹没在悲伤之中，迷失了我的灵魂 But if you don’t come back 但是亲爱的，如果你不回来 Come home to me, darling 不回到我的身边 Don’t you know there’s nobody left in this world 难道你不知道这世上没人 To hold me tight 会将我紧紧相拥 Don’t cha know there’s nobody left in this world kiss goodnightGoodnight, goodnight, goodnight 难道你不知道这世上没人会亲吻着我互道晚安 李泉走钢索的人20180522 浪漫的诗人般的音乐家，优雅，“高级”，一股海派的味道。从《歌手2018》上认识他，在节目上的表演惊为天人，在豆瓣上看他评分最高的一张专辑《走钢索的人》评价人数不过3600+，这么冷门的歌手。然而我很喜欢！找来《走钢索的人》整张专辑，简直是享受！唱腔优雅，编曲大多融合钢琴，舒服。不过好像每首的风格变化不大，听多了容易腻，确实不是大众所喜欢的流行乐的风格。 可能，只适合你一个人凌晨戴着耳机，在被窝里听，感受和自己一样的孤独。 GALA 追梦赤子心","link":"/2019/06/06/2018-04-01-music/"},{"title":"ArcGIS中经纬度整数显示","text":"ArcGIS画地图时，需要标注经纬度坐标。在layout view模式中，右键点击需要添加经纬度的dataframe，Grids，New Grids，选择想要的经纬度样式，一般默认的是显示度、分、秒，即\\(40^\\circ 0’ 0’’N\\)，显然，\\(0\\)是不需要显示的。 将经纬度按整数显示： 右键dataframe, Grids, properties, Labels, additional properties，然后取消勾选show zero minutes和show zero seconds。","link":"/2019/02/20/ArcGIS中经纬度整数显示/"},{"title":"Buckethead下载","text":"以下仅用于试听试看，请支持正版，捍卫版权！ 百度贴吧里有个帖子上传了很多Pike系列的百度云链接，大部分可用。链接 帖子中大部分均已保存到自己的百度云网盘中。 另外，CD音乐包网站也有帖子中有分享，为此，特注册账户（QQ邮箱）（需支付宝付15块获得邀请码）。","link":"/2019/10/17/buckethead/"},{"title":"2020国考公务员重要时间节点","text":"中央机关及其直属机构2020年度考试录用公务员专题 公告链接与报考程序 报名链接 重要时间节点： 10月24日18:00前提交网上报考申请。 2019年10月28日8:00后登录考录专题网站查询报名序号。报名序号是报考者报名确认和下载打印准考证等事项的重要依据和关键字，请务必牢记。 通过资格审查的报考者，请于2019年10月31日0:00至11月6日 24:00登录考录专题网站进行网上报名确认并缴费，逾期视为自动放弃报考资格。 2019年11月18日0:00至11月24日12:00期间，登录考录专题网站打印准考证。 公共科目笔试时间为2019年11月24日： 11月24日上午 9:00－11:00 行政职业能力测验 11月24日下午 14:00－17:00 申论 2020年1月登录考录专题网站查询笔试成绩和最低合格分数线。","link":"/2019/10/23/2020国考公务员重要时间节点/"},{"title":"美国电网分区 NERC Regions","text":"NERC：North American Electric Reliability Corporation 共有八个大区，若干小区，如图： 分区数据下载(ArcGIS shapefile)： ArcGIS官网下载链接 （需要注册登录） 利用上述链接中的APIs，打开ArcGIS软件并添加GIS server，复制粘贴APIs中的GeoService网址，即可（不需登录），在ArcGIS软件中的Catalog中找到相应server和NERC，拖到ArcGIS图层即可。","link":"/2019/05/29/NERC-regions/"},{"title":"NLDAS气象数据下载","text":"NLDAS2美国气象同化数据 https://disc.gsfc.nasa.gov/datasets/NLDAS_NOAH0125_H_V002/summary?keywords=NLDAS 时间：19790101-present， 空间分辨率：\\(0.125\\ ^\\circ \\) 下载之前先确保已授权。 simple subst wizard方式下载数据查询、选择地址：这一步完成后会生成多个链接，每个链接只是一个时间点的数据，比如要下载1982年1月1日的hourly数据，则有24个文件。其实只需要其中一个链接即可，其他链接可以通过修改时间信息自动生成。 下载方法 和 参考链接（重要） username: mengfeimu password: XXX wget 下载Linux或者macOS均可以运行。需要先执行以下3步，参考链接： 查看是否授权Earthdata 设置用户名和密码： 1234cd ~ # 可以选择任意的目标文件夹touch .netrcecho \"machine urs.earthdata.nasa.gov login uid_goes_here password password_goes_here\" &gt; .netrcchmod 0600 .netrc 同一文件夹下，创建cookies文件： 1touch .urs_cookies 单个文件下载： 1wget --load-cookies ./.urs_cookies --save-cookies ./.urs_cookies --auth-no-challenge=on --keep-session-cookies --content-disposition http://hydro1.gesdisc.eosdis.nasa.gov/daac-bin/OTF/HTTP_services.cgi\\?FILENAME\\=%2Fdata%2FNLDAS%2FNLDAS_FORA0125_H.002%2F1982%2F001%2FNLDAS_FORA0125_H.A19820101.0100.002.grb\\&amp;FORMAT\\=bmV0Q0RGLw\\&amp;BBOX\\=38.204%2C-89.855%2C38.206%2C-89.853\\&amp;LABEL\\=NLDAS_FORA0125_H.A19820101.0100.002.2019072152945.pss.nc\\&amp;SHORTNAME\\=NLDAS_FORA0125_H\\&amp;SERVICE\\=SUBSET_GRIB\\&amp;VERSION\\=1.02\\&amp;LAYERS\\=Eg\\&amp;DATASET_VERSION\\=002 批量下载，需要把所有网址都存储在urls.txt中，然后执行以下命令： 1wget --load-cookies ./.urs_cookies --save-cookies ./.urs_cookies --auth-no-challenge=on --keep-session-cookies --content-disposition -i urls.txt 可以在命令后加上&amp;放在后台运行，但由于每个文件都要和http通讯，很费时间，平均下载一天的数据文件（24个文件）需要下载40s，当然，可以考虑并行下载，会快点。 wget并行下载： 将以下内容存储为文件download_NLDAS.sh: 12345678#!/bin/bashinfile=\"$1\" # 这里的1是指执行该文件时添加的第一个参数while IFS='' read -r url || [[ -n \"$url\" ]]; do wget --load-cookies ./.urs_cookies --save-cookies ./.urs_cookies --auth-no-challenge=on --keep-session-cookies --content-disposition $url &amp;&gt;/dev/null &amp; done &lt; \"$1\"wait # &amp;&gt;/dev/nul 命令将滚动的输出隐去，设置为silient模式# &amp;：并行运算，将所有命令并行放在后台运行 将所有需要下载的文件网址写入文件urls.txt，这里可以借用python， 执行命令并下载： 1sh ./download_NLDAS.sh urls.txt 如果需要统计运行时间，可在命令前加上time: 1time sh ./download_NLDAS.sh urls.txt 也可参考EarthData官网给出的wget下载文件.sh。 直接执行download_NLDAS.sh下载的缺点是当文件数太多（上百上千），往往会报错： Fork: Resource temporatily unavailable 因此，需要另外写个main.sh来调用download_NLDAS.sh，解决这种问题。由于是下载hourly的数据，因此每次调用download_NLDAS.sh来下载24个文件即一天的数据，如此循环： 1234567891011121314151617181920212223#!/bin/bash# main.shcd ~/Downloads/nldasn=`cat urls.txt|wc -l`# echo $nfor ((i=1; i&lt;=$(($n/24)); i++));do#for i in &#123;1..$(($n/24))&#125;;do line1=$(($(($i*24))-23)) line2=$(($i*24)) # echo $line1 # echo $line2 echo \"$i of $(($n/24)) ...\" sed -n \"$&#123;line1&#125;,$&#123;line2&#125;p\" ./urls.txt &gt; ./urls.temp.txt sh ./download_NLDAS.sh ./urls.temp.txtdoneif [ ! -d \"./netcdfs\" ]; then mkdir ./netcdfsfimv ./*.nc ./netcdfs/rm ./urls.temp.txt 运行main.sh所需要的文件有，缺一不可： main.sh Download_NLDAS.sh .netrc .urs_cookies python下载需要使用pydap，参考GES DISC 官方指导： 安装pydap: 1conda install -c conda-forge pydap 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677# C:\\mengfeimu\\Data\\2019_IECM\\code\\download_NLDAS.py# jupyter notebook粘贴这些代码并不能运行（因为有并行的部分），需要存储为.py文件，然后在jupyter中运行 # %run ./download_NLDAS.py# 并行下载import pandas as pdimport numpy as npimport datetimefrom multiprocessing import Pool, cpu_countt1 = datetime.datetime.now()def password_NLDAS(): from pydap.cas.urs import setup_session username = 'mengfeimu' password = 'MMf1216069944' session = setup_session(username, password, ) # check_url=url return sessionsession = password_NLDAS()def download_NLDAS2(param): url = param[0] y = param[1] m = param[2] d = param[3] h = param[4] r = session.request('Get',url) outfile = '&#123;outdir&#125;/&#123;year&#125;&#123;month&#125;&#123;day&#125;&#123;hour&#125;.nc'.format(outdir = outdir, \\ year = y, month = str(m).zfill(2), day = str(d).zfill(2), hour = str(h).zfill(2)) with open(outfile, \"wb\") as code: code.write(r.content)# latitude and longitude of the power plant # currently, just need to change lat and lon for another power plant# change dates if study period is changedlat = 38.205lon = -89.854lats = [lat-0.001, lat+0.001]lons = [lon-0.001, lon + 0.001]outdir = '../../2019_IECM/NLDAS2/55856_1982_2012'dates = pd.date_range('19820101000000','20121231230000',freq='H')# this url is obtained from NLDAS2 Simple Subst Wizard# https://disc.gsfc.nasa.gov/datasets/NLDAS_FORA0125_H_V002/summary?keywords=NLDASurl_1 = \"http://hydro1.gesdisc.eosdis.nasa.gov/daac-bin/OTF/HTTP_services.cgi?FILENAME=%2Fdata%2FNLDAS%2FNLDAS_FORA0125_H.002%2F&#123;year&#125;%2F&#123;doy&#125;%2FNLDAS_FORA0125_H.A&#123;year&#125;&#123;month&#125;&#123;day&#125;.&#123;hour&#125;00.002.grb&amp;FORMAT=bmV0Q0RGLw&amp;BBOX=&#123;lat1&#125;%2C&#123;lon1&#125;%2C&#123;lat2&#125;%2C&#123;lon2&#125;&amp;LABEL=NLDAS_FORA0125_H.A&#123;year&#125;&#123;month&#125;&#123;day&#125;.&#123;hour&#125;00.002.2019072152945.pss.nc&amp;SHORTNAME=NLDAS_FORA0125_H&amp;SERVICE=SUBSET_GRIB&amp;VERSION=1.02&amp;LAYERS=Eg&amp;DATASET_VERSION=002\"urls = []params = []for date in dates: y = date.year m = date.month d = date.day h = date.hour doy = date.strftime('%j') url = url_1.format(year = y, doy=str(doy).zfill(3),month = str(m).zfill(2), \\ day = str(d).zfill(2), hour = str(h).zfill(2),\\ lat1 = lats[0], lat2 = lats[1], lon1 = lons[0], lon2 = lons[1]) urls.append(url) params.append([url,y,m,d,h])# 输出urls到urls.txt:# df_url = pd.DataFrame(data=&#123;'url':urls&#125;,index=dates)# df_url.url.to_csv(path = '../../2019_IECM/NLDAS2/55856_1982_2012/urls.txt',\\ index = False)if __name__ == '__main__': __spec__ = \"ModuleSpec(name='builtins', loader=&lt;class '_frozen_importlib.BuiltinImporter'&gt;)\" cores = cpu_count() # leave one core idle cpu_count()-1 p = Pool(processes = cores, maxtasksperchild = 4) p.map(download_NLDAS2, params) t2 = datetime.datetime.now() print(\"time:\",format(t2-t1)) Earthdata Search方式下载这种方式好像只能下载整个美国的数据，不能单独下载区域数据。全美数据量太大了，不推荐这种方式下载。 准备工作： 执行链接中的前3步： 查看是否授权Earthdata 设置用户名和密码： 1234cd ~ # 可以选择任意的目标文件夹touch .netrcecho \"machine urs.earthdata.nasa.gov login uid_goes_here password password_goes_here\" .netrcchmod 0600 .netrc 同一文件夹下，创建cookies文件： 1touch .urs_cookies 单个文件下载： 1curl -O -b ./.urs_cookies -c ./.urs_cookies -L -n https://hydro1.gesdisc.eosdis.nasa.gov/data/NLDAS/NLDAS_FORA0125_H.002/2011/003/NLDAS_FORA0125_H.A20110103.2300.002.grb 若能下载成功，说明前面的3步设置正确。 批量下载： 123456789101112#!/bin/shfetch_urls() &#123; while read -r line; do curl -b ~/.urs_cookies -c ~/.urs_cookies -L -n -f -Og $line &amp;&amp; echo || exit_with_error \"Command failed with error. Please retrieve the data manually.\" done;&#125;fetch_urls &lt;&lt;'EDSCEOF'# Insert URLS here# url1# url2# url...EDSCEOF","link":"/2019/03/11/NLDAS/"},{"title":"Anaconda Rollback and Revert","text":"有时装了某个package后想删除，但没法同时删除安装时附带的其他package，因此需要回滚到某个状态，好在anaconda在每次增删packages时会自动记录版本，查看所有历史版本： 1conda list --revision 找到想回滚的某个版本号，如想回滚到第6次更改，则执行： 1conda install --revision 6","link":"/2019/04/11/anaconda-rollback/"},{"title":"韩文Hwp打开软件","text":"官方在线免费打开方式（可编辑）： https://space.malangmalang.com/drive","link":"/2019/05/26/hwp打开软件/"},{"title":"Cygwin工具入门","text":"cygwin工具在windows系统中提供完整的Unix环境，方便使用shell等工具。 下载和安装：https://cygwin.com/，仅仅安装了最基础的packages，vim等没有安装。 安装需要的package重新运行cygwin的安装文件，选择相应的package。","link":"/2019/05/30/cygwin/"},{"title":"ArcGIS安装和设置","text":"ArcGIS高版本中保存的.mxd项目文件无法在低版本中打开，ArcGIS 10.5.1保存，安装10.2后报错无法打开，无奈只好重装10.5，结果安装破解后无法启动license。查找原因，原来是ArcGIS 10.2未卸载干净，按照网上方法清理所有ArcGIS和ESRI文件夹和注册表中包含ESRI和ArcGIS的信息（打开regedit.exe）。 下载安装下载10.6版本（保存在硬盘和百度云中ArcGIS_Desktop_106_161544-DanCrack.iso）并重新安装： 安装License Manager，并停止license服务，但不关闭窗口，稍后还得重新启动； 安装ArcGIS Desktop 10.6，点击Finish之后自动打开ArcGIS Administrator Wizard，保持打开状态不动； 破解（各个版本的ArcGIS破解方法基本不变）：将crack文件解压，将得到两个文件夹，将其中的ARCGIS.exe和service.txt复制并覆盖到安装路径C:\\Program Files (x86)\\ArcGIS\\License10.6\\bin，将AfCore.dll复制并覆盖到路径C:\\Program Files (x86)\\ArcGIS\\Desktop10.6\\bin中； 重新启动license服务，reload licenses; 在ArcGIS Administrator Wizard中更改第二个选项Define a license manager now为localhost，确定； 安装完毕，打开ArcMap 10.6确认。 保存相对路径换一台电脑重新打开项目文件.mxd时，出现红色感叹号，原因是相关数据文件的路径不对，需要一一点击设置新的文件路径。为避免以后麻烦，在安装完成ArcGIS后即设置成保存相对路径： File -&gt; Map Document Properties -&gt; pathnames: store relative pathnames to data sources","link":"/2019/04/10/arcgis安装和设置/"},{"title":"Cue文件乱码","text":"有时在网上下载的无损格式音乐比如WAV等往往有一个cue文件，记录着分轨信息等，如果乱码，那么用XLD软件转换格式时往往不能分离各个歌曲。 这种乱码可以通过sublime软件解决：讲cue文件拖到sublime软件中，将会自动弹出编码格式选择，选择能正常显示文件内容的编码格式即可，如GBK等。 然后复制所有内容，新建一个cue文件并覆盖原cue文件。完成后重新用XLD软件打开即可。","link":"/2019/08/25/cue文件乱码/"},{"title":"hexo结合Github创建博客","text":"安装hexo按照hexo官网的流程进行安装: macOS下，需要安装Xcode Command Line Tools, 但去App Store搜索，发现有5G大，太大了平时也用不着，遂只安装需要泳道的CLTs，在终端下执行： 1xcode-select install 几分钟便可。还需要安装Git和Node.js create a project1hexo init folder_name generate and push to server12hexo generate (hexo g)hexo deploy (hexo d) # send it to server 在执行此命令之前，可以用hexo clean来删除public文件夹下的内容，重新生成。为方便把新增加的内容push到网站上去，在～/.bash_profile中假如alias hexopush=&quot;hexo clean;hexo g;hexo d&quot;，然后重新加载source ~/.bash_profile，以后直接输入hexopush就可以了。 install the missing depedency1npm install hexo-renderer-sass install a new themehexo的所有主题当中，选中了minos，既简洁，又有搜索功能，很实用。 1git clone https://github.com/ppoffice/hexo-theme-minos.git themes/minos change theme in _config.yml to the new name 增加目录在在article.ejs 中的&lt;%- post.content %&gt;一行之前添加：1234&lt;div id=\"toc\" class=\"toc-article\"&gt; &lt;div class=\"toc-title\"&gt;目录&lt;/div&gt; &lt;%- toc(item.content, &#123;list_number: false&#125;) %&gt;&lt;/div&gt; 改变目录样式在themes/minos/sources/css/style.scss中增加； 12345678.toc &#123; float: right; margin-left: 40px; padding: 10px 20px; background: #f1f1f1; border-radius: 10px; box-shadow: 0 0 3px #bbb;&#125; 没有默认的显示效果好，先删除。 更改主页在article.ejs中，注释掉&lt;%- post.content %&gt;之前的相关内容，更改之前： 1234567891011121314151617&lt;% if (post.excerpt &amp;&amp; index)&#123; %&gt; &lt;%- post.excerpt %&gt; &lt;p class=\"article-more-link\"&gt; &lt;a href=\"&lt;%- url_for(post.path) %&gt;#more\"&gt;&lt;%= __('article.read_more') %&gt;&lt;/a&gt; &lt;/p&gt; &lt;% &#125; else &#123; %&gt; add table of content &lt;% if(post.toc != false)&#123; %&gt; &lt;div id=\"toc\" class=\"toc-article\"&gt; &lt;strong class=\"toc-title\"&gt;&lt;/strong&gt; &lt;%- toc(post.content, &#123;list_number: false&#125;) %&gt; &lt;/div&gt; &lt;% &#125; %&gt; &lt;%- post.content %&gt; &lt;% &#125; %&gt; 更改之后 1234567891011121314151617&lt;% if (index)&#123; %&gt; &lt;!-- &lt;%- post.excerpt %&gt; --&gt; &lt;!-- &lt;p class=\"article-more-link\"&gt; &lt;a href=\"&lt;%- url_for(post.path) %&gt;#more\"&gt;&lt;%= __('article.read_more') %&gt;&lt;/a&gt; &lt;/p&gt; --&gt; &lt;% &#125; else &#123; %&gt; &lt;!-- add table of content --&gt; &lt;% if(post.toc != false)&#123; %&gt; &lt;div id=\"toc\" class=\"toc-article\"&gt; &lt;strong class=\"toc-title\"&gt;&lt;/strong&gt; &lt;%- toc(post.content, &#123;list_number: false&#125;) %&gt; &lt;/div&gt; &lt;% &#125; %&gt; &lt;%- post.content %&gt; &lt;% &#125; %&gt; 新建一个文件有两种方式，一种是直接去项目文件下的source/_posts下直接新建md文件并进行编辑。另一种是在项目文件夹下执行：1hexo new name 便会在source/_posts下新建一个md文件并且按照模版写好了。 在文章中添加图片将图片name.png存储在source/pics中，然后，在.md文件中的适当位置添加图片: 1![give any name here](/pics/name.png) 转移hexo目录只需要把hexo_blogs目录整体移动到新目录即可，不用重新配置hexo或github（同一台电脑）。换个电脑是不是需要重新设置，暂时没有测试。","link":"/2018/10/10/hexo-github-blog/"},{"title":"批量删除微博记录","text":"在电脑端登录新浪微博，并点击右上角的用户名进入个人主页。 鼠标右键，检查（Ctrl+Shift+I），点击Console，复制以下代码并粘贴，回车，即可逐步删除所有微博。 （如果浏览器装有屏蔽广告的插件，需要暂时关闭或者把新浪微博放进白名单里）。 以下代码亲测在Chrome浏览器中运行无误。 123456789101112131415161718192021var s = document.createElement('script');s.setAttribute( 'src', 'https://lib.sinaapp.com/js/jquery/2.0.3/jquery-2.0.3.min.js');s.onload = function() &#123; setInterval(function() &#123; if (!$('a[action-type=\"feed_list_delete\"]')) &#123; $('a.next').click(); &#125; else &#123; $('a[action-type=\"feed_list_delete\"]')[0].click(); $('a[action-type=\"ok\"]')[0].click(); &#125; // scroll bottom let auto load $('html, body').animate(&#123; scrollTop: $(document).height() &#125;, 'slow'); var len = $('div[action-type=\"feed_list_item\"]').length; if (len &lt; 5) &#123; $('a[class=\"page next S_txt1 S_line1\"]')[0].click(); &#125; &#125;, 800);&#125;;document.head.appendChild(s);","link":"/2019/11/06/delete_weibo/"},{"title":"用Gitignore文件来忽略不用同步的文件","text":"使用.gitignore文件来忽略某些不想或没必要每次都要同步的文件，比如一些缓存文件，如pyhspf中的__pycache文件夹中的所有内容。 在git项目下新建一个文件.gitignore，然后在文件中输入想要忽略的文件名或者路径名，如： 12345./__pycache__./calibration/__pycache__./core/__pycache__./forecasting/__pycache__./preprocessing/__pycache__ 这样，所有的__pycache__文件夹下的所有文件都不会push到远程的git项目中。可以用更简单的方式忽略项目里所有__pycache文件夹，参考链接 1**/__pycache__ 忽略已经push到远程的文件同样，建立.gitignore文件并加入想要忽略的文件名或路径名，然后执行： 1git rm --cached **/__pycache__ 所有__pycache文件夹都已经从git的索引中删除（本地的文件还在，远程的目前也还在）。 然后执行： 12git commit -m \"add a name\"git push #(此时，本地的文件也都还在，远程的已被删除)","link":"/2019/04/23/gitignore/"},{"title":"Anaconda prompt窗口直接运行.py文件","text":"打开anaconda prompt 进入相应的环境，conda activate env-name，并切换到目标文件所在的目录cd dir_name 执行.py文件：python test.py","link":"/2019/04/11/anaconda执行python脚本/"},{"title":"macOS Terminal终端常用命令","text":"查看文件夹或者文件大小1du -sh fname -s 表示单个（single）文件夹或者文件的总大小，如果不指定该参数，则会遍历文件夹下的所有文件大小 -h human readble output，会以M、G等为单位输出 某个命令的文档1man du 在终端直接打开文件在某文件夹执行ls命令后，按住command同时点击文件名，即可用相应程序打开文件（仅支持当前目录下）。","link":"/2018/10/10/macOS终端常用命令/"},{"title":"macOS登录FTP","text":"打开Finder，&gt;Go&gt;Connect to Server （或者直接快捷键command+K），输入ftp://xxxxx，输入用户名和密码即可。 下载和安装：https://cygwin.com/，仅仅安装了最基础的packages，vim等没有安装。 安装需要的package重新运行cygwin的安装文件，选择相应的package。","link":"/2019/05/30/macOS登录FTP/"},{"title":"Kindle","text":"通过邮箱发送到kindle上绑定到kindle上的邮箱可以直接发送到该接收邮箱，接收邮箱的地址在这里查看： kindle -&gt; 全部设置 -&gt;您的账户 -&gt; （最后一行）xxxx#kindle.cn。 如果要用其他邮箱发送到该接收邮箱，则需要添加： 网页版amazon.cn -&gt; 管理我的内容和设备 -&gt; 个人文档设置 -&gt; 已认可的发件人电子邮箱列表 -&gt; 添加认可的电子邮箱 Kindle个人文档服务目前只能转换并发送以下类型的文档：Microsoft Word (.doc, .docx)RTF文件(.rtf)HTML(.htm, .html)TXT文件(.txt)Zip, x-zip压缩文件Mobi格式电子书 JPEG (.jpg), GIF (.gif), Bitmap (.bmp) 和 PNG (.png) 格式的图片。Adobe PDF (.pdf)文档可维持原文件格式，发送至您的Kindle。 Adobe PDF (.pdf)文档可转换为Kindle格式发送，目前处于试用阶段。 AZW和AZW3格式无法用此方法发送。 Windows电脑上同步通过USB把kindle连接到电脑，把下载的mobi文件复制粘贴到如下路径： kindle/documents/downloads 支持的书籍格式kindle支持mobi、azw 或 azw3格式，不支持epub格式（ibooks支持）。最好不要在kindle上读PDF，一般效果不太好。","link":"/2019/03/11/kindle/"},{"title":"Itunes-Artworks","text":"专辑图片、电影封面等搜索下载 https://bendodson.com/projects/itunes-artwork-finder/","link":"/2018/12/25/itunes-artworks/"},{"title":"macOS种子下载软件","text":"Folx： 一款类似于迅雷的种子和磁力链接下载工具，免费使用，但高级功能需要付费的软件。免费使用也未发现有限速。速度有3M左右。高级功能有下载YouTube视频，多线程下载，种子搜索等，如有需要可以购买，一般使用的话免费版本即可，20$。","link":"/2018/10/11/macOS种子下载工具/"},{"title":"macOS软件","text":"Alfred免费搜索工具，购买powerpack后有更高级的功能，如剪贴板记录、workflow等。 magnet移动窗口自动排列。 iThoughtsX画思维导图软件。 Sublime Text 3详情请见：https://mengfeimu.github.io/2018/10/09/tool/2018-07-27-sublime/ Typora免费Markdown编辑器，可输出各种格式，如pdf、word等。 iTerm终端工具，代替自带的终端。 Oh my zsh更好用的终端配置，如增强版的自动补全功能。 TeamViewer屏幕共享与远程登录软件。免费。 Zotero文献管理软件。 iCHM免费的chm文件阅读器。 Paragon NTFS for mac一般NTFS格式的移动硬盘在macOS下只可读不可写。这款软件可以让希捷移动硬盘在macOS下可写。 Github DesktopLightroom Classic CC照片调色与修图软件。 XLD音乐文件格式转换工具。无损转换为iTunes AAC格式（后缀名.m4a），转换完成后自动添加到iTunes。 输出格式选择：MPEG-4 AAC. 勾选：Add encoded files to iTunes if possible, Library IINA视频播放软件。 Downie视频下载软件，复制粘贴或拖拽链接到软件即可，也可用软件内置的搜索功能直接搜索。试用下载YouTube视频很快。 Permute格式转换工具，包括视频，音频，图片，甚至PDF文件。","link":"/2019/01/02/macOS软件/"},{"title":"Move Free维骨力","text":"不同颜色的产品区别：（以下是 Walgreens产品链接，经常有买1送1活动） 红盒装 （80粒），巩固预防型：保护关节健康，让关节感到舒适、润滑并且保护关节；Uniflex协助保护关节与软骨组织；透明质酸能被关节吸收为缓冲关节。起到缓解保护关节疼痛的功效。 蓝盒装（80粒）：在红瓶基础上增加了维生素D3和MSM，D3能促进保持骨骼钙的吸收，使关节软骨更健康。 绿盒装（120粒）：在红瓶的基础上添加了1500mgMSM，支持关节止疼更有效。 磷虾油维骨力(30粒)：添加了磷虾油、透明质酸、虾青素和抗氧化的Omega-3，每天只需一粒。专有的混合配方保护关节健康，100％磷虾油中磷脂可以保护组织免受有害自由基侵害。 骨胶原维骨力（30粒）：含软骨素、UC-II骨胶原以及透明质酸，适用于关节保健、皮肤粗糙、指甲开裂、心血管壁脆弱的人群。","link":"/2018/01/01/move-free/"},{"title":"macOS照片批量更改时间","text":"在macOS自带的照片应用中， 若要更改一张照片的时间（日期，时区等）： 选中照片 —&gt;右键选择属性（或者右上角的感叹号）—&gt;双击属性中的时间即可更改。 但若想要同时更改多张照片的日期到同一个时间，以上方法不行，双击后无反应，解决办法： 选中多个照片—&gt;菜单栏选择image—&gt;adjust date and time—&gt;更改时间即可。","link":"/2019/02/13/macOS照片批量更改时间/"},{"title":"macOS软件突然打不开了","text":"macOS系统下安装的破解软件如Downie，permute等以前可以正常使用的软件（下载于Xclient.info），突然无法打开了。登陆Xclient发现有公告”关于近期部分“TNT”和谐版软件打不开的问题，请参考《修复TNT和谐软件闪退问题》，或等待新的版本”。具体内容如下，照做即可解决。 因为Apple苹果公司删除了TNT的证书，所以在2019年7月12日后软件都不能运行了，临时的解决办法，就是自己签名，具体往下看。 准备工作 安装xcode安装xCode，你可以在App Store中下载安装，并且至少运行一次。 安装Command Line Tools 工具打开终端工具输入如下命令： 1xcode-select --install 弹出后选择继续安装。 签名打开终端工具输入并执行如下命令：1codesign --force --deep --sign - /Applications/name.app 注意后面的文件路径，你可以打开访达找到应用程序，找到要签名的软件，直接拖入 终端 界面，即可自动生成路径。 文章中分享下载的所有dmg、zip 打开密码均为 xclient.info","link":"/2019/08/16/macOS软件打不开/"},{"title":"Office无法激活","text":"macOS版本的Office 365，明明已经登录账号且已经购买Office 365，但却提示需要激活，否则无法编辑word文档只能浏览。关闭word，重启，没用。重启电脑，没用。 解决办法如下： 下载 license移除工具 安装 重新打开word，并登陆账户。 完成。 参考链接","link":"/2019/06/17/office无法激活/"},{"title":"macOS连接windows服务器目录","text":"macOS connect to network windows folder 在Windows上，只需打开文件管理器，输入文件夹地址如：\\\\swsatlas\\CentersGIS\\CWS\\WaterSupply然后回车即可。 在macOS上：打开Finder -&gt; Go -&gt; Connect to Server -&gt; smb://swsatlas，然后按提示输入用户名密码，操作即可。 macOS连接自己的windows电脑实现文件共享按照上面的思路，将自己的windows电脑设置成一个服务器，然后共享相关文件夹，即可实现在macOS上向windows读取/写入文件。 主要参考链接 Windows与MacOS怎么通过smb协议共享文件夹目录 首先需要在windows账户中新建一个账户用于共享，取名office_pc_share，密码存储于macOS中。 为方便，我把办公室台式机的下载文件夹设置成了共享（在资源管理器中“共享”一栏中设置），这样以后就不用每次都用移动硬盘转移文件了，速度还是很快的，直接打开文件，几乎没有延迟，就像在macOS本地加载了一块硬盘差不多。 进一步，将整个OneDrive目录共享给该用户名，办公室内网环境下就不需要在macOS上登录onedrive软件了（macOS版本的onedrive经常内存溢出导致发热严重）。 C:\\OneDrive\\Github\\hexo_blogs文件夹也可以直接在macOS上远程打开，并实现hexopush，更新网页端内容。 如果无法连接，先查看windows端的防火墙是否关闭。","link":"/2019/03/25/macOS连接windows服务器目录/"},{"title":"Scihub可用链接","text":"有些数据库单位没有购买，无从下载，不得已从scihub上下载，但很多域名经常被封。以下是目前可用的域名（有可能需要用VPN）： https://sci-hub.se/ https://sci-hub.tw/","link":"/2019/06/07/scihub-links/"},{"title":"Pandas读取dbf文件","text":"pandas不能直接读取dbf文件，因此需要将其转化为csv或者用simpledbf包来读取并转化成pandas支持的dataframe格式。 转化为csv macOS (或Linux)系统下安装csvkit: 1brew install csvkit 转化： 1in2csv test.dbf &gt; test.csv （in2csv不会自动补全，不要怀疑没有安装成功csvkit） 用simpledbf读取 未完待续….","link":"/2019/04/11/pandas读取dbf文件/"},{"title":"MathType7安装和激活","text":"以下仅用于试用，请支持正版，捍卫版权！ Word软件中自带的公式编辑功能已经很强大，平时写论文报告都够用，但在VISIO中画流程图时，没有比较方便的方法，于是安装MathType。 该软件收费，需要用秘钥激活，否则只能用30天使用版本。 下载MathType 7到OneDrive\\apps\\MathType7.4.0.453下，有可移动版本，无需安装和激活，直接双击portable文件夹下的.exe即可开使用（如果不成功，请先断网然后重新打开）。 下载和安装：https://cygwin.com/，仅仅安装了最基础的packages，vim等没有安装。 安装需要的package重新运行cygwin的安装文件，选择相应的package。","link":"/2019/07/02/mathtype7/"},{"title":"径流观测数据","text":"美国USGSUSGS National Water Information System (NWIS)，公开数据。 径流站点信息查询NWIS中的Site Information和下面的Map of all sites with links to all available water data for individual sites. USGS所有径流站点保存在OneDrive\\mengfei\\Data\\water_energy\\Data_input\\NWIS中，可在ArcGIS打开查询。 批量下载1234567891011121314site_id = '05594100'year1 = 1982year2 = 2012url = 'https://waterdata.usgs.gov/nwis/dv?cb_00060=on&amp;format=rdb&amp;site_no=&#123;&#125;&amp;\\referred_module=sw&amp;period=&amp;begin_date=&#123;&#125;-01-01&amp;end_date=&#123;&#125;-12-31'.format(site_id,year1,year2)df_flow = pd.read_csv(url, skiprows=29, sep='\\t', usecols=(2,3), names = ['date','flow'], index_col=(0))df_flow.index = pd.DatetimeIndex(df_flow.index)# convert unit: f3/s --&gt; m3/sdf_flow.flow *= 0.0283168if len(df_flow.index) == len(pd.date_range('&#123;&#125;0101'.format(year1), '&#123;&#125;1231'.format(year2),freq='D')): print('Good! No missing flow data!')","link":"/2019/03/06/streamflow/"},{"title":"安装Ubuntu双系统","text":"本来以为macOS没有wget命令，课题组的服务器又没法登录，所以想装ubuntu下载NLDAS2数据（macOS的curl好像只能直接下载文件，没法完成此次任务），结果折腾了好久，也没有成功，以前windows电脑用优盘装双系统还是很简单的，现在这个联想笔记本用了EFI模式，不是以前的BIOS模式，ubuntu优盘启动盘做好之后，在系统启动界面根本不显示，折腾了整晚，也没有搞定。 今早发现，wget命令也可以在macOS上直接运行，也就作罢了，不折腾ubuntu了。 下载ubuntuhttps://www.ubuntu.com/download/desktop 无U盘安装方法下载EasyBCD免费版下载个人免费版，需要填写名字和邮箱，但好像不会验证，填完之后立马就下载了。 https://neosmart.net/Download/Register 关闭win 10的EFI模式如果打开EasyBCD提示windows开启了EFI模式，则需要按照以下方法关闭security和boot选项卡中的相关UEFI模式： https://www.appgeeker.com/recovery/disable-uefi-secure-boot-in-windows-10.html U盘安装方法现在的这台联想笔记本按照上述方式无法关闭EFI模式，只好用U盘安装。 Fn + F12进入boot manager选择U盘启动 Bios中没有USB HDD 选项，导致启动盘无法被识别","link":"/2019/03/14/ubuntu/"},{"title":"Time Machine备份macOS","text":"利用macOS自带的Time Machine（时间机器）备份整个电脑。步骤如下： 重新分区（擦除）并设置用于TM的分区格式为：macOS Extended journaled. 设置好后，会自动弹出是否要用该分区作为TM，选择即可。 是否加密：建议加密，第一次会比较慢，但加密后别人拿到硬盘没有正确密码也无法读取。 注意： 第一次备份比较慢，需要备份整个电脑，以后会快，只备份增量。 升级成新系统（macOS Mojave）后，以前的TM备份就只能读不能继续备份了（格式变成了macOS Extended Case senstive not Journaled），需要重新设置并抹去原来的备份。所以，以后不要再随意升级系统了，真坑。","link":"/2018/10/25/time-machine/"},{"title":"Power Plants Databases","text":"发电厂数据 Global Power Plant Database - World Resources InstitueWRI, 2018. Global Power Plant Database - World Resources Institute [WWW Document]. URL http://datasets.wri.org/dataset/globalpowerplantdatabase (accessed 3.5.19). 全球数据，免费。 Global Energy Observatory (GEO)开源免费。 全球范围。 中国地区目前只有20%的数据，包含美国在内的美洲地区有80%左右。 包含火电厂、水电站、以及可再生能源发电站等。 EIA FormsEnergy Information Administration 美国能源信息署 EIA-electricity shows a summary of information on electricity. EIA-923Plant-level operating report, including monthly or annual data such as electric power generation, energy source consumption and EIA-860Plant-level general informatin such as installed capacity, cooling technology, primary fuels, etc.","link":"/2018/10/11/power-plants/"},{"title":"Word插入向量图","text":"在写论文时，经常要在word文档中插入向量图。word对向量图的支持不是很好，eps格式根本就没法看，自家的EMF格式，有时候显示效果好，但大多时候显示效果很差，锯齿状很明显，但是直接另存为PDF或者打印，又可以正常清晰显示，很是麻烦。如果在提交论文过程中需要用EMF清晰格式，解决办法； 在Illustrtor中打开相应的AI或者eps文件，Ctrl+A全选，object-&gt;transform-&gt;scale，通过变换合适的比例（一般是变大），找到想要的显示效果。这样做在word中的显示效果依然不会得到提升，但渲染后的PDF很清晰。","link":"/2018/11/10/word插入向量图/"},{"title":"Windows Time Machine 时间机器","text":"windows系统下的系统备份和文件历史记录（只能备份库文件中的文件）功能不太好用，而又想像macOS下的Time Machine那样记录文件的历史，找到了Github上的一个项目rsync_time_backup可以运行在win（需要通过WSL 或者 cygwin）, Linux, 和macOS下。 安装cygwin，选择默认设置即可。从cygwin命令行窗口进入win目录时，使用cd /cygdrive/XXX，表示虚拟目录。 安装rsync_time_backup：git clone https://github.com/laurent22/rsync-time-backup 运行rsync_time_backup命令（详情请参见上面的GitHub项目链接）： 第一次运行时出错，显示$&#39;\\r&#39;: 未找到命令，这是因为windows文件系统下会给每一行结尾加上\\r，但Unix系统下不识别，解决办法是用在cygwin命令行窗口用curl命令直接下载并覆盖rsync_tmbackup.sh 1curl https://raw.githubusercontent.com/mengfeimu/rsync-time-backup/master/rsync_tmbackup.sh &gt; rsync_tmbackup.sh rsync: 未找到命令 需要重新运行cygwin_setup.exe并安装rsync包。 执行同步命令（onedrive/Apps目录下）：sh ./rsync_tmbackup.sh backup_source_dir backup_destination_dir 如果是第一次同步，还需要向目标文件夹下创建新文件backup.marker，按照提示操作即可创建。 问题：目标文件夹下各个日期文件夹下都包含有所有文件，也就是说重复占用了很多空间（虽然没有进行拷贝），并非像项目介绍中所说的使用hardlink减少了文件体积，是我理解有误吗？ 有些文件夹是临时文件，没必要同步，可以设置exclusion-file来跳过这些文件夹（如C:\\OneDrive\\apps\\rsync-time-backup目录下的excluded_folders.txt）： 12- /Github/hexo_blogs/node_modules/- /Github/hexo_blogs/.deploy_git/ 该文件里内容的格式参考The”exclude-from” file。 执行同步命令如下： 1sh ./rsync_tmbackup.sh /cygdrive/c/OneDrive/ /cygdrive/g/OneDrive_backup excluded_folders.txt 硬盘空间不够怎么办： 可直接在硬盘备份目录下删除较早日期的备份，不影响其他备份。","link":"/2019/05/29/win-time-machine/"},{"title":"Win7升级win10","text":"办公室的电脑是win7系统，本想着不折腾了，就这样用吧，没想到不能安装已经下载好的VISIO2019。不想再重新装VISIO2016，怕因为版本不一无法打开以前的文件。于是考虑升级win10。 搜索之后发现，win7升级win10后所有的软件和文件都保存，并没有删除。方法如下： 微软官网下载安装包，win10下载链接； 双击下载的安装包，按照提示安装即可。 果然，几乎所有程序都可以直接打开使用。（需要重新替换ArcGIS安装文件夹中的Afcore.dll文件。）","link":"/2019/04/19/win7升级win10/"},{"title":"在指定网站搜索","text":"用Google或者百度搜索时，若想限定搜索某个指定网站的内容，则用 1keys_words site:zhihu.com 当然，也可以在网站名前面加上https://www.等一大串。","link":"/2018/10/10/在指定网站搜索/"},{"title":"2020公务员考试复习笔记","text":"主要记录错题和不会的知识点。 容易望文生义或错用的成语不刊之论：比喻不能改动或不可磨灭的言论，用来形容文章或言辞的精准得当，无懈可击。 不经之谈：荒诞、没有根据的话。 相视莫逆：形容彼此间友谊深厚，无所违逆于心。 去芜存菁：除去杂质、保留精华。 摄人心魄：把人的心灵召去。形容具有很强的吸引力。形容美好的事物，让自己失去了自我，以至于像魂被取走了似的。 篝火狐鸣：出自陈胜吴广起义，比喻策划起义 常识判断陕西：大力发展枢纽经济、门户经济、流动经济 近代科学之父 伽利略 苔藓植物为监测空气污染程度的指示植物 黑龙江省抚远市乌苏镇是中国经度的东极，是中国最东端的行政乡镇，号称“东方第一镇”。 资料分析主营业务利润率=利润总额/主营业务收入*100% A拉动B增长的百分点=A的贡献率*B总量增长率 贡献率=某部分增长量/总量增长量 分量的现期增长率&lt;总量现期增长率时，分量占比下降，反之则上升 翻番：$$A翻了n番=A2^n$$ 年平均增长量：$$m=(y2-y1)/n$$年平均增长率$$x=\\sqrt[n] {y2/y1} -1$$若x%为增长率，则增长量为$$\\Delta = \\frac {y2}{1+x\\%}x\\%$$","link":"/2019/10/18/公务员考试复习笔记/"},{"title":"美国地区划分","text":"按照不同标准，有不同的划分方法，详见：List of regions of the United States 按照人口普查局的划分，美国可划分为4大部分。 共有八个大区，若干小区，如图： 图片wiki链接","link":"/2019/07/02/美国地区划分/"},{"title":"屏幕远程共享","text":"macOS提供了自带的屏幕共享功能，screen sharing，打开之后输入对应的Apple ID即可连接。但如何在其他平台如windows, Linux, 或者手机上远程登录操作？ TeamViewer 这是一款供个人免费使用的软件，之前一只用这个，但有时网速不好的快画质非常不清晰。 macOS自带支持VNC 无意之中发现了这个功能。在system preference -&gt; sharing下，勾选screen sharing，便会提示一个地址：vnc://wireless….，在手机上下载Real VNC viewer，不用注册账户登录，直接输入vnc://后面的网址，输入电脑的用户名和密码即可登录，同时可以操作电脑。 不过，好像要从Windows远程登录的话，就得下载VNC客户端，如Real VNC，而且，客户端(VNC Viewer)和服务端(VNC Connect)是两个软件，依然要注册账号，有些麻烦，不如TeamViewer。好处是从macOS端登录win的时候，sublime快捷键是可以正常使用的，而TeamViewer不行。","link":"/2018/10/11/屏幕远程共享/"},{"title":"增量备份数据Backup","text":"经历了上次移动硬盘坏掉的事，虽然科研的数据都在电脑上还有备份，但从此不敢再对数据备份掉以轻心。但若每次都全部重新备份，费时费力，因此考虑增量备份，尤其是对文件内容进行修改后依然能进行正常备份新内容到新目录或移动硬盘。需要的功能有： 备份全部文件、文件夹到指定的备份 某一文件内容经过修改后，可以在备份里更新（传统的复制粘贴要么提示完全替换同名文件、要么就放弃复制） 备份里已有的文件、文件夹不用再重复复制 源目录里已删除的文件、文件夹，在备份里也删除 最好可以定时自动备份 不是备份系统数据，而是自己的文件夹数据，备份系统请用macOS的Time Machine备份。 windows测试系统为WIN10。所用工具为windows自带的命令行工具robocopy。 完全镜像备份在windows中，打开命令行提示符工具(cmd)，命令很简单，只需要一行： 1robocopy dir1 dir2 /R:3 /W:60 /MIR /LOG:copyLog.txt dir1: 源目录 dir2: 新的备份目录 /MIR: 镜像备份文件，即得到一个完全一模一样的备份，与/E /PURGE作用一样 /LOG: 把备份的log信息存储到一个文件里，可以查看具体进行了哪些操作 以后对dir1进行的操作，比如新增文件、文件夹，修改的某个文件，删除了某个文件，都同样执行以上命令，就可以完全镜像备份为一模一样的新目录。 将以上命令存储到task.bat文件中，双击即可运行进行备份。若要利用windows计划任务进行定时备份，则： 按win键搜索：task scheduler，双击打开 create task，在弹出窗口中设置其属性。 备份新增内容但是不删除如果有些文件夹不想留在dir1里，但是还是想留个备份在dir2，那么就不要执行/MIR操作，相反，改用/E即可： 1robocopy dir1 dir2 /R:3 /W:60 /E /LOG:copyLog.txt 关于robocopy的更多操作，可以 参考自带的文档：在命令行提示符(cmd)中输入help robocopy， 或者参考https://blog.51cto.com/larryhung/1329100 看到有人推荐免费的开源软件FreeFileSync，没试过。","link":"/2019/03/15/增量备份/"},{"title":"回复审稿意见的艺术","text":"Nature Geoscience 2019年9月发表的一篇题为 “The art of responding to reviews” 的 Editorial 文章，讲回复审稿意见的艺术，读来还是很有收获，特此分享。 原文链接: https://doi.org/10.1038/s41561-019-0386-7 Between submission of your paper and its publication stands the peer-review process. Responding to reviewer comments effectively will help to make this stage an edifying rather than painful experience. Credit: NLshop / Alamy Stock Photo A convoluted back-and-forth between authors and reviewers can easily mean months of delay, not to mention effort, anger and anxiety. As editors, we are instrumental in keeping the process on track. We check reviewers for conflicts of interest, keep in touch to ensure reports are on time, and ask them to be as objective and constructive as they can. We also carefully read and evaluate reviewer comments, and request rewrites of inappropriately worded reports. However, authors, too, can make a big difference to how their papers fare with reviewers. Like everyone involved, they have a responsibility to keep the exchanges fruitful and dispassionate, even when perspectives on the science differ. We were thus pleased when one of our authors recently appreciated our invitation to reconsider the language of their rebuttal letter, and understood that “it would take superhuman objectivity [from the negative reviewer] to put aside being called ‘obtuse’ (several times)”. To clarify the process: the primary purpose of the rebuttal is to convince the reviewers that all of the points raised have been addressed in an adequate manner — that is, incorporated or refuted. We usually send the authors’ responses to the previous round of review back to all reviewers for their consideration, so the responses should be worded for reviewer consumption. Here, we would like to share our top tips on how to write a rebuttal letter that is likely to avoid unnecessary wrinkles and detours. Seek clarity. Read the reports and the decision letter from your editor more than once. Leave at least one good night’s sleep between readings, before you even start thinking about your rebuttal. If, despite all your efforts and consultation with a friendly colleague, an important comment is not clear or too general to be addressed (such as “section X is bad”), feel free to ask the editor to seek clarification from the reviewer with a specific question. Tone of response. Respond in language that conveys your conviction that the reviewers are knowledgeable, well-meaning people who have given up their time to assess your paper. If you do not hold that conviction, do not let that show in your response, but raise your concerns in a separate cover letter to the editor, with as much evidence and specifics as you can collate. Follow through. A thorough response to the reviewers is only half the ticket. Ensure that in the manuscript itself, you have also addressed all of the comments and requests for clarification. If the reviewers struggled to follow your reasoning, it is likely that others will too. Make it easy for editors and reviewers. The easier it is to assess the revision, the more likely you are to receive a quick answer. It helps to highlight key responses to the most crucial issues at the top; to list changes to the manuscript in your rebuttal letter with the relevant comment and response; and to include line numbers in the revised manuscript and point to them in the response where appropriate. Stand up for your science. Reviewers are as fallible as everybody else. If you believe they made a mistake, explain your reasoning politely and provide compelling support for your point of view. If you think there has been a misunderstanding, explain. There is no point in being dismayed about errors: most likely the subject matter is complicated and you know more about the specific piece of work presented in your paper than the reviewer. Make it complete, keep it concise. Editors and reviewers want to see that all points have been acknowledged and addressed, so do not be tempted to ignore what you do not like. On the other hand, more volume does not make your reasoning sharper, and a long-winded thirty-page rebuttal is more likely to lead reviewers down the path of procrastination than a crisp and clear two-page response. Write as much as you have to, but as little as possible. Focus on the substance, not the personalities. Try to keep yourself from guessing who the reviewers are and what their intentions might be: you have little to win and much to lose. We find that the rate of failure with such guesses — when they are expressed to us — is high. Second-guessing identities is more likely to distract from responding effectively than to help your case. If your experience is limited — either with writing rebuttals or with being on the other side, as a peer reviewer — we would recommend that you do not rely solely on our top tips, but in addition find a mentor or colleague to go through your proposed rebuttal and advise. It is worth focusing your energy to make your paper as convincing as you can, and the reviewers’ comments are there to help with that. Ultimately, it is the strength of your science that will determine whether your paper is published, and where.","link":"/2019/09/26/审稿意见/"},{"title":"流程图","text":"画流程图的工具： processon.com免费的在线作图工具：流程图、思维导图等都可以，不用安装软件，有模版可用。 用procession导出时经常会出现格式问题，如文字超出边框。高dpi选项只有PDF，没有图片，效果不好。所以，还是用VISIO好了。 VISIO by Microsoft20190410 以下仅用于用，请支持正版，捍卫版权！ VISIO 2019 Pro，激活工具：microkms_v18.09.25_office_visio激活工具.exe 完美和Office融合，直接复制流程图，粘贴到word和PPT中即可，也可导出自定义DPI的图片、PDF等格式。 VISIO无法激活的问题20190731 使用上述KMS激活工具，使用了一段时间后要求重新激活，继续使用该KMS工具，显示激活成功但打开VISIO之后仍旧无法编辑，要求激活，多次尝试后无效，改用以下方式： 确保是Vol版本即批量授权版本（因为之前用KMS激活过，所以是Vol版本，不用执行这一步），如果不是，则需要转化： 复制以下代码，另存为.bat文件并用管理员权限打开： 12345if exist \"%ProgramFiles%\\Microsoft Office\\Office16\\ospp.vbs\" cd /d \"%ProgramFiles%\\Microsoft Office\\Office16\"if exist \"%ProgramFiles(x86)%\\Microsoft Office\\Office16\\ospp.vbs\" cd /d \"%ProgramFiles(x86)%\\Microsoft Office\\Office16\"cscript ospp.vbs /rearmfor /f %%x in ('dir /b ..\\root\\Licenses16\\visio???vl_kms*.xrm-ms') do cscript ospp.vbs /inslic:\"..\\root\\Licenses16\\%%x\" &gt;nulfor /f %%x in ('dir /b ..\\root\\Licenses16\\visio???vl_mak*.xrm-ms') do cscript ospp.vbs /inslic:\"..\\root\\Licenses16\\%%x\" &gt;nul 设置KMS密钥和KMS服务器 打开Office的安装目录，也就是代码里的%ProgramFiles%\\Microsoft Office\\Office16\\（64位）或者%ProgramFiles(x86)%\\Microsoft Office\\Office16\\（32位）。 选择在此处以管理员权限打开PowerShell，输入： 1cscript ospp.vbs /inpkey:9BGNQ-K37YR-RQHF2-38RQ3-7VCBB 如果是其他版本的VISIO，可查询微软官网中提供的KMS密钥。 设置KMS服务器： 1cscript ospp.vbs /sethst:kms.luody.info 这里的服务器选择了此博客中提供的服务器网址，若不可用，请另外查找。 连接KMS服务器进行激活： 1cscript ospp.vbs /act 看到powershell窗口提示：Product activation successful，即表示成功激活，打开VISIO，果然。 也可以尝试https://v0v.bid/，未经试验。 参考链接： https://cjc7373.github.io/2018/12/01/Visio-KMS-Activate/ https://luodaoyi.com/p/ben-zhan-shang-xiankms-fu-wuyi-ju-ming-ling-ji-huo.html","link":"/2019/02/12/流程图/"},{"title":"罗技MK850键盘鼠标套装","text":"多台电脑放在拥挤的办公桌，各种键盘实在不便，于是买了罗技MK850键鼠套装，京东549元，另外买了两年以换代修的保险29元。 MK850可以蓝牙连接，也可以通过在电脑上插迷你的USB（罗技称之为unifying技术）来连接，一共可以连接三个设备。 MacBook Pro和笔记本都顺利通过蓝牙连接了（按白色设备切换键3秒，并在笔记本上打开蓝牙连接），并下载了Logitech Option软件进行设置。 台式机按照操作（按白色设备切换键3秒；Fn+P连按3秒）却无法连接键盘（鼠标可以正常连接）。试了好几次，都不可以。于是先下载Options软件，安装后打开，点击左下角的“添加设备”，按照提示，即可连接上键盘。","link":"/2019/04/16/罗技MK850键盘鼠标套装/"},{"title":"翻墙VPN","text":"使用VPN仅用于科研文献搜索，同时须遵守国家有关法律法规。 Shadowsocks 大约100人民币/年 注册邮箱：xxxx@qq.com 登录后选择有效产品/服务即可看到可用的服务器IP，速度、剩余流量等；每个月60G； 如何连接： 技术支持 -&gt; 帮助中心 -&gt; 查找对应的系统（IOS、macOS、win），按照教程进行连接。 win: 下载gut-config.json文件并与shadowsocks.exe放在同一文件夹（OneDrive已同步）下，双击.exe运行即可。","link":"/2019/04/05/翻墙VPN/"},{"title":"免费音乐网站","text":"以下仅用于试听试看，请支持正版，捍卫版权！ 在线收听https://music.youtube.com https://muxiv.net （这个好像是网易云音乐的镜像网站，但网易云中需要VIP才能听的歌这个也可以免费听。） 下载iTunes分享店 http://its-download-thing.blogspot.com http://retroitunesplus.blogspot.com http://www.baiduonce.com/index.html","link":"/2019/06/13/music/免费音乐网站/"},{"title":"周杰伦","text":"content{:toc}周杰伦可能是被90后最为喜爱的一个歌手了，以前只断断续续听过他的《简单爱》、《双截棍》、《霍元甲》、《东风破》等最广为流传的歌，近来找到他的专辑一张一张听，惊艳到了，像是《JAY》里的娘子、可爱女人、斗牛，《范特西》里的忍者，都是以前没有听过的。最近像疯了一样晚上回到公寓就开始带着耳机听，很喜欢。 JAY 2000可爱女人词/徐若瑄 漂亮的让我面红的可爱女人 温柔的让我心疼的可爱女人 透明的让我感动的可爱女人 坏坏的让我疯狂的可爱女人 漂亮的让我面红的可爱女人 温柔的让我心疼的可爱女人 透明的让我感动的可爱女人 坏坏的让我疯狂的可爱女人 完美主义星晴娘子如何评价周杰伦《娘子》《梯田》《止战之殇》这几首歌？ - 徐行之的回答 - 知乎 斗牛黑色幽默伊斯坦堡印第安老斑鸠龙卷风反方向的钟范特西 2001爱在西元前爸我回来了2004年无与伦比演唱会上《梯田》+《爸我回来了》，中间有一段新加入了笛声，很好听。 简单爱忍者初次听有种北野武《座头市》配乐的感觉，很奇妙，后面的《对不起》也有部分类似的调调，很喜欢。个人觉得比双节棍更丰富。 开不了口如何评价周杰伦的《开不了口》？ - 徐行之的回答 - 知乎 词/徐若瑄 才离开没多久就开始 担心今天的你过得好不好 整个画面是你 想你想的睡不着 嘴嘟嘟那可爱的模样 还有在你身上香香的味道 我的快乐是你 想你想的都会笑 没有你在我有多难熬 （没有你在我有多难熬多烦恼） 没有你烦我有多烦恼 （没有你烦我有多烦恼多难熬） 穿过云层 我试着努力向你奔跑 爱才送到 你却已在别人怀抱 就是开不了口 让她知道 我一定会呵护着你 也逗你笑 你对我有多重要 我后悔没 让你知道 安静的听你撒娇 看你睡着 一直到老 就是开不了口 让她知道 就是那么简单几句 我办不到 整颗心悬在半空 我只能够 远远看着 这些我都做得到 但那个人已经不是我 上海一九四三当年的上海生活景象，清晰可见，浮在眼前。 泛黄的春联还残留在墙上 依稀可见几个字岁岁平安 在我没回去过的老家米缸 爷爷用楷书写一个满 黄金葛爬满了雕花的门窗 夕阳斜斜映在斑驳的砖墙 铺着榉木板的屋内还弥漫 姥姥当年酿的豆瓣酱 我对着黑白照片开始 想像爸和妈当年的模样 说着一口吴侬软语的姑娘缓缓走过外滩 消失的旧时光一九四三 在回忆的路上时间变好慢 老街坊小弄堂 是属于那年代白墙黑瓦的淡淡的忧伤 消失的旧时光一九四三 回头看的片段有一些风霜 老唱盘旧皮箱 装满了明信片的铁盒里藏着一片玫瑰花瓣 对不起如何评价周杰伦的《对不起》？ - 徐行之的回答 - 知乎 广场一枚铜币悲伤的很隐秘 它在许愿池里轻轻叹息 太多的我爱你让它喘不过气 已经失去意义 戒指在哭泣静静躺在抽屉 它所拥有的只剩下回忆 相爱还有别离像无法被安排的雨 随时准备来袭 我怀念起国小的课桌椅 怀念著用铅笔写日记 记录那最原始的美丽 记录第一次遇见的你 ​ 如果我遇见你是一场悲剧 我想我这辈子注定一个人演戏 最后再一个人慢慢地回忆 没有了过去我将往事抽离 如果我遇见你是一场悲剧 我可以让生命就这样毫无意义 或许在最后能听到你一句 轻轻地叹息后悔着对不起 威廉古堡双节棍安静 只剩下钢琴陪我弹了一天 睡著的大提琴 安静的旧旧的 我想你已表现的 非常明白 我懂我也知道 你没有舍不得 你说你也会难过我不相信 牵著你陪着我 也只是曾经 希望他是真的比我还要爱你 我才会逼自己离开 你要我说多难堪 我根本不想分开 为什么还要我用微笑来带过 我没有这种天份 包容你也接受他 不用担心的太多 我会一直好好过 你已经远远离开 我也会慢慢走开 为什么我连分开都迁就着你 我真的没有天份 安静的没这么快 我会学着放弃你 是因为我太爱你 八度空间 2002半兽人动感的旋律，据说是游戏《魔兽争霸》的主题曲。 半岛铁盒暗号几处假音很飘逸！ ​ 叶惠美 2003以父之名懦夫反毒品的作品，词曲均出自周杰伦，夹杂的小孩子的rap很有趣。 晴天 故事的小黄花 从出生那年就飘着 童年的荡秋千 随记忆一直晃到现在 Re So So Si Do Si La So La Si Si Si Si La Si La So 吹着前奏 望着天空 我想起花瓣 试着掉落 为你翘课的那一天 花落的那一天 教室的那一间 我怎么看不见 消失的下雨天 我好想再淋一遍 没想到 失去的勇气我还留着 好想再问一遍 你会等待还是离开 刮风这天 我试过握着你手 但偏偏 雨渐渐 大到我看你不见 还要多久 我才能在你身边 等到放晴的那天 也许我会比较好一点 从前从前 有个人爱你很久 但偏偏 风渐渐 把距离吹得好远 好不容易 又能再多爱一天 但故事的最后 你好像还是说了 拜拜 为你翘课的那一天 花落的那一天 教室的那一间 我怎么看不见 消失的下雨天 我好想再淋一遍 没想到 失去的勇气我还留着 好想再问一遍 你会等待还是离开 刮风这天 我试过握着你手 但偏偏 雨渐渐 大到我看你不见 还要多久 我才能在你身边 等到放晴的那天 也许我会比较好一点 从前从前 有个人爱你很久 偏偏 风渐渐 把距离吹得好远 好不容易 又能再多爱一天 但故事的最后 你好像还是说了 拜拜 刮风这天 我试过握着你手 但偏偏 雨渐渐 大到我看你不见 还要多久 我才能够在你身边 等到放晴那天 也许我会比较好一点 从前从前 有个人爱你很久 但偏偏 风渐渐 把距离吹得好远 好不容易 又能再多爱一天 但故事的最后 你好像还是说了 拜拜 三年二班乒乓的声音很魔性。 训导处报到，训导处报到， 三年二班周杰伦，马上到训导处来 眼睛你要擦亮 记住我的模样 表情不用太紧张 我是 三年二班 我专心打球的侧脸还满好看 黑板是吸收知识的地方 只是教室的阳光 那颜色我不太喜欢 没有操场的自然 为何比较漂亮的都是在隔壁班 还有考卷的答案 我刚好都不会算 没关系 再继续努力 没关系 为什么上课时举手很难 为什么拿线上宝物简单 为什么女生不喜欢太胖 为什么别人手机在响 正手发长球的打法只是初级乒乓 反手短打再狠狠杀球是高级乒乓 回转技巧乒乓 前场速攻乒乓 对墙壁 在练习 乒乓 乒乓 这第一名到底要多强(不用问 一定有人向你挑战) 到底还要过多少关(不用怕 告诉他们谁是男子汉) 可不可以不要这个奖(不想问 我只想要留一点汗) 我当我自己的裁判(不想说 选择对手跟要打的仗) 这第一名到底要多强(不用问 一定有人向你挑战) 到底还要过多少关(不用怕 告诉他们谁是男子汉) 可不可以不要这个奖(不想问 我只想要留一点汗) 我当我自己的裁判(不想说 选择对手跟要打的仗) 全体师生注意：今天， 我要表扬一位同学， 他为校争光，我们要向他看齐…… 我不想 就这样一直走 每天都遇上 充满敌意那种眼光 等机会 就是要打倒对方 这种结果我不要 这虚荣的骄傲 这目的很好笑 我其实都知道 你只是想炫耀 我永远做不到 你永远赢不了 我永远做不到 你永远赢不了 永远都赢不了 走下乡 寻找哪有花香(为什么这么简单你做不到) 坐车厢 朝着南下方向(为什么 这种速度你追不到) 鸟飞翔 穿过了这条小巷(为什么 这么简单你做不到) 仔细想 这种生活安详(为什么 这种速度你追不到) 不好笑 不好笑 不好笑 …………………… 这第一名到底要多强(不用物问 一定有人向你挑战) 到底还要过多少关(不用怕 告诉他们谁是男子汉) 可不可以不要这个奖(不想问 我只想要留一点汗) 我当我自己的裁判(不想说 选择对手跟要打的仗) 这第一名到底要多强(不用物问 一定有人向你挑战) 到底还要过多少关(不用怕 告诉他们谁是男子汉) 可不可以不要这个奖(不想问 我只想要留一点汗) 我当我自己的裁判(不想说 选择对手跟要打的仗) 走下乡 寻找哪有花香 坐车厢 朝着南下方向 鸟飞翔 穿过了这条小巷 仔细想 这种生活安详 梯田 文山啊 等你写完词 我都出下一张专辑? 没关系 慢慢来 这首歌我自己来 说到中学时期 家乡的一片片梯田 是我看过最美的绿地 于是也因此让我得了最佳摄影 莫名其妙在画面中的我 不会写词都像个诗人 坐着公车上学的我 看着窗外的牛啃草 是一种说不出的自由自在 Hoi Ya E Ya 那鲁湾 Na E Na Ya Hei 哦~我亲爱的牛儿啊 Hoi Ya E Ya 那鲁湾 Na E Na Ya Hei 哦~跑到哪儿去啦 面店旁的小水沟 留着我们长大的梦 绕过天真 跳至收割期 人们的汗水夹杂着满足与欢喜 是我现在最舍不得的画面 也是我另一项参展作品 靠着回忆 画成油画 拿到奖状 有个啥用 鼓励你多去回忆是吧 哼我真想撕掉 换回自然 怎么梯田不见 多了几家饭店 住在里面看着西洋片 几只水牛 却变成画 挂在墙壁上 象征人们 蒸蒸日上 一堆游客偶尔想看看窗外的观光景点 但只看到 比你住的再高一层的饭店 Hoi Ya E Ya 那鲁湾 Na E Na Ya Hei 哦~我亲爱的牛儿啊 Hoi Ya E Ya 那鲁湾 Na E Na Ya Hei 哦~跑到哪儿去啦 因地制宜 综合利用 利用对还是不对 自私的人类 狼不狼狈 破坏自然的生态 会不会很累 你说为了艺术 要砍下一棵树 酱对还是不对 你说为了装饰 请问干我啥事 是不是只能用相机纪录自然拿给下一代下一代回味 可怜可悲 森林绿地都已成纪录片 闻不到绿意盎然 只享受到乌烟瘴气 我不能教育你们 我不是你们老师 我不是校长 也不能给你们一巴掌…掌…长…长…长篇大论 你们并不想听 我知道但我没办法 我就是要写 你们可能永远不能体会 显微镜底下的我们 会更现实更自私 这种艺术 真的很难领悟 东风破双刀仿佛在听一曲中国风武侠大片的主题曲，爆燃！ 七里香 2004十一月的肖邦 2005依然范特西 2006我很忙 2007不能说的秘密 电影原声带 2007魔杰座 2008跨时代 2010惊叹号 201112新作 2012","link":"/2019/06/06/music/2018-04-01-周杰伦/"},{"title":"The Beatles 披头士","text":"content{:toc}久负盛名的英国摇滚乐队，由四名成员组成： 约翰・列侬（节奏吉他、主音、作词作曲） 保罗・麦卡特尼（贝斯、主音、作词作曲） 乔治・哈里森（主音吉他） 林格・斯塔（鼓手） 1960年成立，1970年解散。据说他们的版权是出奇的贵：披头士的 Get Back 版权有多贵？ - 知乎。 披头士的百科全书网站：https://www.beatlesbible.com Abbey Road 和 Let It Be是披头士解散前的最后两张专辑。都很不错。 Abbey Road 1969 20180520 下载地址 似乎没有撕心裂肺的嘶喊，与以前对摇滚的印象不同，但却十分耐听，现在听起来旋律有点复古，却很时尚。据说这张专辑封面被后来者模仿、致敬过很多次，见知乎链接。这条路现在也成了一个著名的景点。这张专辑一定要按顺序连续听，尤其是后半部分，整体性非常强，甚至连续的两首旋律都很相近。 Come Together 旋律好听！Michael Jackson翻唱过这首歌（YOUTUBE链接），编曲也变得更加动感。这首歌本是列侬向摇滚祖师爷Chuck Berry致敬的，但却被认为是抄袭了You Can’t Catch Me，于是披头士被告上法庭，最终在庭外和解，列侬答应购买版权并翻唱三首Morris Levy的歌作为补偿。 Here come old flat-top, he come grooving up slowly He got ju-ju eyeballs, he’s one holy roller He got hair down to his knees Got to be a joker, he just do what he please He wear no shoeshine, he’s got toe-jam football He got monkey finger, he shoot Coca-Cola He say, “I know you, you know me” One thing I can tell you is you got to be free Come together, right now Over me He bag production, he got walrus gumboot He’s got Ono sideboard, he one spinal cracker He got feet down below his knee Hold you in his armchair, you can feel his disease Come together, right now Over me He roller-coaster, he got early warning He got muddy water, he one mojo filter He say, “One and one and one is three” (传闻这里是暗指Paul想要离队，剩下三个人重组) Got to be good looking ‘cause he’s so hard to see Come together, right now Over me Come together, yeah Come together, yeah Come together, yeah Come together, yeah Something一首慢节奏的情歌，深情而动人，就像是对情人的低声诉说。 Something in the way she moves Attracts me like no other lover Something in the way she woos me I don’t want to leave her now You know I believe and how Somewhere in her smile she knows That I don’t need no other lover Something in her style that shows me Don’t want to leave her now You know I believe and how You’re asking me will my love grow I don’t know, I don’t know You stick around now it may show I don’t know, I don’t know ​ Something in the way she knows And all I have to do is think of her Something in the things she shows me Don’t want to leave her now You know I believe and how Maxwell’s Silver Hammer轻快的曲子，中间穿插的bangbang的锤子🔨，很好听～ 披头士乐队唱的Maxwell’s silver hammer里的Maxwell是谁？ - 徐行之的回答 - 知乎 Joan was quizzical, studied pataphysical Science in the home Late nights all alone with a test-tube ohh oh oh oh Maxwell Edison majoring in medicine Calls her on the phone Can I take you out to the pictures, Joan? But as she’s getting ready to go A knock comes on the door Bang, bang, Maxwell’s silver hammer Came down upon her head Bang, bang, Maxwell’s silver hammer Made sure that she was dead Back in school again Maxwell plays the fool again Teacher gets annoyed Wishing to avoid an unpleasant scene She tells Max to stay when the class has gone away So he waits behind Writing 50 times “I must not be so” oh oh oh But when she turns her back on the boy He creeps up from behind Bang, bang, Maxwell’s silver hammer Came down upon her head Do do do do do Bang, bang, Maxwell’s silver hammer Made sure that she was dead P.C. Thirty-One said “We caught a dirty one” Maxwell stands alone Painting testimonial pictures ohh oh oh oh Rose and Valerie screaming from the gallery Say he must go free (Maxwell must go free) The judge does not agree and he tells them so oh oh oh But as the words are leaving his lips A noise comes from behind Bang, bang, Maxwell’s silver hammer Came down upon his head Do do do do do Bang, Bang, Maxwell’s silver hammer Made sure that he was dead Wow wow wow oh! Do do do do do Silver hammer Max Oh! Darling有力的鼓声加上近乎嘶喊的嗓音和时而轻飘的假音，震撼！描绘了被爱人抛弃之后的极度痛苦，虽然承诺会好好相爱，不再伤害，但，却也无法挽留。 Oh! Darling, please believe me I’ll never do you no harm Believe me when I tell you I’ll never do you no harm Oh! Darling, if you leave me I’ll never make it alone Believe me when I beg you, ooh Don’t ever leave me alone When you told me You didn’t need me anymore Well you know I nearly broke down and cried When you told me You didn’t need me anymore Well you know I nearly broke down and died Oh! Darling, if you leave me I’ll never make it alone Believe me when I tell you I’ll never do you no harm Believe me darling When you told me, ooh You didn’t need me anymore Well you know I nearly broke down and cried When you told me You didn’t need me anymore Well you know I nearly broke down and died Oh! Darling, please believe me I’ll never let you down Oh, believe me darling Believe me when I tell you, ooh I’ll never do you no harm Octopus’s Garden八爪鱼的后花园？轻快的曲调，穿插的女生吟唱让人温暖。我想住在海底，邀请朋友们一块去八爪鱼的后花园里玩。即便在风暴下，海洋的庇护让我们温暖，轻轻躺在海床上。我们肆无忌惮地唱歌、跳舞，因为我们知道不会被别人发现。描绘了一个理想当中的世外桃源的景象，相信是所有孩子的愿望，大人又何尝不是呢。我也想要有这样一个没有世俗喧嚣的地方，孤独终老。 I’d like to be under the sea In an octopus’s garden in the shade He’d let us in, knows where we’ve been In his octopus’s garden in the shade I’d ask my friends to come and see An octopus’s garden with me I’d like to be under the sea In an octopus’s garden in the shade We would be warm below the storm In our little hideaway beneath the waves Resting our head on the sea bed In an octopus’s garden near a cave We would sing and dance around Because we know we can’t be found I’d like to be under the sea In an octopus’s garden in the shade We would shout and swim about The coral that lies beneath the waves (Lies beneath the ocean waves) Oh what joy for every girl and boy Knowing they’re happy and they’re safe (Happy and they’re safe) We would be so happy you and me No one there to tell us what to do I’d like to be under the sea In an octopus’s garden with you In an octopus’s garden with you In an octopus’s garden with you I Want You (She’s So Heavy)这可能是我目前看到的最简短直白的歌词了，就这么几句一直重复，后面干脆就没有歌词了，一直重复旋律～7分钟的歌呀。但曲子很棒，低重音很赞，鼓点声和吉他的配合很赞，让人不自主地跟着摇摆。 I want you I want you so bad I want you I want you so bad It’s driving me mad It’s driving me mad She’s so heavy Heavy, heavy, heavy, heavy Yeah, she’s so heavy Here Comes the Sun漫长的寒冬已过，太阳出来了，不会再冷了，一切都会好起来的。越听越温暖的旋律。 Here comes the sun (doo doo doo doo) Here comes the sun, and I say It’s all right Little darling, it’s been a long cold lonely winter Little darling, it feels like years since it’s been here Here comes the sun Here comes the sun, and I say It’s all right Little darling, the smiles returning to the faces Little darling, it seems like years since it’s been here Here comes the sun Here comes the sun, and I say It’s all right Sun, sun, sun, here it comes Sun, sun, sun, here it comes Sun, sun, sun, here it comes Sun, sun, sun, here it comes Sun, sun, sun, here it comes Little darling, I feel that ice is slowly melting Little darling, it seems like years since it’s been clear Here comes the sun Here comes the sun, and I say It’s all right Here comes the sun Here comes the sun, and I say It’s all right It’s all right Because轻声吟唱。 Aaaaaahhhhhh… Because the world is round it turns me on Because the world is round…aaaaaahhhhhh Because the wind is high it blows my mind Because the wind is high…aaaaaaaahhhh Love is old, love is new Love is all, love is you Because the sky is blue, it makes me cry Because the sky is blue…aaaaaaaahhhh Aaaaahhhhhhhhhh… Aaaaahhhhhhhhhh… Aaaaahhhhhhhhhh… You Never Give Me Your Money You never give me your money You only give me your funny paper And in the middle of negotiations You break down I never give you my number I only give you my situation And in the middle of investigation I break down Out of college, money spent See no future, pay no rent All the money’s gone, nowhere to go Any jobber got the sack Monday morning, turning back Yellow lorry slow, nowhere to go But oh, that magic feeling, nowhere to go Oh, that magic feeling, nowhere to go Nowhere to go Aaaaahhhhhhhhhh… Aaaaahhhhhhhhhh… Aaaaahhhhhhhhhh… One sweet dream Pick up the bags and get in the limousine Soon we’ll be away from here Step on the gas and wipe that tear away One sweet dream came true today Came true today Came true today (Yes it did) One two three four five six seven All good children go to Heaven ( repeat and fade out) Sun King每个人都开怀大笑，每个人都过的幸福。 Aaaaahhhhhhhhhh… Here comes the sun king Here comes the sun king Everybody’s laughing Everybody’s happy Here comes the sun king Quando paramucho mi amore de felice carathon Mundo paparazzi mi amore cicce verdi parasol Questo abrigado tantamucho que canite carousel Mean Mr. Mustard Mean Mister Mustard sleeps in the park Shaves in the dark trying to save paper Sleeps in a hole in the road Saving up to buy some clothes Keeps a ten-bob note up his nose Such a mean old man Such a mean old man His sister Pam works in a shop She never stops, she’s a go-getter Takes him out to look at the queen Only place that he’s ever been Always shouts out something obscene Such a dirty old man Dirty old man Polythene Pam Well you should see Polythene Pam She’s so good-looking but she looks like a man Well you should see her in drag dressed in her polythene bag Yes you should see Polythene Pam Yeah yeah yeah Get a dose of her in jackboots and kilt She’s killer-diller when she’s dressed to the hilt She’s the kind of a girl that makes the “News of the World” Yes you could say she was attractively built Yeah yeah yeah She Came In Through The Bathroom Window (Gonna come out now,ha ha ha,wow look out.) She came in through the bathroom window Protected by a silver spoon But now she sucks her thumb and wanders By the banks of her own lagoon Didn’t anybody tell her? Didn’t anybody see? Sunday’s on the phone to Monday Tuesday’s on the phone to me She said she’d always been a dancer She worked at 15 clubs a day And though she thought I knew the answer Well I knew what I could not say And so I quit the police department And got myself a steady job And though she tried her best to help me She could steal but she could not rob Didn’t anybody tell her? Didn’t anybody see? Sunday’s on the phone to Monday Tuesday’s on the phone to me Oh yeah Golden Slumbers亲爱的，不要哭，安静地睡吧，我会在你身旁为你唱一首催眠曲，让你进入金色梦乡。 Once, there was a way to get back homeward Once, there was a way to get back home Sleep, pretty darling, do not cry And I will sing a lullaby Golden slumbers fill your eyes Smiles awake you when you rise Sleep, pretty darling, do not cry And I will sing a lullaby Once, there was a way to get back homeward Once, there was a way to get back home Sleep, pretty darling, do not cry And I will sing a lullaby Carry That Weight Boy, you’re going to carry that weight, Carry that weight a long time Boy, you’re going to carry that weight Carry that weight a long time I never give you my pillow I only send you my invitations And in the middle of the celebrations I break down Boy, you’re going to carry that weight Carry that weight a long time Boy, you’re going to carry that weight Carry that weight a long time The End连续不断的鼓声，振奋得好像这不是结束，而是才刚刚开始。然而，一切都将要结束了，The Beatles，将结束了。我爱你，就像你爱我一样。 Oh yeah, all right Are you going to be in my dreams Tonight? [Drum solo] [Guitar solos] And in the end The love you take Is equal to the love You make Her Majesty Her Majesty’s a pretty nice girl But she doesn’t have a lot to say Her Majesty’s a pretty nice girl But she changes from day to day I want to tell her that I love her a lot But I gotta get a bellyful of wine Her Majesty’s a pretty nice girl Someday I’m going to make her mine, oh yeah Someday I’m going to make her mine Let It Be 1970 The Beatles 1 200020180520 下载地址 这是一张2000年重制的专辑，收录了27首披头士的冠军单曲。（听完了才发现这张专辑怎么收录的大都是情歌。） Love Me Do Love, love me do You know I love you I’ll always be true So please, love me do Whoa, love me do Love, love me do You know I love you I’ll always be true So please, love me do Whoa, love me do Someone to love Somebody new Someone to love Someone like you Love, love me do You know I love you I’ll always be true So please, love me do Whoa, love me do Love, love me do You know I love you I’ll always be true So please, love me do Whoa, love me do Yeah, love me do Whoa, oh, love me do From Me to You Da da da da da dum dum da Da da da da da dum dum da If there’s anything that you want If there’s anything I can do Just call on me and I’ll send it along With love from me to you I’ve got everything that you want Like a heart that’s oh so true Just call on me and I’ll send it along With love from me to you I got arms that long to hold you And keep you by my side I got lips that long to kiss you And keep you satisfied, oooh (细思极恐) If there’s anything that you want If there’s anything I can do Just call on me and I’ll send it along With love from me to you From me, to you Just call on me and I’ll send it along With love from me to you I got arms that long to hold you And keep you by my side I got lips that long to kiss you And keep you satisfied, oooh If there’s anything that you want If there’s anything I can do Just call on me and I’ll send it along With love from me to you To you, to you, to you She Loves You She loves you, yeah, yeah, yeah She loves you, yeah, yeah, yeah She loves you, yeah, yeah, yeah, yeah You think you lost your love Well, I saw her yesterday It’s you she’s thinking of And she told me what to say She says she loves you And you know that can’t be bad Yes, she loves you And you know you should be glad She said you hurt her so She almost lost her mind But now she says she knows You’re not the hurting kind She says she loves you And you know that can’t be bad Yes, she loves you And you know you should be glad, ooh She loves you, yeah, yeah, yeah She loves you, yeah, yeah, yeah And with a love like that You know you should be glad You know it’s up to you I think it’s only fair Pride can hurt you too Apologize to her Because she loves you And you know that can’t be bad Yes, she loves you And you know you should be glad, ooh She loves you, yeah, yeah, yeah She loves you, yeah, yeah, yeah With a love like that You know you should be glad With a love like that You know you should be glad With a love like that You know you should be glad Yeah, yeah, yeah Yeah, yeah, yeah, yeah I Want to Hold Your Hand Oh yeah, I’ll tell you something I think you’ll understand When I say that something I wanna hold your hand I wanna hold your hand I wanna hold your hand Oh please, say to me You’ll let me be your man And please, say to me You’ll let me hold your hand You let me hold your hand I wanna hold your hand And when I touch you I feel happy Inside It’s such a feeling that my love I can’t hide I can’t hide I can’t hide Yeah, you’ve got that something I think you’ll understand When I say that something I wanna hold your hand I wanna hold your hand I wanna hold your hand And when I touch you I feel happy Inside It’s such a feeling that my love I can’t hide I can’t hide I can’t hide Yeah, you’ve got that something I think you’ll understand When I feel that something I wanna hold your hand I wanna hold your hand I wanna hold your hand I wanna hold your hand Can’t Buy Me Love爱是买不来的。 Can’t buy me love, love Can’t buy me love I’ll buy you diamonds ring my friend If it makes you feel alright I’ll get you anything my friend If it makes you feel alright ‘Cause I don’t care too much for money Money can’t buy me love I’ll give you all I’ve got to give If you say you love me too I may not have a lot to give But what I’ve got I’ll give to you I don’t care too much for money Money can’t buy me love Can’t buy me love, everybody tells me so Can’t buy me love, no, no, no, no Say you don’t need no diamond rings And I’ll be satisfied Tell me that you want the kind of things That money just can’t buy I don’t care too much for money Money can’t buy me love Can’t buy me love, everybody tells me so Can’t buy me love, no, no, no, no Say you don’t need no diamond rings And I’ll be satisfied Tell me that you want the kind of things That money just can’t buy I don’t care too much for money Money can’t buy me love Can’t buy me love, love Can’t buy me love, oh A Hard Day’s Night艰难的一天，上完班累的像只狗，只为赚钱养家糊口，给你买你想要的一切。当我回到家，紧紧拥抱我，让我感受你的爱，这样我才能不觉疲惫。 It’s been a hard day’s night, and I’ve been working like a dog It’s been a hard day’s night, I should be sleeping like a log But when I get home to you I find the things that you do Will make me feel alright You know I work all day to get you money to buy you things And it’s worth it just to hear you say you’re going to give me everything So why on earth should I moan, cos when I get you alone You know I feel OK When I’m home everything seems to be right When I’m home feeling you holding me tight, tight, yeah It’s been a hard day’s night, and I’ve been working like a dog It’s been a hard day’s night, I should be sleeping like a log But when I get home to you I find the things that you do Will make me feel alright owww So why on earth should I moan, cos when I get you alone You know I feel OK When I’m home everything seems to be right When I’m home feeling you holding me tight, tight, yeah It’s been a hard day’s night, and I’ve been working like a dog It’s been a hard day’s night, I should be sleeping like a log But when I get home to you I find the things that you do Will make me feel alright You know I feel alright You know I feel alright I Feel Fine Baby’s good to me, you know She’s happy as can be, you know She said so I’m in love with her and I feel fine Baby says she’s mine, you know She tells me all the time, you know She said so I’m in love with her and I feel fine I’m so glad that she’s my little girl She’s so glad, she’s telling all the world That her baby buys her things, you know He buys her diamond rings, you know She said so She’s in love with me and I feel fine, mmm Baby says she’s mine, you know She tells me all the time, you know She said so I’m in love with her and I feel fine I’m so glad that she’s my little girl She’s so glad, she’s telling all the world That her baby buys her things, you know He buys her diamond rings, you know She said so She’s in love with me and I feel fine She’s in love with me and I feel fine, mmm, mmm Eight Days A Week一周八天，也不够我爱你。 Ooh, I need your love, babe Guess you know it’s true Hope you need my love, babe Just like I need you Hold me, love me, hold me, love me Ain’t got nothing but love, babe Eight days a week. Love you every day, girl Always on my mind One thing I can say, girl Love you all the time Hold me, love me, hold me, love me Ain’t got nothing but love, girl Eight days a week. Eight days a week I love you Eight days a week Is not enough to show I care Ooh, I need your love, babe Guess you know it’s true Hope you need my love, babe Just like I need you Hold me, love me, hold me, love me Ain’t got nothing but love, babe Eight days a week Eight days a week I love you Eight days a week Is not enough to show I care Love you every day, girl Always on my mind One thing I can say, girl Love you all the time Hold me, love me, hold me, love me Ain’t got nothing but love, babe Eight days a week Eight days a week Eight days a week Ticket to Ride那个让我爱的疯狂的女孩，离开了。 I think I’m gonna be sad I think it’s today, yeah The girl that’s driving me mad Is going away She’s got a ticket to ride She’s got a ticket to ride She’s got a ticket to ride But she don’t care She said that living with me Is bringing her down, yeah For she would never be free When I was around She’s got a ticket to ride She’s got a ticket to ride She’s got a ticket to ride But she don’t care I don’t know why she’s riding so high She ought to think twice She ought to do right by me Before she gets to saying goodbye She ought to think twice She ought to do right by me I think I’m gonna be sad I think it’s today, yeah The girl that’s driving me mad Is going away, yeah Oh, she’s got a ticket to ride She’s got a ticket to ride She’s got a ticket to ride But she don’t care I don’t know why she’s riding so high She ought to think twice She ought to do right by me Before she gets to saying goodbye She ought to think twice She ought to do right by me She said that living with me Is bringing her down, yeah For she would never be free When I was around Ah, she’s got a ticket to ride She’s got a ticket to ride She’s got a ticket to ride But she don’t care My baby don’t care, my baby don’t care My baby don’t care, my baby don’t care My baby don’t care, my baby don’t care (fade out) Help!我不需要别人，我只需要你！ Help! I need somebody Help! Not just anybody Help! You know I need someone Help! (When) When I was younger (When I was young) so much younger than today (I never need) I never needed anybody’s help in any way (Now) But now these days are gone (These days are gone) and I’m not so self assured (And now I find) Now I find I’ve changed my mind, I’ve opened up the doors Help me if you can, I’m feeling down And I do appreciate you being ‘round Help me get my feet back on the ground Won’t you please, please help me? (Now) And now my life has changed (My life has changed) in oh so many ways (My independence) My independence seems to vanish in the haze (But) But ev’ry now (Every now and then) and then I feel so insecure (I know that I) I know that I just need you like I’ve never done before Help me if you can, I’m feeling down And I do appreciate you being ‘round Help me get my feet back on the ground Won’t you please, please help me? When I was younger, so much younger than today I never needed anybody’s help in any way (Now) But now these days are gone (These days are gone) and I’m not so self assured (And now I find) Now I find I’ve changed my mind, I’ve opened up the doors Help me if you can, I’m feeling down And I do appreciate you being ‘round Help me get my feet back on the ground Won’t you please, please help me? Help me, help me Ooh Yesterday她为何离我而去，我不知道，她自己也不肯说。一定是我说错话了，我现在很想回到从前。 Yesterday all my troubles seemed so far away. Now it looks as though they’re here to stay. Oh, I believe in yesterday. Suddenly, I’m not half the man I used to be. There’s a shadow hanging over me. Oh, yesterday came suddenly. Why she had to go? I don’t know, she wouldn’t say. I said something wrong. Now I long for yesterday. Yesterday love was such an easy game to play. Now I need a place to hide away. Oh, I believe in yesterday. Why she had to go? I don’t know, she wouldn’t say. I said something wrong. Now I long for yesterday. Yesterday love was such an easy game to play. Now I need a place to hide away. Oh, I believe in yesterday. Mm mm mm mm mm mm mm. Day Tripper奈何情深，奈何情浅。你赋以申请，她只不过想轻浮地一日情。 Got a good reason for taking the easy way out Got a good reason for taking the easy way out now She was a day tripper, a one way ticket yeah It took me so long to find out, and I found out She’s a big teaser, she took me half the way there She’s a big teaser, she took me half the way there now She was a day tripper, a one way ticket yeah It took me so long to find out, and I found out Tried to please her, she only played one night stands Tried to please her, she only played one night stands now She was a day tripper, a Sunday driver yeah It took me so long to find out, and I found out Day tripper Day tripper yeah Day tripper Day tripper yeah Day tripper We Can Work It Out Try to see it my way Do I have to keep on talking till I can’t go on? While you see it your way Run the risk of knowing that our love may soon be gone We can work it out We can work it out Think of what you’re saying You can get it wrong and still you think that it’s alright Think of what I’m saying We can work it out and get it straight, or say goodnight We can work it out We can work it out Life is very short, and there’s no time For fussing and fighting, my friend I have always thought that it’s a crime So I will ask you once again Try to see it my way Only time will tell if I am right or I am wrong While you see your way, There’s a chance that we may fall apart before too long We can work it out We can work it out Life is very short, and there’s no time For fussing and fighting, my friend I have always thought that it’s a crime So I will ask you once again Try to see it my way Only time will tell if I am right or I am wrong While you see it your way There’s a chance that we may fall apart before too long We can work it out We can work it out Paperback Writer虽然我有稳定的工作，每日送信，但其实我想当个普通的作家。 Paperback writer Dear Sir or Madam, will you read my book? It took me years to write, will you take a look? It’s based on a novel by a man named Lear And I need a job, so I want to be a paperback writer Paperback writer It’s the dirty story of a dirty man And his clinging wife doesn’t understand His son is working for the Daily Mail It’s a steady job but he wants to be a paperback writer Paperback writer Paperback writer It’s a thousand pages, give or take a few I’ll be writing more in a week or two I can make it longer if you like the style I can change it round and I want to be a paperback writer Paperback writer If you really like it you can have the rights It could make a million for you overnight If you must return it, you can send it here But I need a break and I want to be a paperback writer Paperback writer Paperback writer Paperback writer, paperback writer Paperback writer, paperback writer Paperback writer, paperback writer Paperback writer, paperback writer (fade out) Yellow Submarine故乡的那个海员给我讲的出海故事：大家都在一只黄色的潜艇上，怡然自得，推杯换盏，安静祥和，犹如天堂。 In the town where I was born Lived a man who sailed to sea And he told us of his life In the land of submarines So we sailed up to the sun ‘Til we found the sea of green And we lived beneath the waves In our yellow submarine We all live in a yellow submarine Yellow submarine, yellow submarine We all live in a yellow submarine Yellow submarine, yellow submarine And our friends are all aboard Many more of them live next door And the band begins to play We all live in a yellow submarine Yellow submarine, yellow submarine We all live in a yellow submarine Yellow submarine, yellow submarine Full speed ahead, Mr. Boatswain, full speed ahead! Full speed it is, Sergeant! Cut the cable, drop the cable! Aye-aye, sir, aye-aye! Captain, Captain! As we live a life of ease (a life of ease) Everyone of us (everyone of us) has all we need (has all we need) Sky of blue (sky of blue) and sea of green (sea of green) In our yellow (in our yellow) submarine (submarine, ah-ha) We all live in a yellow submarine Yellow submarine, yellow submarine We all live in a yellow submarine Yellow submarine, yellow submarine We all live in a yellow submarine Yellow submarine, yellow submarine We all live in a yellow submarine Yellow submarine, yellow submarine Eleanor Rigby一首有宗教气息的歌，我们终究都是孤独的。刚举行过热闹婚礼的教堂，孤独的老妇人倚窗遥望，过气的神父写着无人驻听的祷告词，他们在期盼什么，无人知晓，无人在乎。直到死去。 Ah, look at all the lonely people Ah, look at all the lonely people Eleanor Rigby picks up the rice in the church where a wedding has been Lives in a dream Waits at the window, wearing the face that she keeps in a jar by the door Who is it for? All the lonely people Where do they all come from? All the lonely people Where do they all belong? Father McKenzie writing the words of a sermon that no one will hear No one comes near Look at him working, darning his socks in the night when there’s nobody there What does he care? All the lonely people Where do they all come from? All the lonely people Where do they all belong? Ah, look at all the lonely people Ah, look at all the lonely people Eleanor Rigby died in the church and was buried along with her name Nobody came Father McKenzie wiping the dirt from his hands as he walks from the grave No one was saved All the lonely people (Ah, look at all the lonely people) Where do they all come from? All the lonely people (Ah, look at all the lonely people) Where do they all belong? Penny Lane英国街道上的一个公交站，这里发生的故事有些奇怪。 In Penny Lane there is a barber showing photographs Of every head he’s had the pleasure to have known And all the people that come and go Stop and say hello On the corner is a banker with a motorcar The little children laugh at him behind his back And the banker never wears a mac In the pouring rain, very strange Penny Lane is in my ears and in my eyes There beneath the blue suburban skies I sit, and meanwhile back In Penny Lane there is a fireman with an hourglass And in his pocket is a portrait of the queen He likes to keep his fire engine clean It’s a clean machine Penny Lane is in my ears and in my eyes A four of fish and finger pies In summer, meanwhile back Behind the shelter in the middle of a roundabout The pretty nurse is selling poppies from a tray And though she feels as if she’s in a play She is anyway In Penny Lane the barber shaves another customer We see the banker sitting waiting for a trim And then the fireman rushes in From the pouring rain, very strange Penny lane is in my ears and in my eyes There beneath the blue suburban skies I sit, and meanwhile back Penny lane is in my ears and in my eyes There beneath the blue suburban skies Penny Lane All You Need Is Love Love, love, love Love, love, love Love, love, love There’s nothing you can do that can’t be done Nothing you can sing that can’t be sung Nothing you can say but you can learn how to play the game It’s easy Nothing you can make that can’t be made No one you can save that can’t be saved Nothing you can do but you can learn how to be you in time It’s easy All you need is love All you need is love All you need is love, love Love is all you need Love, love, love Love, love, love Love, love, love All you need is love All you need is love All you need is love, love Love is all you need Nothing you can know that isn’t known Nothing you can see that isn’t shown Nowhere you can be that isn’t where you’re meant to be It’s easy All you need is love All you need is love All you need is love, love Love is all you need All you need is love (All together, now!) All you need is love (Everybody!) All you need is love, love Love is all you need Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Yee-hai! (Love is all you need) Love is all you need (Love is all you need) Yesterday (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Love is all you need (Love is all you need) Oh yeah! (Love is all you need) She loves you, yeah yeah yeah (Love is all you need) She loves you, yeah yeah yeah (Love is all you need) Hello, Goodbye You say yes, I say no You say stop and I say go go go, oh no You say goodbye and I say hello Hello hello I don’t know why you say goodbye, I say hello Hello hello I don’t know why you say goodbye, I say hello I say high, you say low You say why and I say I don’t know, oh no You say goodbye and I say hello (Hello goodbye hello goodbye) Hello hello (Hello goodbye) I don’t know why you say goodbye, I say hello (Hello goodbye hello goodbye) Hello hello (Hello goodbye) I don’t know why you say goodbye (Hello goodbye) I say hello/goodbye Why why why why why why do you say goodbye goodbye, oh no? You say goodbye and I say hello Hello hello I don’t know why you say goodbye, I say hello Hello hello I don’t know why you say goodbye, I say hello You say yes (I say yes) I say no (But I may mean no) You say stop (I can stay) and I say go go go (Till it’s time to go), oh Oh no You say goodbye and I say hello Hello hello I don’t know why you say goodbye, I say hello Hello hello I don’t know why you say goodbye, I say hello Hello hello I don’t know why you say goodbye, I say hello hello Hela heba helloa Hela heba helloa, cha cha cha Hela heba helloa, wooo Hela heba helloa, hela Hela heba helloa, cha cha cha Hela heba helloa, wooo Hela heba helloa, cha cah cah [fade out] Lady Madonna家庭主妇麦当娜，一己之力抚养孩子们，即便食不果腹，上顿不接下顿，依然听着欢快的音乐，幸福地活着。 Lady Madonna, children at your feet Wonder how you manage to make ends meet Who finds the money when you pay the rent Did you think that money was Heaven sent? Friday night arrives without a suitcase Sunday morning creeping like a nun Monday’s child has learned to tie his bootlace See how they run Lady Madonna, baby at your breast Wonders how you manage to feed the rest? See how they run Lady Madonna lying on the bed Listen to the music playing in your head Tuesday afternoon is never ending Wednesday morning papers didn’t come Thursday night your stockings needed mending See how they run Lady Madonna, children at your feet Wonder how you manage to make ends meet Hey Jude传唱度追高的歌之一，2012年伦敦奥运会压轴歌曲，乐队成员Paul演唱。开心地唱出悲伤的歌，正如开心地讲出伤心的往事一样，难得。 Hey, Jude, don’t make it bad Take a sad song and make it better Remember to let her into your heart Then you can start to make it better Hey, Jude, don’t be afraid You were made to go out and get her The minute you let her under your skin Then you begin to make it better And anytime you feel the pain, Hey, Jude, refrain Don’t carry the world upon your shoulders For well you know that it’s a fool Who plays it cool By making his world a little colder Nah, nah nah, nah nah, nah nah, nah nah Hey, Jude, don’t let me down You have found her, now go and get her Remember to let her into your heart Then you can start to make it better So let it out and let it in, Hey, Jude, begin You’re waiting for someone to perform with And don’t you know that it’s just you, Hey, Jude, you’ll do The movement you need is on your shoulder Nah, nah nah, nah nah, nah nah, nah nah yeah Hey, Jude, don’t make it bad Take a sad song and make it better Remember to let her under your skin Then you’ll begin to make it better, better, better, better, better… oh! Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude (Jude) Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude (yeah, yeah, yeah) Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude (don’t make it bad, Jude) Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude (take a sad song and make it better) Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude (oh, Jude) Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude (Jude, hey, Jude, whoa) Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude (ooh) Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude Nah, nah nah, nah nah, nah, nah, nah nah, Hey, Jude [fade out] Get Back Sweet Loretta Fart thought she was a cleaner But she was a frying pan, yeah Rosetta… The picker! The picker! Picture the fingers burning! Oo-wee! OK? 1, 2, 1, 2, 3, 4) Jo Jo was a man who thought he was a loner But he knew it couldn’t last Jo Jo left his home in Tucson, Arizona For some California grass Get back, get back Get back to where you once belonged Get back, get back Get back to where you once belonged Get back Jo Jo Go home Get back, get back Get back to where you once belonged Get back, get back Back to where you once belonged Get back, Jo Sweet Loretta Martin thought she was a woman But she was another man All the girls around her say she’s got it coming But she gets it while she can Oh, get back, get back Get back to where you once belonged Get back, get back Get back to where you once belonged Get back, Loretta Go home Oh, get back, get back Get back to where you once belonged Get back, get back Get back to where you once belonged Get back Woo… Thanks, Mo! I’d like to say “thank you” on behalf of the group And ourselves and I hope we passed the audition!) The Ballad of John and Yoko Standing in the dock at Southampton Trying to get to Holland or France The man in the mac said, “You’ve got to go back” You know they didn’t even give us a chance Christ you know it ain’t easy You know how hard it can be The way things are going They’re going to crucify me Finally made the plane into Paris Honeymooning down by the Seine Peter Brown called to say “You can make it OK You can get married in Gibraltar, near Spain” Christ you know it ain’t easy You know how hard it can be The way things are going They’re going to crucify me Drove from Paris to the Amsterdam Hilton Talking in our beds for a week The newspapers said, “Say what you doing in bed?” I said, “We’re only trying to get us some peace” Christ you know it ain’t easy You know how hard it can be The way things are going They’re going to crucify me Saving up your money for a rainy day Giving all your clothes to charity Last night the wife said “Oh boy, when you’re dead You don’t take nothing with you But your soul, think!” Made a lightning trip to Vienna Eating chocolate cake in a bag The newspapers said, “She’s gone to his head They look just like two gurus in drag” Christ you know it ain’t easy You know how hard it can be The way things are going They’re going to crucify me Caught an early plane back to London Fifty acorns tied in a sack The men from the press said, “We wish you success It’s good to have the both of you back” Christ you know it ain’t easy You know how hard it can be The way things are going They’re going to crucify me The way things are going They’re going to crucify me Something见专辑Abbey Road. Come Together见专辑Abbey Road. Let It Be见专辑Let It Be. The Long and Winding Road The long and winding road, that leads, to your door Will never disappear, I’ve seen that road before It always leads me here, lead me to your door The wild and windy night, that the rain, washed away Has left a pool of tears, crying for the day Why leave me standing here, let me know the way Many times I’ve been alone, and many times I’ve cried Any way you’ll never know, the many ways I’ve tried And still they lead me back, to the long winding road You left me standing here a long long time ago Don’t leave me waiting here, lead me to your door But still they lead me back to the long winding road You left me standing here, a long long time ago Don’t keep me waiting here (Don’t keep me wait), lead me to your door Yeah, yeah, yeah, yeah Sgt. Pepper’s Lonely Hearts Club Band 1967乐评：摇滚乐的标杆——Sgt. Pepper’s Lonely Hearts Club Band - 林艾舒的文章 - 知乎","link":"/2019/06/06/music/2018-05-19-TheBeatles/"},{"title":"高学历青年干部容易进入的10个误区","text":"转载自微信公众号“江西选调生动态”，原文链接。 一位市委书记的讲稿：高学历青年干部容易进入的10个误区2018-09-18 北海市委书记王乃学 选调生要从生力军成长为顶梁柱 ——北海市委书记王乃学为广西第三期选调生党性修养专题培训班授课讲稿 （2018年5月30日 百色干部学院） 非常荣幸,来和处级选调生学员做一个交流。 我看到，这个班50个人，一半以上都是“985”高校毕业的，一半以上都是博士，一半以上都有十多年工作经历，所有的同志都是处级以上。既是选调生，受过良好的教育，有非常好的理论基础。同时又是处级中层干部，有非常丰富的工作经验。 理论方面、政治方面其他老师都讲了，所以今天，我就从选调生，或者说年轻干部如何更好地成长，从我个人的体会和我这么多年来工作当中经历观察到的年轻同志的成长过程，从自治区厅局工作的感觉和到地方工作的感觉，厅领导希望自己厅内的处长是什么样，市领导希望自己的县区书记、县区长或局长是什么样，就从这个角度跟大家作一个交流。也不一定对，但是我们聊一聊。 我讲的题目是《选调生要从生力军成长为顶梁柱》。我琢磨归纳了一下青年选调生容易进入的十个误区，或者说容易犯的十个毛病。这个也不一定对也不一定全，但是我们就交流一下。再谈谈，选调生和青年干部要打好人生事业的根基。 选调生容易出现的十个误区 选调生要打好人生事业的根基 我们看同样一年来到机关，来到一个单位的同志，五年以后谁行谁不行就能看出来了，十年以后有的人就已经提拔了，而有的虽然是博士、硕士，还原地踏步。到20年以后有的人提厅长、市长了，有的人还当科长呢。为什么呢？ 这个就是你的后劲足不足、你的工作路子对不对、你的功夫到不到决定的。所以刚才就说这是长跑。现在选调生来了，博士们工作两年就定级副处了，但你如果根基不厚，路子不对，也可能一辈子只是副处了。 这种高低上下的区别，就在于你是不是坚持终身学习的习惯，坚持走正路。你在那里天天琢磨拉关系，人家在那里加班加点、看书学习、做笔记写文章。在一个单位也好、一个市也好，领导给你两次机会都搞砸的话，第三次肯定不会找你了。所以每一个环节都是日常积累，我们应该在工作、生活、品德修养这些方面，打好根基。根基厚重，就能有无限发展空间。主要就是德、能、勤、廉四个方面打好根基。 第一个字是“德”。德首先就是政治品德，就是要为党为国家，无私奉献，高尚正派，以国家和人民为己任，对党忠诚，对国家忠诚，对事业忠诚，是一个踏踏实实、朴朴实实的干部。一颗红心，报国为民，这种政治品德。第二个要有政治行政情商，就是要懂规矩，做政治工作，做行政工作，在政府机关一定要懂规矩，懂规矩首先要尊重你的领导，你在这个单位，连你的领导你都不尊重，你这个政治品德肯定就是差。尊重领导，多请示，多沟通。尊重同事，多交流，多互鉴。做事一定要按程序，不按程序做，不组织团队去做，那个工作就算做成也不是一个好工作。一个机关、一个单位，是一个团队，不是讲个人英雄主义。每一项工作，既把它搞成了，又让这个团队能够进步，这才叫好的工作。另外就是不要把自己当回事，这也是政治情商。 好多人把自己看得太重，领导说一句，好大的压力，耿耿于怀。或者自己一个什么意见，领导没采纳，耿耿于怀。很多人有这个毛病，太把自己当回事，你那个建议可能对，但领导有更全面考虑，他不采纳肯定有他不采纳的道理，你不要把你那点建议当做宝，别把自己太当回事。 第三就是人性品德，人品一定要好，要团结厚道，争千秋万代而不争一时的风光。团结的能力，是一个人非常重要的政治素质，如果你不能搞好团结的话，你这一辈子做不成大事。一定是善于团结、会团结才行。团结就需要有胸怀，需要有修养，要会团结。如果你做一把手的话，做处长也好，县区长也好，就要团结好你这个团队，要有胸怀，要能受委屈，要听不同意见。你要是副手的话，就要团结好你的领导。 我现在有一个原则，就是这个单位发展不行，换一把手；这个单位团结不行，换二把手。一个地方发展不起来，就是你一把手的责任，水平差，不能把整个发展的谋划搞起来，带动大家干起来。但是这个地方团结出问题，就是二把手的毛病，或者副手的毛病。我多次批评过好多人，我说组织是信任那个一把手的，信任那个处长的，组织任命他在这个地方当处长，当你们处的法人代表，你是副处长，你要配合好他，你不要跟他作对，这才能风清气正。也有人说过，老大是老二维护出来的。你这个单位的老二老找毛病，这个老大他也没有威信，整个单位都没法做。这种团结的素质、团结的品德，无论你是当一把手，还是当副手，还是当成员，都是一个团队里面最重要的。不能当害群之马。不团结就是出于私利，就是一种个人的小算盘，这必须刹住。 第四个，要服从分配，不挑不捡，往长远看，每个岗位都是宝贵的经历，这是种品德。现在工作30多年来回头看，哪一个时刻调到哪里去，放在哪个岗位，都是好事，都是宝贵的机会。像中央机关里有的人从大学毕业进中央机关就管汽车，从科员到副处长到处长到司长都管汽车。看似手头有权，实际是很不利于成长。年轻的时候，一定是在哪个岗位上就把它做好，同时组织上把你调到哪，你就高兴地去，不必有任何想法。等你过去，几年后回头一想，都是非常宝贵的，多亏给你换了个地方。这方面有些人年轻的时候想不开，有的时候觉得那个地方有权。在厅里面有的处有权，有的处没权，有的人就贪这个权。有的时候说市里的这个部委办局权力大，那个权力小。有的说我是学工科，你让我搞党建，或者搞什么文化，我又不懂，不愿去。这些都不对。一定要在年轻的时候，多一些岗位，多一些经历，等到组织真正要提拔你的时候，你那些多岗位的东西，不知道哪个段儿它就起作用了，因为你有那个经历，所以那个地方缺人的时候就想到你，而多岗位的经历也有助于更宽的知识、更多的经验、更大的工作能力。这也是品德的一方面。 第二个字是“能”。**一是要有一技之长。**一个厅局百八十人，一个市里面处级干部也上百人，凭什么提拔你？每一个人都觉得我自己应该提拔，而且每一个人的习惯都是自己看自己比别人看自己的估计要高，总觉得自己很好。但在人家眼里不是这样的，人家觉得其他人比你还好。所以你到底有何德能，就要有能够展现你特长的能力，不要做油条干部。 我在北大读博士的时候，有一次上肖灼基老师课，他问我为什么来读博士？大家都说在国家计委挺好的，为什么来读博士呢？后来我就跟他说，在国家计委工作十多年，我体会到一个问题，就是很容易蒙混过关。 比如说，我不懂农业，我确实也不懂农业，但是混成“油条”了，很容易蒙混过关，办法是什么呢？你给黑龙江省发改委发函，说国家发改委王处长要来调研农业问题，请你们准备农业的情况、问题、建议形成书面材料，然后开座谈会。你去了，人家就说国家发改委处长来了，坐一屋子人，跟你汇报。黑龙江省农业现状是什么，情况是什么，问题是什么，政策是什么，跟你讲。你啥都不懂，就跟他说最近锦涛说了什么，家宝说了什么，你没提他姓，人家不知道以为你们很熟呢。然后你又给吉林省发函，国家发改委王处长要来调研农业问题，请你们准备书面材料。你到那里，他说的还是这些问题。你就用黑龙江讲的那些问题跟他们聊。然后你再给辽宁省发个函，到辽宁你就不用他们讲了，你拿黑龙江和吉林省听到那些问题问辽宁人，辽宁人被你问得一愣一愣的，对你佩服的不得了。但是，农业到底在国民经济中是什么位置，我们到底怎么来发展农业却心中一片空白。所以说我们不能当这种油条干部。自治区厅局的处长到市里面我们都高度重视，认认真真跟你汇报。你不能老拿玉林、百色的问题问北海。 所以不能当油条干部。你一定要认识到自己的真能在哪里，哪种是假能，你所在的单位给你赋予的一个光环，那个能是假的，你沾沾自喜那个光环，以为是真能，那就完了。 二是接受任务独立完成，不要反复请示。其实请示是对的，但是有的时候请示也有毛病。比如说，交给你一个任务，让你去搞个现代农业示范区，一会你就回来请示，我想引进几个企业，问书记市长行不行，你说行我就这么干了。一会又请示搞了广告行不行，你说行我就这么干。这个表现让人觉得你能力差。就像打仗现在叫你把那山头拿下来，你就把它拿下来。你不要说司令员，前面有条河，我想架个桥，你看行不行，行我就架个桥。前面有个小树林，我在里面隐蔽前移，你看行不行，行我就这么干。不要搞这个事。叫你把山头拿下来，剩下怎么干，怎么能把山头拿下来就怎么干，这是你的能的体现。请示报告是对的，但不是这么细细碎碎反复请示。特别是处长、县区长，一定要注意。 三是接到任务后不要再去分包。领导说了哪个处长把我们今年全年的工作写个年终总结。你这个处长拿到任务以后就去做方案了，列了目录，列了几个大的方面，全年以来的政治工作情况由厅长负责，今年的开放方面由张副厅长负责，今年的项目方面由李副厅长负责，你们都给我提供一些素材，完了我把它们凑起来，组织一帮人，在一个饭店，写两天。不是这么弄的。这个任务交给你了，你把它写完，不要再去二批发，让人觉得你能力差。 四是要有自我反思的能力。就是看到别人好的地方，马上反思到自己，变成自己好的地方。看到别人差的东西，你马上反思到自己，有没有不对劲的地方，要马上改掉。广西话把这叫“灵醒”，这个一定要有，这是一个能力。好多人很迟钝，人家反复敲他，说哪有毛病，还是改不了。所以要有自我反思的能力。你看到哪个处的处长为什么老是干得好，你要马上研究明白。还有哪个处为什么老是做错事，你要赶快借鉴。这种反思的能力非常重要。 五是要有自我规划的能力。选调生都怀揣着一腔报国热情，那你的一生将来的发展是怎么想的，也要有一个自我规划。你在五年内怎么样？十年内怎么样？十五年内怎么样？为了这个目标应该做哪些准备和积累，要有自我规划的能力。这实际上也是人生的一种设计，这个设计清楚了以后你就不会迷茫，不会说看有人到公司去了，一年年薪拿个三四十万，你就羡慕、心慌。一看别人怎么又提拔了，你又心慌。你设计好了你的路径就踏踏实实去往下干，不能盲头乱撞，不要凭命由天。你要把个人的理想和国家的发展和自治区的发展和你们单位的发展结合起来，这样才有更顺畅的发展。 第三个字是“勤”。刚才讲了为什么十年以后二十年以后，同一年来的变化就大了呢。实际上很大的方面就取决于下苦工，你的苦功夫到不到，你的勤奋够不够。勤奋决定一生。 有很多例子，我以前在参考消息上看到一篇文章写前商务部副部长、中国WTO谈判的首席代表龙永图。文章介绍文化大革命之前，中联部想要进大学生，因为中联部是负责对外联络的，就想要找根红苗正的人，后来就找到最贫困的省——贵州，在贵州师范大学找学习好的，根红苗正的，就把龙永图给要到了中联部。到那以后，龙永图天天在办公室里加班。每天自己定任务把参考消息上的两篇中文文章翻成英文，再把英文翻成中文，再和参考消息上的原文对照，看看有哪不对，天天这么干。后来有一天晚上，美国驻中国大使紧急约见中联部部长方毅，但是翻译已经下班回家了。当时家里面也没有电话，再找那个翻译来的话又来不及。后来人家就说，楼上有个新来的大学生叫龙永图，天天晚上在那里看书，不行把他叫来得了。后来就把他叫过来翻译，结果一翻特别好。后来方毅就很重视他，把他送到伦敦经济学院去学习，学完回来后又去美国南部学习，后来又到了商务部。你说要是那个时候把龙永图叫来一翻，翻得乱七八糟，那这一辈子可能就没什么太大机会了。 所以说什么叫机会总是光顾有准备的人。后来有一年我在商务厅的时候，龙永图部长来参加中国东盟博览会，我请他吃饭的时候就问他这段是不是这样的。他说是这样，当时翻译是分层级的，谁给处长翻译，谁给司长翻译，谁给部长翻译都是分级别的。新来的大学生你只能给处长翻，都没资格给司长当翻译，他说那轮的话肯定轮不到我。然后他还讲了一个故事，他说这辈子两次翻译改变了他的命运。他从美国回来就从中联部调到了商务部，是在国际合作司任副司长。那时候一出差到哪个省去，下了飞机，一起去的有实权的司的人就被直接用车接走去吃饭了，没权的没有人理，就只能回饭店看书学习。这倒好，他说有时间看书学习，心也静。后来李岚清调到商务部当部长，当时中国要恢复关贸总协定。关贸总协定的总干事是美国的南部人，说话口音重没人能听懂，就像夹壮似的，谁也听不懂。李岚清要见他，外事司的司长担心李部长刚从天津调来，万一翻译听不懂美国南方话翻错了影响工作，就请龙永图帮忙出面去翻。因为他在中联部的时候到美国南部学习了五六年，那些土话他全都翻的特别好。翻译完了以后，李岚清就问他是哪个司的。结果过一两个月人事司就通知他到世贸司当副司长，后来当司长，再后来就当了世贸谈判总代表。说龙永图这个例子就是说，勤，是你这一辈子能够顺利发展的最重要保障。机会总是光顾有准备的人。 勤是立身之本。要养成终身读书的习惯，要对自己狠一点。知识就是力量。你要真正想要有发展的力量，有竞争力，有对工作的贡献力，就去勤奋地丰富自己的知识和能力。当年曾国藩在清朝里面的八个部当过六个部的正部长，靠的就是勤奋。他年轻的时候老自己反思，给他弟弟写信中说，我这一辈子一事无成，总立志也坚持不了，但是从现在开始我立志，每天晚上睡觉之前读史十页，练二百个字。一生坚持下来了。后来他跟他那几个理学大师朋友们聊完天以后，又立志每天记日记，把自己的思想，行动都记录下来，一辈子也没停。后来皇上听说了，就说你拿几本来我看看。就是对自己非常的狠。前段我在书店里买了一本书《毛泽东在七大上的讲话汇编》，就是1945年中共七大在延安召开，毛泽东在七大上的几次讲话和报告，《愚公移山》就是那几次会议上的闭幕词。毛泽东在七大的那些讲话，主报告是《论联合政府》，是毛泽东写的。他在七大里面脱稿，做《论联合政府》的说明。把建国以后我们的农业问题、工业问题、外交问题、教育问题、党建问题、统一战线问题，十三四个问题全部讲清楚了。我算了一下毛泽东当年多少岁，刚52岁。人家那个知识的厚重，所以毛泽东为什么叫“伟大导师”，为什么能够带领中国革命一步一步走过来，都是知识的胜利。所以要勤奋学习，特别是我们这些选调生们，博士、硕士，“985”的，停止了看书，停止了学习，你就停止了进步。二是要写文章。“文章报国、诗书传家”。文章是你最好的介绍人，是你不用求任何人的东西。 现在这个风清气正的大环境，我们这些读书人，不要老想着求人，不要老想着走邪门歪道，就是靠自己。靠自己靠什么？就是靠你的知识，靠你的眼光，靠你的本事。你的本事在哪里体现，一方面是干事能力，一方面就是写文章。写文章越到底下的时候就越有非议，好多人他写不出来文章，他一看你写文章就嫉妒你，说你又不是研究院你写什么文章。还有的说写什么文章啊，干就是了。干是没问题的，粗活靠猛打猛冲可以干，但越是复杂的，关系重大的工作，越没那么简单。就好像一个人脑子里长瘤了要给他开刀，你说搞什么研究啊，打开摘出来不就完了么。我问你脑子里的结构是什么样的，血管怎么走的，你了解么？你研究过么？只有对大脑有长期深入的理论实践研究才可能有成功的把握。越是前沿的、繁杂的事越不是仅凭热情和愿望就能搞成的。我们现在的三农问题，乡村振兴战略问题，最近开的工业化高质量发展大会，产业怎么发展，城市怎么发展，对外开放怎么搞，南向通道怎样才能够给广西带来最大利益，你没有研究怎么干？写文章的这个过程，更重要的是要深入的研究思考，目的是为了在更高的层次上，更宽的视野和更透彻的理论实践上推动具体工作。所以，我们这些选调生，博士、硕士，一定要有清醒的认识，实际工作一定要干好，同时把实际工作上升到理论，在用理论指导更加理性地做好实际工作，如果没有这条，你就没有大的后劲，也不能说明你行。 第四个字是“廉”。廉就是我们要活的有品位，要活的有品格。选调生，博士、硕士，一定要‍‍品格高洁。过去说有不良行为的“六过”：爱好过俗，交友过滥，‍‍生活过奢，‍‍私事过多，‍‍口气过大，读书过少，‍‍这“六过”‍‍毛病‍‍就一定要杜绝。‍‍不要交那些烂朋友，‍‍不要有那些低俗的爱好。‍‍把人生的‍‍第一个扣子扣好，‍‍同时要顶得住生活的压力。‍‍处长也好，‍‍还没到处长的也好，年轻人也好，‍‍生活压力都比较大。‍‍机关里面工资收入确实太低了，你现在又是上有老下有小，‍‍没准还得生个二胎，‍‍生活压力很大。‍‍这个时候一定要顶得住。‍‍好人和坏人就一念之差。‍‍‍‍好干部和‍‍贪污犯就一念之差。‍‍有人来给你送卡，就200块钱、500块钱，正好家里的小孩的‍‍奶粉没了，‍‍弄200块钱、500块钱，买两桶进口奶粉正好，就收了。‍‍收了就出事了，出事你就完了。‍‍好多时候，实际就是一念之差。你在那个时候一定要顶住。‍‍脑子里要有一个钟在那，关键时刻它得报警一下，激灵一下你得回来。顶住压力，抵住诱惑，‍‍顶住那个关键时刻。‍‍在你想要收钱，‍‍想要收物的那一刻，‍‍你停下来，‍‍你就过关了。那个时候一大意你就完了。说这么多大道理没用，‍‍你就记住，关键时刻一定要顶住。时刻都要守住廉洁的底线，守住政治底线，守住生活作风的底线。把底线守住，这样保证一生平平安安。穷是穷点，苦是苦点，但是我们就为了一腔报国热情，就这么平平淡淡，艰苦奋斗，为国家，为人民，为社会，选择了这条路就得无怨无悔。使我们能够不辜负党的教育，不辜负国家的培养，不辜负亲人的希望。做好工作，过好一生。 我就说这么多，‍‍有不对的地方，请大家批评指正。谢谢大家。 来源：广西发展战略研究会，有删节","link":"/2019/11/24/other/高学历青年干部容易进入的的10个误区/"},{"title":"LaTeX 相关","text":"content{:toc}keynote上使用LaTeX公式 macOS上的keynote对公式的支持很差，而且暂时不支持LaTeX，为了在keynote上使用LaTeX公式，采用以下办法：安装LaTeXiT。 如果你的电脑上之前没有装过LaTeX全家桶，那么当你打开LaTeXiT之后会提示没有安装pdflatex、ghostscript之类的相关LaTeX包，执行以下操作之一： 安装MacTex（3G左右大小），一步到位，所有包全部安装好，缺点是太大。 安装BasicTex+ghostscript 安装基础版本的BasicTex（100M左右大小） 使用命令行brew工具安装ghostscript： 1brew install ghostscript 然后，就可以愉快地使用LaTeXiT了，enjoy。 更新：20190228 从去年某个版本开始，keynote以及其他iWork组件已经支持LaTeX了，无需再用此方法。基本常用的LaTeX语法都支持，可以参考apple官网给出的示例：中文链接 &amp; 英文链接。 在该博客中使用数学公式在hexo博客中使用数学公式时，不能像在Typora等Markdown公式中一样方便。参考https://blog.zhangruipeng.me/hexo-theme-minos/Writing-Math-Formulas-Using-MathJax/ 。 需要写成MathJax格式的。简而言之，如果要在行内添加公式，需要在公式前加\\\\(，公式后加\\\\)写成： 1\\\\( y = \\sum_&#123;t=1&#125;^T x_t \\\\) 这样显示效果为\\(y = \\sum_{t=1}^T x_t\\)。 单独成行的公式，需要在前后各加$$写成： 1$$ y = \\sum_t=1^T x_t $$ 显示效果为$$ y = \\sum_{t=1}^T x_t $$。","link":"/2019/06/06/tool/2018-03-01-latex/"},{"title":"畸形房地产与楼市","text":"content{:toc} 这是一篇昨天在微信公众号“A股那点事”上看到的文章，今天再去看，已经被404了，还好，手机浏览器里有缓存，复制过来。这篇文章清晰地还原了中国近些年的畸形房地产市场，值得一看。 昨天，刘鹤抵达美国开始新一轮贸易战谈判，国内高层放出消息：楼市泡沫要慢撒气，你想慢撒气，人家想快刺破，美元涨，原油升，不加息就通胀，加息就破裂。左右为难就要频繁调控，我们的调控密集的就像复仇者联盟的英雄，花样百出、目不衔接，但特朗普会是那个打响指的灭霸吗？ ■ 文 | 奶包的大叔 2018刚刚进入5月，全国各地发布的调控政策数量就已经超过了115个。仅4月份一个月，全国各种房地产调控政策合计就多达33次，25个城市与部门发布调控政策，其中海南、北京、杭州等城市发布了多次房地产相关新政策。 为何要如此恐慌式的密集调控呢？因为一个残酷的现实：我们正在用全世界绝无仅有的方式来对抗经济规律。 这样对抗的后果是显而易见的：一旦失败，房地产的崩溃将直接导致中国泡沫经济的崩溃；一旦成功，全人类的经济学教材都将重新改写，包括《资本论》。 从目前看，这种对抗依然没有分出胜负。 一个无法回避的问题是：我们是如何走到这种命悬一线、无法自拔的境地的呢？ 因为人类经济发展的定律：所有的经济问题都可以归结为债务问题。从宏观来看，债务问题体现在国民经济的三大部门：政府、企业、居民。其中，政府和企业部门的债务和杠杆率多年来一直都居高不下，处于高危崩溃的边缘。正是为了降低这两个部门的债务和杠杆率，才出现了上一波的加杠杆和现在这一波去杠杆的迫切需要。加谁的杠杆？加居民的杠杆。去谁的杠杆？去政府和国企的杠杆。这是一个规模宏大的债务转移过程，实现方式具有极强的中国特色（其他国家无法复制）： 拉高房地产，政府涨地价，国企控盘—&gt;银行定向放水，居民贷款，居民债务和杠杆率增加—&gt;抬高房价，棚改货币化，实施政策组合拳—&gt;天量资金进入房地产，套入后宣布5年限售令，冻结流动性—&gt;政府和国企完成去杠杆任务，楼市流通盘消失，百万亿资金被锁定—&gt;货币超发问题被进一步拖缓。 为什么会提到货币超发问题呢？这又涉及到了汇率和房价的经典问题：保汇率？还是保房价？由于中国庞大的经济体量，几乎决定了失去汇率和房价中的任何一个都会导致灾难性的后果，因此，保汇率还是保房价这个经典问题就变成了既要…又要…的特色问题。 很明显，通过印钞票是无法解决这个问题的，委内瑞拉就是活生生的例子。外汇储备是汇率的基础，也是人民币的货币之锚。唯一（可能）有效的方法，只有外汇管制。然而，在2016～2017的人民币贬值、资金外逃狂潮中，中国的外汇储备从4万亿跌破了3万亿关口；随后在强力的外汇管制和一波媲美于好莱坞大片式的操作下，才扭转了人民币贬值的预期。但这一次的外汇管制，却没有像过去那样成为起死回生的灵丹妙药：虽然人民币对美元的汇率从6.9回升到了6.25，但中国的外汇储备却只回升了不到2000亿美元，而且还增加了2984亿美元的外债，再加上约3000亿美金的贸易顺差。而目前3.12万亿美元的外汇储备中，外债水平已经达到了约1.8万亿，也就是说，实际上能够用的外汇储备也就一万亿。现在，随着美元开启了新一轮的升值周期，人民币汇率也开始了七连跌，刚刚公布的4月份外汇储备比上个月减少了180亿美元。在这一波美元的升值过程中，如果人民币汇率不能维持在6.6以上，那么汇率贬值的预期将再度回来，而这个时候，我们已经没有多少弹药可以用了。 阿根廷的悲剧已经为我们敲响了警钟，而在另一方面，为了防止房价崩盘，体量庞大的房地产市场却需要百万亿级的资金来维持。然而偏偏在这时，贸易战爆发了。 于是在外贸、投资、内需这三驾马车中，只剩下内需这一条路了，这也就是为什么新闻上天天高喊内需升级的原因。然而颇具讽刺意味的是，房地产作为最大的内需，却挤占了几乎全部其他的内需消费空间，这时提升内需几乎成为了提升房地产的代名词。因此，才会出现许多怪诞的情景：博鳌论坛上央行刚刚表示了要进入紧缩周期，但却在10天之后宣布了降准；连高层都一再强调了房住不炒，樊纲却提出了六个钱包。 如此矛盾重重的政策背后，不仅仅反映的是贸易战的残酷，还暴露出了更大的风险：经济规律的惩罚，从来不会因个人意志而消失。 对于一个健康的经济体来说，房产本来是不应该出现在其金融交易市场中的，然而，在房产被赋予了金融属性之后，便开始对整个金融系统产生了不可估量的巨大能量。而在这个叫做地球的星球上，只有三个国家尝试过这种毁天灭地的巨大能量：世界经济排名前三的经济体——美国、中国、日本。（事实上，许多小国也尝试过，但是由于经济体量太小，在世界范围内造成的影响有限。） 美国的次贷危机和日本消失的二十年，让地球人终于深刻的体会到了这种堪比灭霸的能量所具有的毁灭能力。而现在，所有人都在担心中国现在的这个超级泡沫，究竟会给世界经济带来什么样的后遗症。 在中国，除了房市，只有汇市和债市，才有这种毁天灭地的能量。 先说汇市，由于外汇市场的开放性（一种货币相对于另一种货币的汇率通常以显式的方式来表示：双方都同意的交换关系），因此外汇市场的交易量超过了其它所有金融交易的总和。比如，每天全球有价证券市场的交易量大约为3000亿美元，而每天外汇交易量将近6万亿美元。 因此一个国家或经济体的货币汇率往往决定了它的生死存亡。 值得指出的是，在这一波人民币汇率大幅波动的背后，不止是只有中国在悄悄的操作和严防外汇外逃，美国也（一直）在进行更严密更致命的战略部署：当贸易战第一回合制裁中兴成功之后，美国完全掌握了主动权，但是美元指数却不升反降，逼迫人民币被动升值。而在美国贸易代表团来北京谈判的前几天，美元指数却突然转向开始升值。这种看似反常的异常操作手法，其中的战略布局其实从2016～2017就早已开始了，汇率和贸易战的深度结合、立体作战，配合美联储的缩表、加息，每一步看似简单平淡的操作，背后其实都暗藏了杀机。 而从贸易战现有的战况来看，形势非常不容乐观。当特朗普打响贸易战第一枪时，举国沸腾，就连商务部的官员和经济学家都在强调大豆、汽车，然而，当美国发出针对中兴的制裁令之后，官员和经济学家几乎都闭嘴了，只剩下民族斗士们继续在沸腾。这时，人们才渐渐领悟到看似整天拉仇恨、天天发推特的总统，其实有着更加精明和长远的战略布局。而通过贸易战中美元指数的战略操控，逼迫人民币汇率先升后降，尤其是现在美元指数的突然提升，这其中所蕴藏的巨大杀伤力，却在举国沸腾的争辩声中被淹没和无视了，很少有人真正认识到人民币汇率后面即将到来的更大危机。 一个耐人寻味的事实是，当美国代表团来中国进行第一回合谈判之后，我们却无法得知谈判的真正内容，只有在英国《金融时报》报道了美方提供的内容之后，我们才知道真正的结果其实是谈崩了；随后，媒体才发出了美方开价太高的报道。而第一回合的谈判结果却在显现：开放进口汽车市场、开放保险市场，连一直被禁止的高通-大唐合资案，也被光速通过了。嘴上喊着绝不低头，身体却真的很诚实。 再来说债市，应该说，中国的地方政府性债务（简称地方债）危机，是这一波去杠杆的直接导火索。早在2014年，中国的地方债就已突破24万亿，其规模已经超过了德国GDP。而现在，包括地方政府债和城投债在内，中国债市总量已达到了76.01万亿元，其中地方债务的规模已达22.22万亿。 更为严重的问题是地方政府的隐性债务。尤其是最近三年，地方政府借由PPP、政府购买服务、政府投资基金等方式形成了不少隐性债务，其体量已经超过甚至数倍于显性债务。不断快速膨胀的地方债让所有人都不寒而栗，2016年10月国务院发布《地方政府性债务风险应急处置预案》称：“地方政府对其举债的债务负有偿还责任，中央实行不救助原则。” 这也是建国以来的首次中央不拖底政策，没有了中央的信用担保，地方政府对卖地经济的依赖进入了更严重的恶性循环。于是近年来各个省市的卖地收入不断攀升，而火爆的卖地收入与黑洞般的地方政府债务相比，却依然显得苍白无力。事实上，从2017中央财政收入的角度来看，在全国36个省市（港澳台除外）中，仅仅只有6个省市是财政盈余，盈余总额约为3万亿，而其他31个省市的财政亏损总额则突破了5万亿；这其中的财政缺口已高达2万亿。 在长期连续疯长之后，目前的地方债规模已经达到了非常危险的22万亿之巨。2018年3月财政部在《关于做好2018年地方政府债务管理工作的通知》中设置了地方债总额天花板，2018年限额约为21万亿。4月，以新疆为代表的多个省市的PPP项目被叫停。第一枪，似乎已经打响了。 还有一类负债率也颇具深意。在所有一级行业中，负债率第一的是银行，第二的是非银金融，那么负债率第三的行业呢？是房地产。截止2018年4月，房地产公司的整体负债率已达79%，创下近十三年来新高；其中近20家公司资产负债率超过85%，而万科84%的负债率也创下该公司的历史新高。其实，面对目前已经涨得连亲妈都不认识了的高房价，房地产商也很焦灼，尤其是在恒大、万达的海外投资事件之后，在杀猴王骇猴式的强监管之下，资产转移的路径被严重限制。而这些高负债率的人民币资产，面临着随时被清盘的风险。 这里扯远一点，说一下目前楼市的几个乱象和真相。 2018的房地产市场，可以说是乱象环生，很多奇观甚至可以让《资本论》中有关生产关系、生产资源配置、市场价格等内容统统失效，如果作者能穿越时空到现在，恐怕很多内容都要重写。 2018年，限购、排队、摇号、上调贷款利率、抢人大战等等一连串看似混乱的景象，其实都是在传递着一个清晰的信号：市场禁入。 这个信号来自于最高层，充满了呵护和善意：现在的房地产市场，只许进，不许出。 为什么？因为目前的风险经过连续不断的积累，已经变得极不稳定和高度危险。 1、“中国地产难民事件” 2018年4月22日21点，对于海南乃至整个中国二十年的楼市来说，都是一个历史性时刻：海南出台了针对全省的限购条例，号称可以秒杀之前所有调控：非本省户籍五年社保、首付七成、限售五年。瞬间，7000亿炒房资金被套。同时，海南全省的房产经纪人纷纷准备迁徙去北海和云南，史称中国地产行业难民事件。这个明明要做国际自由贸易港的“中国的佛罗里达”，却不能自由买卖房子；自由？贸易？不存在的。那确定还能叫国际自由贸易港么？用海南省长的话说就是壮士断腕，用股市专家的话说就是打消流通盘。 2、95%的人无法套现离场 十六年来，北上广深的房价涨了20倍，但全国的GDP上涨了只有不到7倍。目前中国的楼市总市值已经超过了430万亿，是GDP的5倍（超过全球平均值的一倍），是广义货币供应量M2的2.5倍，是储备货币的15倍，是货币发行的45倍。毫不夸张的说，卖掉北上广深四大城市，差不多能买下美国。如此高的总市值，一旦有炒房人和早期的投资客套现离场，那么整个房地产立马就会崩溃：430万亿总市值，哪怕只有5%的抛售离场，那就是21.5万亿的资金流出，几乎相当于我们所有的外汇储备。这就是新闻中密集出现的字眼，严防金融系统性风险出现。如何严防呢？直接冻结流动性，只许进，不许出。 在股市中，没有卖出去的价格永远都不叫真正的盈利，而房产的套现比股票更难。你确定你能够成为那5%套现离场的吗？ 3、房产税是真的大杀器 房产税，这个一致被评为中国房价的终极大杀器，却一直处于纸上谈兵的状态。为什么呢？因为它真的是个大杀器——在杀掉高房价之前，可能连一些人都被杀了。 一个可以参考的例子是韩国。从卢武铉2005 年制定了《综合不动产税法》开始，韩国政府用了5年时间、先后将三位前总统送进了监狱。尽管如此，此举依然引来了富人的愤怒，并最终导致卢武铉的左派在首都圈被弃。随后，经过李明博右派路线，直至2017 年的文在寅（曾在卢武铉手下担任青瓦台秘书室长），韩国的执政路线才重回左派。而文在寅的“8·2 房地产新政”，直接规定对第二套房的交易征税至 50%，而第三套房的交易可征至 60%。如此强悍的房产调控政策，也让韩剧中看似天价的首尔地区房价还不到北京的三分之一。 同样是在东亚，同样是房产调控，但房价下降的却是别人家的房价。那么，如此血腥的房产税或调控政策就真的无法在中国实现么？非也。中国确实出台过一剑封喉的房产税，但那是在66年前——1948～1949年新中国成立的前夜，当时14%的高额房产税都无法压制房价的暴涨。于是在1952年，中国国土建设部直接出台了征收房产交易利得税200%的核武器，瞬间打爆了爆炒房价的投机商，成功平抑了房价。所以，历史教会了我们，戒急用忍，其实都是有原因的。 4、430万亿市值的宇宙最高房价，能毁掉什么。 工行董事长在最近演讲时表示，2010～2017年的居民储蓄存款增长与可支配收入之比从25.4%下降至12.7%，降幅达到了一倍；而与此同时，居民家庭债务占GDP的比重已升至49%，几乎占了GDP的一半。这意味着什么呢？意味着空心化。 这种空心化不仅仅体现在实体经济的倒闭潮、外资企业的撤离外逃上，而且还实实在在的发生在每个中国人的心里：这样的生活到底为何？ 佛性生活？低生育？就连一线城市中许多人也只能住着一千万的房子过着穷日子，号称中产杀手的学区房能够轻松掏空一个中产家庭的钱包。严重的焦虑感让许多奋斗青年都戒掉了梦想。那么，国贸双井和徐家汇这些地段的房价是如何从一百多万涨到几千万的呢？ 5、房价就成了一个不折不扣的金融游戏 5月刚刚出台的史上最严资管新政，其实可以很好的演示房地产的原罪。对于目前高达100万亿的资管通道，其主要流向只有三个：股市、债市、房地产。这时，股市第一个站出来说这个锅坚决不背，为什么？看看现在还在痛苦磨底中的A股就知道了，毫无任何量能可言，所以很明显，没有太多新增资金流入股市。债市更惨，被严打的几乎都要产生危机了，大幅流入资金根本不可能。这时，房地产低头不语，过了许久才用闪着泪光的决定说到：怪我咯？ 简单来说，房价上涨的金融游戏是这样： 居民通过存款、购买理财将钱交给银行和机构—&gt;银行和机构将钱贷给房产商—&gt;房产商拿到资金后高价买地—&gt;房产商将产品高价卖给居民—&gt;更多的资金通过资管通道流入—&gt;房产商拿到更多的贷款—&gt;政府以更高的地价拍卖给房产商—&gt;房产商以更高的房价卖给居民 在这个正向循环的金融链条中，可以很清楚的看出羊毛出在谁身上。那么，这种拿你手里的钱变成混凝土砖块再翻倍高价卖给你的游戏应该叫什么呢？房产货币化？庞氏骗局？抢钱？不，这种政治不正确的说法我们不能用。但国进民退的进程却是实实在在的发生着，而且日益恶化。 6、资管新规对楼市的影响 不要小看5月资管新规，它很可能会进一步加快房地产市场的集中化，提升龙头房地产企业的估值。然而，这种操作手法是否存在风险呢？有可能。 如果在资管新规的贯彻执行过程中，不小心发生了连锁反应、刺破了债务泡沫，那么整个货币体系将面临大幅收缩。在这种极端情况下，所有的资产短期都会下跌，包括房地产。也就是说，一旦资管新规玩砸了，那么在关键时刻出来托底的大招就是债务货币化（中国版QE）了；而一旦选择这个货币化的大招，那么到时候的人民币也就不是现在的人民币了。 如果要用一个词来形容2018年的房地产，那就是“用时间换空间”。直白一点说，就是尽量拖。这也是所有出台政策的最终指向。那么，我们是否有足够的时间来化解这个体量庞大的超级泡沫呢？是否会有外力的因素突然刺破这个泡沫呢？ 远在大洋另一边的特朗普，笑而不语。作为全世界唯一享受“睡后收入”的领导人，不走寻常路的特朗普可以说是颠覆了所有人的三观，在中国外交的国际政治人物模型里，根本没有这一款型号能够与之对应。 特朗普甚至改变了美国驴象双方的传统：历史上向来是民主党的总统负责搞经济赚钱，共和党的总统则经常搞事情到处打仗花钱，然后没钱了之后继续让民主党上台赚钱。5月10日，美国国会预算办公室表示，美国4月创下史上最大月度预算盈余2140亿美元，创1968年有纪录以来新高。同时，失业率也自2000年以来首次下降至4％以下。因此，特朗普的民调支持率连连上升也就并不意外了。由此引申出的一个问题是：自从特朗普宣布和中国的贸易战那一刻开始，那些被我们当做筹码的大豆、汽车、票仓之类的问题，根本就不是特朗普考虑的核心问题，也就是说，特朗普所操作的，是一盘更大更深远的棋局。 而我们对这位整天发推特、到处拉仇恨的总统，又了解多少呢？颠覆传统的特朗普，可以说是超出了所有人的经验。伟大领袖曾告诫我们：经验主义害死人啊。 在这次贸易战中，为什么中国以往买买买的经验模式失效了呢？因为美国发出了一个非常严肃信号：reciprocal。中国的翻译是“互惠”，美国的本意是“对等”。为了不让中国会错意，特朗普还特意说出了mirror（镜像）这个词，可谓用心良苦。在第一回合的谈判中，美国直接提出了开放金融服务业市场准入这样触及底线的要求。为什么呢？因为他知道你不会答应。为什么一水鹰派的美国代表团敢于提出这种要求呢？因为他知道你的软肋（远远）不止中兴一个。事实上，美国提出的要求是在关税、市场准入、知识产权等问题上的全面对等。其中，一个有趣的要求是，美国还提出了关于互联网全面开放的要求，真的是极具喜剧效果。 现实的来说，如果没有美国高科技和知识产权的交流与帮助，中国的产业升级和2025规划是很难实现的。那么，中国的筹码是什么呢？抛开无足轻重的不说（中国出口的绝大部分产品都有替代品，而且损失并非不可接受），我们最重要的核心筹码其实是我们自己：中国将是未来全球最大的消费升级市场。这个市场容量是美国无法割舍的。 然而，最令人痛心的是，这个消费升级的市场却面临着一个刻不容缓的难题：房地产。 一边是内需消费极度萎缩，急需化解房地产的超级泡沫；一边是用时间换空间，尽量拖延房地产泡沫的破灭。对这个核心问题的时机选择和把握，特朗普可谓是稳准狠；估计连美国人自己都没想到，很多中国的热血青年竟然将房价下跌的愿望寄托在一位美国总统身上。 作为货币超发资金池的房地产，过去十年，美国的货币发行量增加了2倍，而中国的货币发行量增加了20倍。如果没有房地产这个资金池，我们的通货膨胀会不堪设想。马云说，8年之后房子如葱。这个预言全国人民都不敢相信，What？8年之后买根葱会和买套房一样贵？ 如果泡沫破灭，天量超发货币将导致严重的通货膨胀，马云的预言就会变成另一个版本的残酷现实。 只有壮士断腕般的舍弃房地产经济，才有可能重生。就像上帝给你关上一道门的时候，一定会为你打开一扇窗。然而，为什么我们现在还没有越过这扇窗呢？因为不断超发的天量货币已经让中国经济成为了一个体量庞大的虚胖儿，卡住了。 美国发动贸易战的攻击目标，正是这个胖子。如果说第一回合中美国使用的常规武器是中兴事件的话，那么在第二回合中，美国已经开始动用战略武器了。这个武器是什么呢？是石油。 5月8日，特朗普在白宫宣布美国将退出伊朗核协议，并对伊朗实施严厉制裁。聪明的你一定看出了这其中的奥秘。是的，伊朗正是中兴事件的发源地，而这一次，特朗普更是直接提出了威胁：任何与伊朗有商业往来的银行和企业未能在规定期限内（3～6个月）解除与伊朗的业务关联，都将遭到美国制裁。很快，法国石油巨头道达尔就提出了或将撤离伊朗南帕尔斯天然气田项目，而这一总价约48亿欧元的项目是欧洲财团对伊朗最大规模的投资。这也说明了欧洲既无决心、也没有气力去阻止美国制裁伊朗。那么，欧洲人退出之后，谁将接手这个项目呢？中石油。 中国是伊朗原油最大的买家，伊朗是中国第六大石油供应国，其石油出口的三分之一卖给了中国。 大家不要认为油价升高只会影响开车加油的费用，石油是工业生产和食品加工等行业的重要原料，由此它会带动许许多多相关商品的涨价，这种涨价最终会反映在商品的零售价格和生活必需品上，消费者会因此多付出很多成本，这就是输入性通货膨胀。 2007年，原油价格最高涨到了每桶147美元，结果就是造成了国内严重的通货膨胀，物价大幅上涨，严重影响了居民生活水平和国内经济的发展；为了对冲这一波通货膨胀，当时央行动用了6次加息和连续上调存款准备金的严厉方式。然而，也正是央行这一波操作对房地产市场也产生了立竿见影的效果：当时的房地产行业大面积停摆，房价直线向下，像上海当时的房价连续十几个月下跌，最高跌幅高达35%，新闻上基本上都用崩盘来形容当时的市场。 通过这个依然历历在目的历史回顾，我们可以看出两点：一是降房价并非传说中的绝不可能，而是要看是否真心愿意去降。二是原油价格上涨的输入性通胀具有极强的杀伤力，如果这次特朗普的伊朗战略使油价上涨到每桶80美元以上，那么到时候就不止是房价下跌的问题了，童鞋们可能要先准备点别的了。 讨论贸易战走向何方还为时尚早，但短时间内能改变中国楼市的，好像也只有特朗普了，只是不知道结局到底时好时坏。","link":"/2019/06/06/other/2018-05-19-畸形房地产楼市/"},{"title":"为何经济到了关键当口，总是做出较差的选择？","text":"content{:toc}转载自微信公众号中产先生 文章开头先说明，这是一篇马后炮的文章，源于梳理这十年来的经济政策，从4万亿到新常态，从供给侧到放水重启楼市，不禁唏嘘，这十年，每次到了关键选择的当口，我们似乎总是做出现在看起来较差的选择。 2008-2013：四万亿的功与过时间回到十年前，太平洋另一边的美国爆发了“次贷危机”，继而扩散到全世界。彼时的中国已经不是98年的中国，我们已经加入WTO整整7年，封闭的国门已经被打开了一大半，自然免不了受到金融危机的影响。 2008年，整个一年都是人心惶惶，大部分人应该都有切身体会，不像今天人人都充满“自信”。面对全球需求的萎缩，沿海工厂停工，数千万的农民工被迫返乡，海上的货轮顿时锐减，老板们忧心忡忡。从2008年下半年开始，中国出口急转直下，从年初的两位数增长迅速回落至负增长。 这种形式继续下去就是经济硬着陆和大规模失业潮，这是影响基本盘的大事，国家不得不出手。 于是，四万亿计划几乎和美国QE同时推出，但取得结果却不太相同，而且还取得了意外的结果。 1、首先是打开了货币阀门：刺激经济就需要印钞，大家不要以为四万亿很少，其实经过地方一级的扩大，到了2010年整个四万亿投放的货币总量大概是20万亿，虽然比起现在的放水速度不是很多，但在2008年，这确实是天量货币，毕竟08年很多人的工资还不到2000块。 美国QE之后，全球主要经济体都跟随放水，从上图看印钞的速度显然都比不上中国，以至于四万亿刺激出了一个好玩的事情，硬生生把美国的金融危机变成了自己的金融危机。为何？四万亿计划当时解决了国内企业资金问题，保证了能够把产品廉价地出口欧美，补贴了美国穷人，失业者，同时赚来的外汇又拿去买美国国债，缓解美国的危机。 四万亿下去，尽管受到金融危机的和全球经济萎缩的影响，但中国的工业生产总值在2007到2013年之间翻了两倍，而此时的美国是零增长，欧洲和日本分别是-9.3%和-17.1%，中国经济增长则对全球GDP增长贡献了50%。 就这样，我们不但印钞刺激了自己的经济，还意外扛起了世界经济复苏的大旗，这件事很长一段时间被我们当作成绩在国际上宣扬，但背后付出的代价谁又知道。 2、对基建特别是高铁和高速的拉动。四万亿其实和美国罗斯福计划没什么太大的区别，就是通过对基建和房地产的建设，拉动钢筋、水泥等周边产业的发展，让企业重新开工，工人继续就业，基建方面，特别是高铁和高速的发展，对于运输，甚至今天物流、电商的发展都起到了很好的推动作用。 3、负面作用更多。首先，刺激投错了地方，大多投向基建和房地产，拉动本来就过剩的产能更加过剩，而不是趁机升级产业，钢铁厂本来应该倒闭的，但是现在产能上去了，结果又建了很多；然后是国进民退，国企的大幅投资对民企产生挤出效应；地方政府开始大幅举债，拉动GDP成了地方政府的硬性指标，地方债务迅速增加；打开了楼市上涨的潘多拉魔盒，推动资产泡沫，创造了货币蓄水池理论，虽然没有通货膨胀，但是2011年确实有一波物价上涨。 总体来说，四万亿以及后来的20万亿，在当时看来是不得不为，但是在具体的刺激过程中，无疑是有很多诟病的地方。四万亿选择的是最容易刺激的基建和房地产，放水给地方政府和过剩产能，为了“保八争十”直接断送了中国经济转型（产业升级+出口转内需）的最佳时机，以至于造成的影响现在都没有完全消化，也提早让中国经济进入了新常态。 2013-2015: 供给侧的是与非从人口和经济结构来看，即便没有外部因素，中国经济也无法一直保持高速增长，换句话说，经济“新常态”的到来只是时间问题，四万亿把这个时间拉近了。 2013年中国领导层换届，2014年美国经济复苏退出QE，我们宣布经济进入新常态，2015年进一步提出“供给侧改革”。 如何理解供给侧改革，用一个简单的比喻：我们因为四万亿的刺激，造成了产能过剩，需求不足，如何平衡产需矛盾呢？资本主义是资本家倒掉自己的牛奶来平衡产需矛盾，供给侧是倒掉别人的牛奶来平衡供需矛盾。 供给侧让上游原材料涨价，于是中下游的产能落后的中小企业撑不住的就倒闭了，落后产能消灭了，国企也做大做强了，这就是供给侧。所以供给侧不是单纯的市场行为，有人把它称为“新计划经济”。 民企的落后产能要出清，新的动能先要补上，否则失去的就业和GDP怎么办？2015年，“双创”这个现在一地鸡毛的名词被当成了经济转型的“引擎”。 那是怎样一个名词辈出的年代，“大众创业”、“万众创新”、“互联网+”、“互联网金融”、“去库存”、“去杠杆”、“去产能”、“降成本”、“补短板”…… 围绕整个2015年的就是缺就业和缺钱。 就业就靠双创，大众卖房创业，大学生毕业创业，各地学校、政府风风火火的搞起了路演，领导站台政府出资，结果就像“上山下乡”，最后一地鸡毛。 企业缺钱就去股市，2015年新三板容易上，股市直冲6000点，没钱就去股市融资，结果最后股灾直接腰斩；个人缺钱找互联网金融，泛亚、钱宝、P2P、校园贷、裸贷…… 2015年开始的供给侧远没有结束，现在讨论是是非非还不到时候，但是从目前政策执行的情况来看，虽然淘汰了落后的民企产能，但是供给侧改革开启万亿PPP盛宴，也进一步加剧了国进民退。 另外，产能出清的同时进行的经济转型尝试大体失败，双创、互联网+、互联网金融最后都一地鸡毛，面对经济低迷和楼市高库存，2015年底我们再一次打开了货币水龙头，按下了重启房地产的按钮。 2015-2017：放水重启房地产2015年底，热点二线城市楼市迎来首付两成、降息降准的利好政策，2016年，政策扩大到更多城市，据说有的城市是不是沈阳，允许大学生零首付买房。 利好的政策下，房价迅速翻番，买房人挤满了售楼处，网上流传一副“中国版丧尸来了”形容抢房现场的疯狂。 二线炒起来还不够，三四五线炒不起来的城市怎么办？棚改，货币化安置，国开行撒钱，生生推高房价，刚需炒房客接盘，政府抓紧卖地，卖地的钱再还给银行，剩下的把债务也还掉一些，债务就这样置换了。 关于这次重启房地产，我说两个方面： 1、放水去杠杆、涨价去库存 这大概是只有中国才能做成的事，也是中国改变经济规律的一次勇敢尝试，从目前来看，实现的简直堪称完美。 通过**制造楼市上涨预期去掉库存，放水鼓励居民加杠杆，用居民30年信贷去掉地方政府和企业的杠杆，甚至2018年一季度，房地产开发还增长了34%，创三年新高，简直就是魔幻**。 2、如今拉动楼市不同于08年 如果说08年拉动楼市是为了带动相关产业和就业，那这一波拉动房地产就是赤裸裸的债务转移，炒房客还好一点，毕竟前几年确实赚到了真金白银，可怜的就是接盘的刚需，真的要为国背锅30年。 这一波房价翻番下来，基本透支了未来几年乃至十几年的消费能力，居民杠杆史无前例，三十年的财富通过六个钱包全都押在了房子上，经济转型，扩大内需，钱从哪里来？前几年说的消费升级只能是少部分人，大部分人现在是消费降级了。 2018年：再次站在关键当口四万亿刺激十年后，时间来到2018年，放水刺激的十年时间到底换来多少经济转型的空间呢？ 人口压力愈发严重、债务问题远未解决、居民杠杆已经没法再加、货币由大水漫灌变成定向滴水、楼市泡沫和汇率“双高”、资本外流压力大……内部问题虽有缓解，但是外部环境却更加严峻。 美国的贸易战显然没有停下来的意思，美元早就开启了新一轮剪羊毛进程，地缘政治也不稳定，属于中国转型最好的08年永远地过去了，那个时候美国自顾不暇，我们却朝气蓬勃。 在这个当口，我们不要再去尝试改变经济规律，也不要再做什么人定胜天的社会实验，虽然中国人多，即便我们已经是全球第二大经济体。 做个不那么差的选择吧，我是真心希望中国经济好。","link":"/2019/06/06/other/2018-05-29-四万亿的选择/"},{"title":"Python环境搭建","text":"安装省心的Anaconda最简单的安装方法是，直接下载exe安装Anaconda，则安装完成后即有了Jupyter，无需重新安装。 不过，还是建议安装miniconda，所需空间小，后续需要什么再用conda命令安装，也很方便。 接着安装Jupyter Notebook: 1conda install jupyter 以上，就基本搭建了一个基础版本的python。 安装Jupyter插件Jupyter Notebook的cell和代码过多时，上下翻页很不方便，浪费时间，因此想要安装插件实现目录的功能，找到了jupyter_contrib_nbextensions，安装过程很方便： 提前关掉正在运行的jupyter notebook。 以管理员身份打开conda命令行，安装： 1conda install -c conda-forge jupyter_contrib_nbextensions 然后，再重新打开jupyter notebook，菜单栏即多了Nbextensions一项，选择需要的插件功能即可，比如目录。 一些建议打开的插件： 目录 Table of Contents 代码美化 Code prettify 代码折叠 Codefolding 通知 Notify 运行完毕后会弹出窗口提示notebook处于空闲状态。 创建新conda环境最好不要在base环境下安装各种包，以免包之间有冲突，尤其是python2和python3，影响运行。为每个项目创建一个新环境，并制定包的版本号： 1conda create -n water-energy 默认的env目录是~\\.conda，若要指定目录，则需添加--prefix： 1conda create --prefix C:\\ProgramData\\Miniconda3\\envs\\water-energy 在现在笔记本安装的env默认目录是C:\\ProgramData\\Miniconda3\\envs，不用更改即可。 如何将envs数据自动备份或同步？ .condarc conda configure file默认该文件是没有的，第一次在conda窗口执行conda config时便会在home directory下自动创建。在该文件中添加设置，如每次创建新env时自动安装的包等。 导出当前环境的各种设置1conda env export &gt; base_env.yml 然后，将base_env.yml复制到另一台计算机（win和macOS不通用；需要在yml文件中删除含有nbextensions的项目[搜索nb]，否则会报错，nbextensions需要单独安装）中，并根据该文件来创建env： 1conda env create -f base_env.yml 激活环境： 1conda activate env_name 退出环境： 1conda deactivate 查看env列表1conda env list 删除某一环境1conda env remove --name env_name 改变anaconda prompt窗口启动的默认目录位置和默认环境env 目录位置：右键anaconda prompt，属性，起始位置（写上想要默认开启的目录位置） 默认env: 一般默认的env是base，右键anaconda prompt属性中的目标为%windir%\\System32\\cmd.exe &quot;/K&quot; C:\\ProgramData\\Miniconda3\\Scripts\\activate.bat C:\\ProgramData\\Miniconda3 把最后的目录C:\\ProgramData\\Miniconda3替换为想要启动的目录位置（一般在.\\Miniconda3\\envs\\your_env_name中），比如C:\\ProgramData\\Miniconda3\\envs\\water-energy 难道没有anaconda命令可以完成这件事吗？ 常用的packages pandas: 与csv, txt, excel等格式数据交互的包。 numpy: 数组处理与计算","link":"/2019/06/06/tool/2018-01-20-python/"},{"title":"Shell编程相关","text":"curl脚本批量下载http数据主要工具：curl。 在UN Comtrade Database网站上获取全球贸易所有国家的双边数据时，可以用网站提供的网页端的下载窗口，但该端口不支持同时下载所有国家，进口国和出口国只能有一个选择all，因此，若要现在所有国家数据，会很费时费力，还好，该网站提供了API接口，方便我们编写程序批量下载。 该网站限制每小时只能查询下载100次，为了最大限度地提高下载效率，用以下代码，在unix终端（已在macOS上测试，未在Linux上测试）： 123456789101112131415# country_id 是一个国家代码的数组，一共254个国家，最后一个国家代码1000时为了凑数255country_id=(4 8 12 20 24 660 28 32 51 533 36 40 31 44 48 50 52 112 56 58 84 204 60 64 68 535 70 72 92 76 96 100 854 108 132 116 120 124 136 140 148 152 156 344 446 170 174 178 184 188 384 191 192 531 196 203 200 408 180 208 262 212 214 588 218 818 222 226 232 233 231 97 234 238 242 246 886 278 866 720 230 280 582 590 592 868 717 736 835 810 890 836 251 254 258 583 266 270 268 276 288 292 300 304 308 312 320 324 624 328 332 336 340 348 352 699 356 360 364 368 372 376 381 388 392 400 398 404 296 414 417 418 428 422 426 430 434 440 442 450 454 458 462 466 470 584 474 478 480 175 484 496 499 500 504 508 104 580 516 524 530 532 528 540 554 558 562 566 579 512 490 586 585 591 598 600 459 604 608 616 620 634 410 498 638 642 643 646 647 461 654 659 658 662 534 666 670 882 674 678 457 682 686 688 891 690 694 702 703 705 711 90 706 710 728 724 144 275 729 740 748 752 757 760 762 807 764 626 768 772 776 780 788 792 795 796 798 800 804 784 826 834 858 850 842 841 860 548 862 704 876 887 894 716 1000)# 查询的年份year=2016for i in $( seq 0 50); do # cc 代表商品代码，若要下载其他商品，请替代掉以下http中的cc=8703 # type: C-commodities, S-services # freq: A-Annual, M-Monthly # px: 分类代码，本文采用2012年的代码H4 # 其他代码的定义请参考https://comtrade.un.org/data/doc/api/#DataRequests curl \"https://comtrade.un.org/api/get?max=50000&amp;type=C&amp;freq=A&amp;px=H4&amp;ps=$&#123;year&#125;&amp;r=$&#123;country_id[`expr 5 \\* $&#123;i&#125;`]&#125;%2C$&#123;country_id[`expr 5 \\* $&#123;i&#125; + 1`]&#125;%2C$&#123;country_id[`expr 5 \\* $&#123;i&#125; + 2`]&#125;%2C$&#123;country_id[`expr 5 \\* $&#123;i&#125; + 3`]&#125;%2C$&#123;country_id[`expr 5 \\* $&#123;i&#125; + 4`]&#125;&amp;p=all&amp;rg=all&amp;cc=8703&amp;uitoken=ea87a35d7e9663b5afa4236febb8d495&amp;fmt=csv\" &gt;&gt; $&#123;year&#125;.csvdone# 删除重复的表头和查询无效的项目sed -i '/query/d' $&#123;year&#125;.csvsed -i '/Classification/d' $&#123;year&#125;.csv scp 下载远程服务器文件到本地12345# copy from HPC to Hydroscp mumf@192.168.29.10:~/./runoff_obs.tar.gz .# copy from Hydro to PCscp mumf@159.226.115.218:~/runoff_obs.tar.gz ~/Downloads/ 字符串操作获取文件列表名并替换成list形式12345# 查找以任意数字结尾的文件# $表示结尾，不加$表示开头str=`ls | grep '[0-9]$'`# 给前后加上单引号for s in $str;do echo \"'\"$&#123;s&#125;\"',\"; don","link":"/2019/06/06/tool/2018-03-20-shellscript/"},{"title":"Git工具安装与使用","text":"安装git工具下载安装，一路选择默认。 设置本地ssh 123ssh-keygen -t rsa -C \"mengfeimu@qq.com\"# enter file in which to save the key# 保持默认，点回车键 Github网站上添加SSH-KEY： 复制~/.ssh/id_rsa.pub中的所有内容， 1ssh-rsa .......... mengfeimu@qq.com Github -&gt; Settings -&gt; SSH and GPG Keys -&gt; New SSH key 验证是否配置成功： 1234ssh -T git@github.com# 输入yes# 若成功，则出现以下提示：# Hi mengfeimu! You've successfully authenticated, but GitHub does not provide shell access. 配置本地用户名和邮箱 123# 与github.com上的信息保持一致git config --global user.name \"mengfeimu\"git config --global user.email \"mengfeimu@qq.com\" 新建一个项目并上传到github打开github.com，创建一个新库，命名，不要勾选ReadME.md和任何license，然后在新的网页上会出现提示。在电脑本地目录中找到pyhspf的安装目录，然后在git bash工具中进入，执行操作： 12345git initgit add .git commit -m \"first commit\"git remote add origin git@github.com:mengfeimu/pyhspf_backup.gitgit push -u origin master clone已有Github项目到本地： 打开git bash，切换到目标目录 1git clone git@github.com:mengfeimu/test.git . 设置打开git bash时的默认工作路径： 点击git bash的图标 -&gt;properties -&gt; start in -&gt; C:\\ProgramData\\Miniconda3\\Lib\\site-packages\\pyhspf push and pull push 将本地的更改提交至GitHub 123git add .git commit -m \"add some comments\"git push pull: 将GitHub远程更改提回本地 1git pull","link":"/2019/06/06/tool/2018-07-27-git/"},{"title":"Chm转换pdf","text":"使用这个网站（优先用这一个！）： https://www.freefileconvert.com/ 或者这个 (有转换不完整的现象)： https://cloudconvert.com/chm-to-pdf 亲测都可用，10M文件转换需要几分钟，比较慢，耐心等待。","link":"/2019/06/06/tool/2018-04-23-chm2pdf/"},{"title":"GDAL、Pillow(PIL)安装出错：DLL Load Failed","text":"content{:toc}在conda下用pip install gdal尝试安装GDAL： 1pip install gdal 安装完成后，检查是否安装成功： 1from osgeo import gdal 报错：DLL load failed: The specified module could not be found. 解决办法如下：进入该网站，确定自己的python版本和Windows版本，手动下载whl文件，然后在conda下执行pip install 即可，尝试成功。 1pip install &#123;directory&#125;\\GDAL-2.4.1-cp36-cp36m-win_amd64.whl Pillow(PIL)安装错误也可按同样方法解决pillow需要安装3.4.2版本Pillow-3.4.2-cp36-cp36m-win_amd64.whl，6.0.0版本报错，原因未查：","link":"/2018/04/18/tool/2018-04-17-gdal-error/"},{"title":"百度网盘限速破解","text":"百度网盘下载限速很严重，逼人付钱成为会员的节奏。Github上有个开源项目破解了macOS版本的限速：BaiduNetdiskPlugin-macOS 在终端命令工具Terminal中输入： 1cd ~/Downloads &amp;&amp; git clone https://github.com/CodeTips/BaiduNetdiskPlugin-macOS.git &amp;&amp; ./BaiduNetdiskPlugin-macOS/Other/Install.sh 前提是需要安装git工具，若没有安装请自行百度。 安装成功后显示SVIP到2028年。这个只是在客户端更改的假VIP权限，登陆网页版或者其他平台的百度网盘依然是普通注册会员。","link":"/2019/06/06/tool/2018-05-07-百度网盘/"},{"title":"Windows装机软件","text":"Chrome登陆账户mengfeimu2020@gmail.com WIN10中设置为默认浏览器：Settings -&gt; Browser -&gt; Chrome 7-zip (pyhspf需要)：1C:\\Program Files\\7-Zip BASINS (pyhspf 需要)： 1C:\\BASINS41 Everything设置快捷键，快速启动窗口：Tools -&gt; Options -&gt; keyboard -&gt; show window key -&gt; Ctrl + Enter。 GitHub Desktop登陆mengfeimu@qq.com账户即可 Git bash参考git工具安装与使用 Anaconda for python参考python环境搭建一文安装完成Anaconda后，安装pyhspf，并将github自己的pyhspf代码同步到安装文件夹 以管理员身份打开anaconda prompt: 1pip install pyhspf 通过pip install pyhspf安装pyhspf过程中，遇到如下错误： 1TypeError: '&gt;=' not supported between instances of 'NoneType' and 'str' 解决如下： 1conda install -c anaconda mingw 安装pyhspf需要的包， 12345678910# No module named 'shapefile'conda install pyshp# No module named 'gdal'# 需单独下载gdal whl文件，参照https://mengfeimu.github.io/2018/04/17/gdal-error/pip install C:\\Users\\mengfei\\Downloads\\GDAL-2.2.4-cp36-cp36m-win_amd64.whl# 相同方法安装pillow# pyomo and ipopt, MAS model 需要conda install -c conda-forge pyomoconda install -c conda-forge ipopt 复制整个文件夹，保存到桌面或其他方便位置，文件夹命名为pyhspf_install，然后删除掉该文件夹： 1C:\\ProgramData\\Miniconda3\\Lib\\site-packages\\pyhspf 在github中打开pyhspf_backup项目，删除掉每个文件夹中的ini.py和__pycache文件夹 打开git bash: 1234# 切换目录cd /c/ProgramData/Miniconda3/Lib/site-packages/# clone github repo to local, named as pyhspfgit clone git@github.com:mengfeimu/pyhspf_backup.git pyhspf 复制桌面文件夹pyhspf_install中的所有内容，并重新粘贴到C:\\ProgramData\\Miniconda3\\Lib\\site-packages\\pyhspf，跳过已经存在的所有文件 运行Data\\water_energy\\codetest.ipynb，检验pyhspf是否安装成功 Zotero: 文献管理mengfeimu@qq.com 登陆后记得不要同步PDF附件，否则免费空间很快就被用完了。 设置不要保存文件和snapshots到zotero默认目录，只保存metadata： 1Edit -&gt; Preferences -&gt; File Handling --&gt; 可以设置PDF文件存储的相对路径，这样只要两台电脑上的相对路径内的文件结构、文件名不变，就可以同步，直接在Zotero条目双击就可以打开相应的文献PDF文件。 1Advanced -&gt; Files and Folders -&gt; Choose (base directory) -&gt; 选择对应的路径 注意：在链接文件时不要将PDF文件拖到Zotero里，否则会在Zotero内复制一份PDF，两台电脑同步也会有问题，而要点击Add link to File。 Notepad++：代码阅读与修改设置Tab键=4space: preferences-&gt;Language-&gt;Replace by space 每次打开Notepad++时以管理员身份打开，确保有写入权限 Sublime Text: 代码阅读与修改Notepad++对python函数列表的支持不是很好。弃用，改用sublime。 安装package control: https://packagecontrol.io/installation#st3 打开preferences -&gt; package control，或者Ctrl+Shift+P，输入install，选择第一项install package，输入想要安装的anaconda 设置python路径 windows下查看在jupyter notebook中输入 123import sysprint(sys.executable)# 输出结果即为python的路径 macOS下查看python路径，在terminal中输入： 1which python 打开preferences -&gt; Package settings -&gt; Anaconda -&gt; settings-default，找到&quot;python_interpreter&quot;，将路径替换为python路径 第一次使用sublime时设置git同步： 同步github项目sublimeText3_packages到本地sublime的数据目录（查看目录：preferences -&gt; browsing packages） 12cd local_dirgit clone git@github.com:mengfeimu/sublimeText3_packages.git . 重新打开sublime即可，自动依次下载以前安装过的packages。 需要重新设置Anaconda packages中的python路径。 Typora for MarkdownOfficeArcGISDropboxGoogle账户登陆 TeamViewer远程登录并控制桌面。个人版免费使用。 Foxmail将备份文件中的Foxmail从文件夹中拷贝到电脑中，直接打开即可。 Snipaste 截图portable，免安装。直接打开exe即可。F1截图，F3查看。 WIN10设置文件后缀名可见：Explorer -&gt; View -&gt; File name extensions","link":"/2019/06/06/tool/2018-07-13-windows装机/"},{"title":"Python之pandas","text":"安装 参照python环境搭建 读取csv文件 12345678910111213141516171819202122232425262728293031import pandas as pd# delimiter = 设置间隔符# names = 设置列名，适用于文件中没有列名直接是数据的情况，如果文件中已有列名，names = Nonecols = ['id', 'lat', 'lon', 'vars', 'firstY', 'lastY']df = pd.read_csv(inven_f, names=cols, delimiter='\\s+')# 选取某一列或某几列df['vars']df[['id', 'vars']]# 按某一列排序df.sort_values(by = 'var', ascending=True) # 升序# 按条件筛选df[df.lat &gt; 60]df[df['lat'] &gt; 60]df[df['vars'] == 'TMAX']# df[df.var == 'TMAX'] # 错误用法, 原因是var是pandas的保留字段，不要用var作为列名，改为vars之后就可以了# 多条件筛选 isin()# 'vars' == 列表中之一df[df.vars.isin(['ACMC','ACMH','ACSC','ACSH'])]df[df['vars'].isin(['ACMC','ACMH','ACSC','ACSH'])]# 筛选某列中包含某个字符片段的行df[df.id.str.contains('US')]## 以某个字符片段开头的行df[df.id.str.startswith('US')]# 查看不重复的值sorted(df.vars.unique()) resample 和 groupby小时数据求日平均值，即数据重采样，用resample： 12df.resample('D').mean().plot()# 若需要求月平均值，则用'M'，年平均值，用'Y'，三小时平均值'3H'。 求多年月平均值，则需要用groupby： 1df1 = df.groupby(by=df.index.month).mean().plot() 从这张两图即可看出resample和groupby的区别。","link":"/2019/06/06/tool/2018-06-14-python-pandas/"},{"title":"免费无限容量的照片备份与管理:Google Photos","text":"这两天Google I/O大会，看到了关于Google Photos的新闻，好像是以前就有的产品，现在更加强大。最大的卖点就是可以无限备份手机或者电脑上的照片和视频，只要你能接受最大清晰度16MP以下，也就是说几乎所有的手机拍的都可以在损失一点点清晰度的情况下上传到这里，而且是免费的、无限容量的。知乎上有很多关于安全性的讨论。对于我来讲，应该会把非私人的照片、风景照等放在上面，反正是无关紧要的东西，个人照片还是要单独本地备份的。 突然想到还可以用这家伙来做一个免费的图床，插入到博客链接中，在电脑上看清晰度很可以。 测试Google Photos图床功能（用iPhone 8 Plus拍摄 20180425） 更让我惊喜的是，上传了照片之后，会有自动推荐的滤镜效果，比自己动手美化的效果还要好，简直是黑科技。来看看这惊艳的效果： 原图 ​ Google Photos自动推荐的滤镜 当然，Google Photos最厉害的还是照片管理功能，它可以提供时间线管理，自动按拍照地点进行分类，进行人脸识别，你可以直接搜索某个地点、某个人、甚至是某个东西，比如搜索“汽车”，必会得到所有含有汽车的图片。虽然这些功能其他产品也有，比如Apple家的Photos，但是谷歌这次真的是非常有诚意的整合了如此多的功能，而且还免费，是非常值得试用的一款产品。 当然，本地备份还是一直要有的。","link":"/2019/06/06/tool/2018-05-12-GooglePhotos/"},{"title":"macOS下无法加载移动硬盘","text":"content{:toc} 打开终端命令行工具Terminal，查看：输入 diskutil list 找到对应的磁盘名称，加载：sudo diskutil mount /dev/disk2s3 输入密码 加载完成 参考了https://blog.csdn.net/tyforfreedom/article/details/48092901","link":"/2019/06/06/tool/2018-07-28-移动硬盘加载/"},{"title":"Python并行计算","text":"使用python自带multiprocessing来并行计算，代码如下： 1234567891011121314151617181920212223242526272829303132# 并行计算示例# do not run those code in jupyter notebook directly# save as a .py and run# if in jupyter notebook: %run ./download_NLDAS.pyfrom multiprocessing import Pool, cpu_countt1 = datetime.datetime.now()# your code and preprocessing# edit func and params for your purposedef func(param): # only one param x1 = param[0] x2 = param[1] # x3, x4, ... # your code # return a value if necessary# prepare paramsparams = []for i in range(0,100): params.append(y1[i],y2[i],... ) if __name__ == '__main__': __spec__ = \"ModuleSpec(name='builtins', loader=&lt;class '_frozen_importlib.BuiltinImporter'&gt;)\" cores = cpu_count() # leave one core idle cpu_count()-1 p = Pool(processes = cores, maxtasksperchild = 4) p.map(func, params) t2 = datetime.datetime.now() print(\"time:\",format(t2-t1))","link":"/2019/03/14/tool/python-parallel-并行/"},{"title":"Sublime Text 3","text":"安装sublime Text 3 官网下载安装：https://www.sublimetext.com/ 安装package control: https://packagecontrol.io/installation#st3 打开preferences -&gt; package control，或者Ctrl+Shift+P，输入install，选择第一项install package，输入想要安装的anaconda 设置python路径 windows下查看在jupyter notebook中输入 123import sysprint(sys.executable)# 输出结果即为python的路径 macOS下查看python路径，在terminal中输入： 1which python 打开preferences -&gt; Package settings -&gt; Anaconda -&gt; settings-default，找到”python_interpreter”，将路径替换为python路径 第一次使用sublime时，设置git同步，参照git工具安装与使用： 同步github项目sublimeText3_packages到本地sublime的数据目录（查看目录：preferences -&gt; browsing packages） 12cd local_dirgit clone git@github.com:mengfeimu/sublimeText3_packages.git . 重新打开sublime即可，自动依次下载以前安装过的packages。 需要重新设置Anaconda packages中的python路径。 快捷键Alt + -: 跳转上次编辑的位置 Alt + Shift+-: 反跳转 Ctrl + B: 编译并运行 Ctrl + /: 注释 Ctrl + R: 显示函数列表 有用设置tab键用空格代替防止代码出错，用四个空格代替tab键的输出： 1\"translate_tabs_to_spaces\": true 自动检查拼写错误在sublime中依次打开preferences -&gt; settings -&gt; preferences.settings-user，添加一行： 1\"spell_check\": true, (也可以在preferences.settings-default中将spell_check的值false改为true) 一些有用的packagesAnacondaConvertToUTF8有些文本文件由于编码格式问题在macOS下打开乱码，安装此插件解决。 Alignment代码对齐，Ctrl+Alt+A AutoFileName在代码中自动补全文件路径和文件名。Tab EJS2.ejs文件代码高亮","link":"/2019/06/06/tool/2018-07-27-sublime/"},{"title":"Python Netcdf文件读写","text":"安装netcdf41conda install -c anaconda netcdf4 这样安装完后执行import netCDF4会报错： 12345678910111213---------------------------------------------------------------------------ImportError Traceback (most recent call last)&lt;ipython-input-3-9588a3d4fb24&gt; in &lt;module&gt;()----&gt; 1 import netCDF4C:\\ProgramData\\Miniconda3\\lib\\site-packages\\netCDF4\\__init__.py in &lt;module&gt;() 1 # init for netCDF4. package 2 # Docstring comes from extension module _netCDF4.----&gt; 3 from ._netCDF4 import * 4 # Need explicit imports for names beginning with underscores 5 from ._netCDF4 import __doc__, __pdoc__ImportError: DLL load failed: The specified module could not be found. 改用pip install netcdf4来安装，即可。 nc文件读取1234import netCDF4 as ncinfile = 'filename.nc'temp = nc.Dataset(infile)temp.variables['TMP2m_110_HTGL'][:]","link":"/2019/03/15/tool/python-netcdf/"},{"title":"Matplotlib画图时的科学计数","text":"matplotlib画图时，如果y轴数值太大（&lt;1e6）或太小，会导致y轴的数值标识太长，影响美观，应该用科学计数来避免： 12from matplotlib import pyplot as pltplt.gca().yaxis.get_major_formatter().set_powerlimits((n,m)) 这里的set_powerlimits((n,m))函数中的n和m是两个重要的参数，表示当y &lt; 1e-n或者y &gt; 1em时，使用科学计数。","link":"/2019/03/15/tool/matplotlib-科学计数/"},{"title":"记录Python程序运行时间","text":"123456789import datetimestart = datetime.datetime.now()# your functions and code hereend = datetime.datetime.now()print(\"Total runtime: &#123;&#125;\".format(t2-t1))","link":"/2019/02/20/tool/python-runtime/"},{"title":"提取流域边界、河流等信息","text":"以美国为例。 主要用到的数据是NHD (National Hydrography Dataset)、WBD (Watershed Boundary Dataset)数据。 查找某一地点所属流域在 The National Map Download查找并下载相应的WBD数据，如./San_juan中的数据，其中的WBDHU8.shp下文要用到。 提取河流等信息下载的WBD和NHD数据河流等级很低，所以需要进行处理，比较麻烦。是否有现成的包含河流分级的数据呢？在GISdata\\usa\\hydro文件夹下的stream_level.lyr中有美国的河流分级数据，加载到ArcGIS中，根据想要的分级数，选择即可。stream_level越大则代表支流，越小则代表干流。直接按条件筛选，得到的结果不完美，需要手动删除某些多余的线，可结合wiki中的流域图进行编辑筛选。 总感觉不应该这么麻烦才是，一定有更简便的方法我还不知道。 某些流域的问题在kaskaskia流域，如上的stream_level.lyr中，选择level 3显示的河流信息较少，选择level 4显示的支流太多。没法直接使用stream_level.lyr来生成想要的河网信息。采用hydrosheds.org提供的na_riv_15s手动提取想要的河网信息。 尝试用hydrosheds.org提供的river network （需转换成raster格式）和 flow accumulation进行河网分级，但效果很差。hydrosheds.org计划以后将提供河网分级数据，但目前还没有，参考https://hydrosheds.cr.usgs.gov/hydro.php。","link":"/2019/03/22/tool/python-watershed-boundary/"},{"title":"Pickle存储变量到文件","text":"利用pickle包来将变量存储到一个单独的文件中，方便日后读取和处理，就不用每次都读取原始文件了。 存储pickle.dump() 1234# write hourly data to a file, read from original files costs long timetempfile = indir + '/tair_rh_1982_2012.dump'with open(tempfile, \"wb\") as temp: pickle.dump([tair, rh], temp) 读取pickle.load() 12345# read hourly data from .dump filestempfile = indir + '/tair_rh_1982_2012.dump'with open(tempfile, 'rb') as temp: tempdata = pickle.load(temp) tair, rh = tempdata[0], tempdata[1]","link":"/2019/03/21/tool/python-pickle/"},{"title":"python读取.shp文件","text":"有时需要用python读取.shp或.dbf文件来获取信息，比用ArcGIS方便。 所用到的包shapefile 读取shapefile1234567891011# 例子：读取shpefile中的HUC8代码import shapefile# conda install pyshp if you can't import shapefileinfile = '../../ArcGis/US_shape/watershed/San_Juan/WBDHU8.shp'sf = shapefile.Reader(infile)HUC8s = []for record in sf.records(): HUC8s.append(record[sf.fields.index(['HUC8', 'C', 8, 0])-1])","link":"/2019/03/22/tool/python-shapefile/"}],"tags":[{"name":"书","slug":"书","link":"/tags/书/"},{"name":"影评","slug":"影评","link":"/tags/影评/"},{"name":"Markdown","slug":"Markdown","link":"/tags/Markdown/"},{"name":"Typora","slug":"Typora","link":"/tags/Typora/"},{"name":"pandoc","slug":"pandoc","link":"/tags/pandoc/"},{"name":"音乐","slug":"音乐","link":"/tags/音乐/"},{"name":"WIN","slug":"WIN","link":"/tags/WIN/"},{"name":"公务员","slug":"公务员","link":"/tags/公务员/"},{"name":"Anaconda","slug":"Anaconda","link":"/tags/Anaconda/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"git","slug":"git","link":"/tags/git/"},{"name":"python","slug":"python","link":"/tags/python/"},{"name":"macOS","slug":"macOS","link":"/tags/macOS/"},{"name":"unix","slug":"unix","link":"/tags/unix/"},{"name":"shell","slug":"shell","link":"/tags/shell/"},{"name":"Google","slug":"Google","link":"/tags/Google/"},{"name":"周杰伦","slug":"周杰伦","link":"/tags/周杰伦/"},{"name":"The Beatles","slug":"The-Beatles","link":"/tags/The-Beatles/"},{"name":"LaTeX","slug":"LaTeX","link":"/tags/LaTeX/"},{"name":"房地产","slug":"房地产","link":"/tags/房地产/"},{"name":"Jupyter","slug":"Jupyter","link":"/tags/Jupyter/"},{"name":"pdf","slug":"pdf","link":"/tags/pdf/"},{"name":"破解","slug":"破解","link":"/tags/破解/"},{"name":"sublime","slug":"sublime","link":"/tags/sublime/"},{"name":"matplotlib","slug":"matplotlib","link":"/tags/matplotlib/"}],"categories":[{"name":"日常","slug":"日常","link":"/categories/日常/"},{"name":"工具","slug":"工具","link":"/categories/工具/"},{"name":"Data","slug":"Data","link":"/categories/Data/"},{"name":"其他","slug":"其他","link":"/categories/其他/"},{"name":"音乐","slug":"音乐","link":"/categories/音乐/"}]}