{"pages":[],"posts":[{"title":"Sed & Awk Commands","text":"content{:toc} Sed and Awk are two powerful tools to manipulate text formatted files on Unix/Linux.This is not a tutorial but some real codes applied in my research.For basic introduction and syntax, please go toSed orAwk. 1. Use Shell variables in SedThe following command lines insert a string before the first line of file temp.txt:1234567891011sed '1i I want to insert a string into file temp.txt'``` but when you want to insert a longer sentence, or you want to read some lines from another file, store them in a Shell variable, and then insert them into the targeted file, the following commands really help:```bash resids=\"I want to insert a longer sentence, more and more....\"sed \"1i $&#123;resids&#125;\" temp.txt |less NOTE: must use double quotes when you want to use shell variables. 2. Overlap problem when appending a string to a shell variable passed from awk output12name=$(awk '&#123;print $2&#125;' name.txt)echo $name the output will be:1wbksesco the output sees strange. Actually, there is a \\r in each line making this strange thing happen. The solution is to use sed to replace \\r:12name=$(awk '&#123;print $2&#125;' name.txt |sed 's/\\r//g)echo $name the right output will be:1agr alcr altus ancr arbuck arne bbne bbr bfr bhr blr bonc boyr cane carterco cbks ccdt ccr cheney cmo cobb dane dfr eapr edne foss frr gibr gler graresco greresco guwy hbne hcne hebr hgh hsne htoothr hvr jamr jmrcadco keyr ksks kwks ler lfrm limr lmne ltr lvks mcdh mrne nasty nelr norman patr pbr pist pshr ptr puer rueresco sanford semr sharesco sher shr swtr toms trgt trne turq twiresco waks wbks","link":"/2019/06/06/en/2016-12-30-sedAwkUnixCommand/"},{"title":"ImageMagick","text":"1. combine several figures into onehorizontally:1convert +append 1.jpg 2.jpg 3.jpg combined.jpg vertically:1convert -append 1.jpg 2.jpg 3.jpg combined.jpg","link":"/2019/06/06/en/2017-07-18-ImageMagick/"},{"title":"Google Earth Engine","text":"网址：https://code.earthengine.google.com/ 1. Remove geometry from feature collectionCreate a function like below:123var rmGeo = function(feature) &#123; return ee.Feature(feature.select(['property 1', 'property 2'], null, false)); &#125;); and then apply this function to the feature collection named fc:1var newFc = fc.map(rmGeo);","link":"/2019/06/06/en/2017-07-06-GoogleEarthEngine/"}],"tags":[{"name":"Awk","slug":"Awk","link":"/en/tags/Awk/"},{"name":"Sed","slug":"Sed","link":"/en/tags/Sed/"},{"name":"Shell","slug":"Shell","link":"/en/tags/Shell/"},{"name":"ImageMagick","slug":"ImageMagick","link":"/en/tags/ImageMagick/"},{"name":"GEE","slug":"GEE","link":"/en/tags/GEE/"}],"categories":[{"name":"工具","slug":"工具","link":"/en/categories/工具/"}]}